{
  "76758": "The hypocrites or the disbelievers.",
  "76759": "See footnote for 10:61.",
  "76760": "See footnote for 7:54.",
  "76761": "The Prophet (ﷺ).",
  "76762": "i.e., the angels and the prophets.",
  "76763": "Typically, the poor and the helpless are the first to believe in prophets, taking them as saviours, whereas the rich and powerful are hesitant to believe, perceiving the new faith as a threat to their influence.",
  "76764": "Mercy here means prophethood.",
  "76765": "Muḥammad (ﷺ).",
  "76766": "Noah was given a signal that once the water gushes out of a particular oven then the Flood is about to begin. It can also be translated as: “The fountains of the earth gushed forth.”",
  "76767": "lit., there is no moving creature that He does not hold by its forelock.",
  "76768": "lit., my Lord is on the Straight Path.",
  "76769": "They believed that Ṣâliḥ had the potential to be their future leader.",
  "76770": "The she-camel came out of a mountain as a sign for them.",
  "76771": "In ancient Middle Eastern culture, if a guest refused to eat the food provided by their host, it was a sign of ill-will.",
  "76772": "She laughed after her husband was assured that the guests intended no harm or when she heard the news of the imminent destruction of the sinful people of Lot.",
  "76773": "Since the angels came in the form of handsome men, Lot was worried for the dignity and safety of his guests among his people—not knowing that they were angels.",
  "76774": "Single women of his community.",
  "76775": "Lot’s wife disbelieved in his message. It is believed that she is the one who informed the people of Lot’s handsome guests.",
  "76776": "Geographically and chronologically.",
  "76777": "Sinful believers will eventually be removed from Hell after receiving their punishment.",
  "76778": "Except the time they spend on earth and in the grave, or except the time the sinful believers spend in Hell before being transferred to Paradise.",
  "76779": "That He will delay their judgment until the Hereafter.",
  "76780": "This verse talks about the five daily prayers. The prayers at the two ends of the day are the dawn prayer (Fajr) at one end and the afternoon prayers (Ẓuhr and ’Aṣr) at the other. Prayers in the early part of the night include the sunset (Maghrib) and late evening (’Ishâ') prayers."
}