{
  "76781": "Quran literally means recitation.",
  "76782": "The address here is to the Arabs and, by extension, all of humanity.",
  "76783": "This dream came true at the end of the story (see 12:100).",
  "76784": "Unlike Joseph’s other brothers, Benjamin was Joseph’s full brother. They lost their mother at a young age, so their half-brothers thought that their father loved them more.",
  "76785": "They stained Joseph’s shirt with blood from a sheep, but forgot to tear his shirt. So Jacob became suspicious when he saw the intact shirt.",
  "76786": "i.e., patience without complaining.",
  "76787": "Other possible translations: 1. “… so little did they value him.” 2. “… they had no interest in him.” In any case, they wanted to sell him immediately before someone claimed him. According to some Quran commentators, it was Joseph’s brothers who sold him to the travellers after he was picked up from the well. The verse states that Joseph was sold for a few worthless coins. Ironically, in 12:88 Joseph’s brothers came to him after he became Egypt’s Chief Minister, begging for supplies and saying that the only money they could afford was a few worthless coins. This is when Joseph revealed his true identity to them.",
  "76788": "Potiphar, the Chief Minister of Egypt (Al-’Azîz).",
  "76789": "Joseph (ﷺ) received warning against fornication either through divine inspiration or a vision of his father.",
  "76790": "She was urged to seek forgiveness from her husband.",
  "76791": "The women’s only objection was because the wife of the Chief Minister was in love with someone raised in her house like a son.",
  "76792": "lit., ‘their cunning’ because the women themselves were probably interested in Joseph.",
  "76793": "The women were cutting fruit, and when Joseph came out they were so impressed by his beauty that they sliced through the fruit and into their hands without knowing.",
  "76794": "The women tried to convince him to obey the Chief Minister’s wife, so Joseph prayed to Allah to keep him away from them.",
  "76795": "To stop women from being charmed by Joseph’s beauty, or to put an end to the rumours, or to keep him away from the Minister’s wife.",
  "76796": "Meaning, “You call them gods while in fact they are not gods.”",
  "76797": "The King of Egypt.",
  "76798": "In the Bible (the Book of Genesis), this ruler is referred to as a pharaoh, while in the Quran he is referred to as a king. Typically, Egypt was ruled by pharaohs, but there existed a brief period in Egyptian history in which Egypt was ruled by the Hyksos invaders (1700-1550 B.C.E.). Hyksos rulers were called kings, not pharaohs. Joseph entered Egypt during the reign of the Hyksos, who used to appoint some foreigners to prominent positions in Egypt. According to The Jewish Encyclopedia, “Those who regard the Joseph stories as historical generally hold that the Pharaoh by whom Joseph was made the practical ruler of Egypt was one of the Hyksos kings.” \"Joseph,\" The Jewish Encyclopedia, Volume VII (London: Funk and Wagnalls Company, 1916), p. 252.",
  "76799": "i.e., Benjamin. When Joseph hosted his half-brothers, they told him the number of people in their household for future supplies.",
  "76800": "He told them that every three or four of them should enter through a different gate. His desire was to protect them from envy and harm.",
  "76801": "Joseph was falsely accused of theft when he was young.",
  "76802": "He meant: I did not steal anything, nor did my brother ˹Benjamin˺. You are the real thieves; you stole me from my father and threw me into the well.",
  "76803": "We did not know when we gave you our solemn oath that our brother was going to steal.",
  "76804": "i.e., patience without complaining.",
  "76805": "Jacob (ﷺ) cried for so long that he became very weak-sighted. Some scholars suggest that he lost his sight completely. This does not contradict Jacob’s beautiful patience because he did not complain to anyone, but expressed his sorrow only to Allah.",
  "76806": "Jacob (ﷺ) delayed the prayer for his children to be forgiven until pre-dawn, which is a blessed time for supplication.",
  "76807": "Joseph’s parents and his eleven brothers prostrated before him out of respect, not as an act of worship. This was permissible in their tradition, but in Islam, Muslims prostrate only to Allah.",
  "76808": "Joseph (ﷺ) did not mention how Allah saved him from the well because he did not want to embarrass his brothers after forgiving them.",
  "76809": "lit., as a Muslim.",
  "76810": "This includes Joseph’s brothers, the travellers who picked him up from the well and sold him into slavery, and the Chief Minister’s wife and other women in the city."
}