{
  "76839": "The verse refers to the diverse creatures that have been created for the service of humanity.",
  "76840": "This verse refers to a tyrant king who ordered the building of a tower so he can reach the heavens and fight Allah and the angels. Eventually the tower collapsed, leaving the tyrant crushed.",
  "76841": "lit., prostrates.",
  "76842": "The angels.",
  "76843": "Some pagan Arabs used to bury their infant daughters alive for fear of shame or poverty. This practice was condemned and abolished by Islam. See 6:151 and 81:8-9.",
  "76844": "They say that Allah has daughters (i.e., the angels), although they themselves do not like to have daughters.",
  "76845": "lit., pleasant for those who drink.",
  "76846": "Intoxicants were later prohibited in the Quran in three stages: 2:19, 4:43, and finally 5:90-91.",
  "76847": "In other words, if the pagan slave-masters are not willing to be equal to their slaves, why would they make anyone equal to Allah—the Supreme Master and Creator of all things?",
  "76848": "Ḥafadah means grandchildren, but can also mean children-in-law.",
  "76849": "The two parables emphasize that Almighty Allah masterfully conducts the affairs of the heavens and the earth, whereas false gods are incapable of anything. If this is the case, these gods are not His equal and He is the only one worthy of worship.",
  "76850": "He guides those who are sincere in their quest for guidance.",
  "76851": "See footnote for 2:106.",
  "76852": "The angel Gabriel.",
  "76853": "Some Meccan pagans claimed that the Prophet (ﷺ) received the Quran from a non-Arab slave owned by an Arab pagan.",
  "76854": "This refers to ’Ammâr ibn Yâsser, an early revert to Islam, who was tortured to leave Islam. To save his life, ’Ammâr pretended to denounce Islam, but his heart was full of faith. When he told the Prophet (ﷺ) about what happened, this verse was revealed, reassuring him that his faith was intact.",
  "76855": "See footnote for 2:173.",
  "76856": "What is mentioned in 6:146.",
  "76857": "i.e., honourable mention and a righteous family.",
  "76858": "This verse refers to the Jews who claimed that Abraham was Jewish. See 3:65-68."
}