{
  "76859": "Al-Isrâ' refers to the Prophet’s Night Journey from Mecca to Jerusalem about a year before his emigration (or Hijrah) from Mecca to Medina. This journey came as a comfort for the Prophet after several years of hardship and persecution, which included a 3-year siege by Meccan pagans, who drove the Muslims out of the city and forbade anyone from trading, marrying, or feeding them. This was followed by the “Year of Sadness,” which included the death of the Prophet’s uncle Abu Ṭâlib, the major defender of Muḥammad (ﷺ) despite his disbelief in his message, as well as the death of the Prophet’s beloved wife Khadîjah. The Prophet was carried overnight by a noble steed (called Burâq) from Mecca to Jerusalem where he met some earlier prophets and led them in prayer. He was later carried to the heavens (this journey is called Al-Mi’râj, or the Ascension) where he received direct orders from Allah to observe five daily prayers. The Ascension is referred to in 53:13–18.",
  "76860": "i.e., Allah.",
  "76861": "Some people are quick to pray against themselves or others in times of anger and frustration.",
  "76862": "This refers to the deeds that one is destined to do of their own free will. Out of His infinite knowledge, Allah knows people’s choices even before they make them. In the Hereafter, He will raise them from the dead for judgment.",
  "76863": "For example, in retaliation for intentional killing through legal channels.",
  "76864": "Here the word wali, “heir,” actually means awliyâ' or “heirs,” which includes the closest relatives, both men and women.",
  "76865": "By killing anyone other than the killer, or killing others with the killer.",
  "76866": "Some pagans had the belief that the angels are the daughters of Allah.",
  "76867": "They rejected you as a magician, a poet, a fabricator, and madman.",
  "76868": "When everyone is raised from the dead, they will all praise Allah, regardless of what they had believed in this life.",
  "76869": "The reason David is singled out here is because some Jewish authorities at the time of the Prophet (ﷺ) claimed that no scripture had been revealed after Moses. So this verse refutes this claim by referring to the Psalms of David.",
  "76870": "i.e., Jesus, Ezra, and the angels. Idol worship is refuted in other passages such as 7:191-198 and 34:22.",
  "76871": "Or they did wrong by it.",
  "76872": "During the Night Journey mentioned in 17:1.",
  "76873": "The tree of Zaqqûm which grows in the depths of Hell as mentioned in 37:62-65. The pagans of Mecca used to make fun of the Prophet (ﷺ) and say, “How can a tree grow in Hell?”",
  "76874": "See footnote for 2:34.",
  "76875": "Other meanings include: with their record of deeds, or their prophet, or their scripture.",
  "76876": "The pagans of Mecca tried in vain to dissuade the Prophet (ﷺ) from preaching the message of Islam. In some instances they offered to worship his Allah if he agreed to bow to their idols, and some even offered him riches and positions if he just stopped preaching in the city.",
  "76877": "This verse gives the times of the five daily prayers: the decline of the sun refers to the afternoon and late afternoon prayers, the darkness of night refers to sunset and late evening prayers, then the dawn prayer.",
  "76878": "This refers to the time when the Prophet (ﷺ) will make intercession (shafâ’ah) on the Day of Judgment.",
  "76879": "This verse was revealed when the Prophet (ﷺ) received the order to emigrate from Mecca to Medina. So here he (ﷺ) is praying to leave Mecca honourably and enter Medina honourably. It can also apply to any worldly activity that a person starts and finishes.",
  "76880": "The nine signs of Moses are: the staff, the hand (both mentioned in 20:17-22), famine, shortage of crops, floods, locusts, lice, frogs, and blood (all mentioned in 7:130-133). These signs came as proofs for Pharaoh and the Egyptians. Otherwise, Moses had some other signs such water gushing out of the rock after he hit it with his staff, and splitting the sea.",
  "76881": "This may also refer to the second warning in 17:7.",
  "76882": "i.e., the faithful among the scholars of the Torah and the Gospel.",
  "76883": "i.e., Jesus, Ezra, or the angels.",
  "76884": "i.e., another god equal to Him.",
  "76885": "i.e., the idols."
}