{
  "76886": "Muḥammad (ﷺ).",
  "76887": "i.e., Jesus in Christianity and the angels in Arab pagan tradition.",
  "76888": "Ar-Raqîm is the plaque that was placed at the entrance of the cave with the names and story of the People of the Cave. This is the story of a group of Christian youths who hid inside a cave outside the city of Ephesus around 250 C.E., to escape persecution at the hands of pagans during the reign of the Roman emperor Decius. The Quran does not give an exact number of the youths, although many scholars believe there were seven in addition to a dog. The youths slept for 300 years, plus nine (300 solar years equal 309 lunar years).",
  "76889": "lit., We cast a cover of ˹deep˺ sleep over their ears.",
  "76890": "The People of the Cave themselves disagreed on how long they had slept in the cave. See 18:19.",
  "76891": "While they slept in the open space of the cave, fresh air blew through the cave, but they were protected from the heat of the sun.",
  "76892": "This is because, during their long sleep, their eyes were open, their hair grew long, and their bodies rolled over to the right and left to prevent bedsores.",
  "76893": "Their antique silver coins gave them away. People rushed to the cave to greet the youths, who finally passed away and were buried in the cave. The King decided to build a place of worship at the cave to commemorate their story.",
  "76894": "Some pagans suggested that a wall should be built to seal off the cave, whereas the believers decided to build a place of worship at the cave to honour those youths.",
  "76895": "Based on what has been revealed in the Quran.",
  "76896": "Three hundred years in the Gregorian calendar equal three hundred and nine years in the Islamic lunar calendar.",
  "76897": "lit., seeking His Face.",
  "76898": "The word “thamar” can mean fruits, gold and silver, etc.",
  "76899": "Created your father, Adam, from dust.",
  "76900": "This refers to good deeds that will benefit the believer in the Hereafter such as prayers or praises of Allah such as saying: ‘Subḥâna-Allâh’ (Glory be to Allah), ‘Alḥamdulillâh’ (Praise be to Allah), ‘Lâ ilâha illa-Allâh’ (There is no god ˹worthy of worship˺ except Allah), and ‘Allâhu akbar’ (Allah is the Greatest).",
  "76901": "See footnote for 2:34.",
  "76902": "i.e., the peoples of ’Ȃd and Thamûd.",
  "76903": "It is reported in an authentic narration collected by Bukhâri that a man approached Moses after he gave a talk and asked him, “Who is the most knowledgeable person on earth?” Moses responded, “That would be me!” So Allah revealed to Moses that he should not have said this and there was in fact someone who was more knowledgeable than him. Moses was commanded to travel to meet this man, named Al-Khaḍir, at the junction of the two seas (which could be the northern part of Sinai between the Red Sea and the Mediterranean Sea, or the Southern part of Sinai where the Rea Sea splits into the Gulf of Suez and the Gulf of Aqaba).",
  "76904": "Another possible translation: “The ˹salted˺ fish must have made its way into the sea. How strange!”",
  "76905": "Moses was given a sign: when he and his assistant Joshua (or Yûsha’ ibn Nûn) lost their food (a salted fish), this would be the place where they would find the man of knowledge.",
  "76906": "This is the royal ‘we’.",
  "76907": "The Prophet (ﷺ) commented on the story, “I wish Moses had been more patient so we can learn more from that wise man.”",
  "76908": "This is the story of a righteous king who travelled far and wide. He is titled Ⱬul-Qarnain (lit., the man of the two horns) because of his journeys to the far east and far west (or the two horns/points of sunrise and sunset). Some believe Ⱬul-Qarnain was Alexander the Great, but this is not sound since Alexander the Great was a polytheist. Many scholars believe it was Abu Kuraib Al-Ḥamiri, a righteous king from Yemen.",
  "76909": "They either had no clothes or homes to protect them from the sun.",
  "76910": "Gog and Magog are two wild peoples who were sealed off by a barrier built by Ⱬul-Qarnain to stop them from raiding their peaceful neighbours. There are many speculations as to their location, but none is supported by reliable sources. Their coming out is mentioned in 21:96-97 as one of the major signs of the final Hour.",
  "76911": "Gog and Magog.",
  "76912": "On the Day of Judgment, the Trumpet will be blown by an angel—causing all to die. When it is blown a second time, everyone will be raised from the dead to be assembled for the Judgment (see 39:68).",
  "76913": "i.e., the Quran.",
  "76914": "i.e., Jesus, Ezra, and the angels.",
  "76915": "Al-Firdaws, the highest place in Paradise."
}