{
  "76375": "See Stylistic Features for information about these letters.",
  "76376": "i.e., there is no doubt regarding its authenticity or consistency.",
  "76377": "The word muttaqi (plural muttaqûn) can be translated as one who is mindful ˹of Allah˺, devout, pious, God-fearing, righteous, or God-conscious.",
  "76378": "i.e., the belief in Allah, the angels, and the Day of Judgment.",
  "76379": "See Notes on Translation for information about the use of ˹O Prophet˺.",
  "76380": "When they were criticized for their close association with the pagans who were hostile to Muslims, they would argue that they only wanted to make peace between Muslims and their enemies.",
  "76381": "Muḥammad (ﷺ).",
  "76382": "Residents of Paradise will be in a perfect condition. There will be neither physical impurities such as illness, urination, defecation, or menstruation; nor spiritual blemishes such as jealousy, envy, or hatred.",
  "76383": "Allah knew that there would be many righteous people who would do good, make peace, and stand up for justice. Since humans have free choice, whoever chooses to believe and do good is better in the sight of Allah than all other beings, and whoever chooses to disbelieve and do evil is worse than all other beings. See 98:6-8.",
  "76384": "If you are true that Allah will never create anyone who is more honourable and knowledgeable than you.",
  "76385": "Prostration in this verse does not mean worship, but an act of respect. A similar occurrence can be found in Sûrah 12, where Jacob (ﷺ), his wife, and his eleven children knelt down before Joseph (ﷺ).",
  "76386": "Iblîs was the name of Satan before his fall from grace. Iblîs was not an angel, but one of the jinn (see 18:50). Jinn are another creation of Allah, similar to humans in that they—unlike angels—have free will, but are made of smokeless fire and live in another plane of existence.",
  "76387": "The command to prostrate was a test of obedience. Satan arrogantly refused to comply because he believed he was superior to Adam—arguing that Adam was made of mud while Satan was made of fire (see 7:12).",
  "76388": "Both Adam and Eve were deceived, both sinned, and both were later forgiven. There is no concept of original sin in Islam.",
  "76389": "i.e., humans and Satan.",
  "76390": "The prayer that Adam and Eve were inspired to say is mentioned in 7:23, “Our Lord! We have wronged ourselves. If You do not forgive us and have mercy on us, we will certainly be losers.”",
  "76391": "Israel is another name for Prophet Jacob.",
  "76392": "This refers to the passages in the Torah and the Gospel that call for the worship of the One True God, doing what is good, and avoiding what is evil.",
  "76393": "Trading Allah’s revelations for a fleeting gain is a recurring theme in the first few sûrahs of the Quran. This refers to the practice of some Jewish authorities in Medina who contradicted certain rulings in the Torah by giving people lenient opinions only to please them in exchange for money.",
  "76394": "The alms-tax (zakâh) is the payment of 2.5% of someone’s savings only if the amount is equivalent to or greater than 85 g of gold, if that amount remains untouched for a whole Islamic year—around 355 days.",
  "76395": "Meaning, I chose you above all peoples of your time.",
  "76396": "“Intercession” is the act of pleading with Allah on behalf of another person on the Day of Judgment.",
  "76397": "Manna (heavenly bread) and quails (chicken-like birds) sustained the children of Israel in the wilderness after they left Egypt.",
  "76398": "The Sabians are an indigenous group that believes in a supreme being and lives mostly in Iraq.",
  "76399": "This verse should be understood in light of 3:19 and 3:85. For more details, see the Introduction.",
  "76400": "Although many scholars believe that these individuals were turned into real apes, others interpret this verse in a metaphorical sense. This style is not uncommon in the Quran. See 62:5 regarding the donkey that carries books and 2:18 regarding the deaf, dumb, and blind.",
  "76401": "This sûrah is named after the cow in this story, which happened at the time of Moses (ﷺ). A rich man was killed by his nephew, his only heir, and the body was thrown at the door of an innocent man. After a long investigation, no one was identified as the killer. Moses (ﷺ) prayed for guidance and was told that the only way to find the killer was to sacrifice a cow and strike the victim with a piece of it. When this was done, the victim spoke miraculously and said who the killer was.",
  "76402": "i.e., verses prophesizing the coming of the Prophet (ﷺ) in the Torah (including Deuteronomy 18:15-18 and 33:2).",
  "76403": "i.e., warning of a curse or punishment.",
  "76404": "The indigenous people of Medina were divided into two warring groups: Al-Aws and Al-Khazraj. Some Jewish tribes were allied with the former and others with the latter, which meant that in times of war each of these Jewish tribes had to fight along with their allies against their enemies, including other Jews. When the Prophet (ﷺ) migrated to Medina, he brought about a lasting peace in the city.",
  "76405": "The holy spirit is Gabriel, a mighty angel created from light, whose main duty is to communicate Allah’s messages to prophets.",
  "76406": "Their hearts are unreceptive because they claim they have enough knowledge already.",
  "76407": "lit., the disbelievers.",
  "76408": "i.e., the Quran.",
  "76409": "i.e., disobeying Allah, killing some of the prophets (including Zachariah and John the Baptist), claiming to have killed Jesus, accusing Mary of adultery, and dealing with usury. See 4:153-158.",
  "76410": "The two angels, Hârût and Mârût, were sent to enlighten the people in Babylon so they would not confuse magic tricks with miracles. Still some people abused this knowledge, causing mischief in the land. These practices persisted until the time of Solomon, who himself was falsely accused of utilizing magic to run his kingdom, subdue the jinn, and control the wind.",
  "76411": "Some of the disbelievers used to  play with words when they addressed the Prophet (ﷺ) in order to ridicule him. So instead of saying, râ’ina “listen to us,” they would say, râ’îna “our shepherd” or “the foolish among us.” They would say loudly, “We listen,” then whisper, “but we disobey!” and say, “Hear us,” then, “may you never hear!” They used to say to each other, “If he had truly been a prophet of Allah, he would have known that we are mocking him.” Therefore, this verse (along with 4:46) was revealed commanding the believers to avoid such words altogether. Better words are recommended.",
  "76412": "The Quran was revealed over a period of twenty-three years. New rules were introduced when the believers were ready to accept and apply them. Replacing a ruling with another is called abrogation (naskh). For example, alcohol consumption was forbidden over three stages (see 2:219, 4:43, and 5:90, respectively). Some of the Prophet’s companions said, “If drinking had been forbidden from day one, no one would have accepted Islam!”",
  "76413": "i.e., asking to make Allah visible to them and make the angels talk to them.",
  "76414": "Or “Such people should not have even entered these places except with reverence.”",
  "76415": "lit., wherever you turn, there is the Face of Allah.",
  "76416": "His mercy and knowledge covers all.",
  "76417": "The Christians, pagans, etc.",
  "76418": "Jesus in Christianity, the angels in pagan Arab mythology, etc.",
  "76419": "“The Sacred House” (Ka’bah) is a cube-shaped building in Mecca, Islam’s holiest sanctuary, which Muslims face when they pray five times a day.",
  "76420": "“The standing-place of Abraham” is the stone on which Abraham stood while he was building the Ka’bah.",
  "76421": "lit., make both of us Muslims. The word “Muslim” means “one who submits to Allah.” All of the prophets submitted to Allah and were, therefore, Muslims.",
  "76422": "For about sixteen months after daily prayers became obligatory, Muslims used to face towards Jerusalem before the order came to face a new qiblah (direction of prayer)—the Sacred Mosque in Mecca.",
  "76423": "i.e., moderate, balanced, and outstanding.",
  "76424": "Ṣafa and Marwah are two hills near the Ka’bah in Mecca.",
  "76425": "Known as ḥajj and ’umrah to the Sacred Mosque in Mecca.",
  "76426": "Eating pork is forbidden in the Old Testament in Leviticus 11:7-8 and Deuteronomy 14:8.",
  "76427": "No one else should be executed in place of the killer. This verse was revealed regarding a particular incident. Nevertheless, the killer is killed regardless of the difference in gender or status, unless the victim’s family opts for blood money.",
  "76428": "The guardian is the victim’s closest heir—male or female.",
  "76429": "Or according to common law.",
  "76430": "This ruling should be understood in light of the inheritance laws in 4:11-12, which give specific shares to parents and close relatives. Relatives who do not have a share may get a bequest up to one third of the estate.",
  "76431": "After the death of the one who made the will.",
  "76432": "i.e., the followers of previous prophets.",
  "76433": "i.e., the month of Ramaḍân, the 9th month in the Islamic calendar.",
  "76434": "In the case of old age or chronic disease.",
  "76435": "“Garment” (libâs) is a metaphor for comfort, chastity, and protection.",
  "76436": "Initially, intimate relations during the night of Ramaḍân were not permissible. Since some Muslims could not resist not having intercourse with their spouses, this verse was revealed allowing intimacy during the nights preceding the fast.",
  "76437": "This implies offspring.",
  "76438": "Before Islam, there was a superstitious practice for pilgrims to enter their homes through the back door upon returning from the pilgrimage. The verse suggests that being devoted to Allah wholeheartedly is more important than blindly following old traditions.",
  "76439": "“Do not exceed the limits” refers to Islamic warfare guidelines set by the Prophet. In an authentic saying collected by Abu Dawûd, he (ﷺ) is reported to have instructed the Muslim army, “Depart in the Name of Allah and with His help—following the way of the Messenger of Allah. Do not kill an old man, a child, or a woman. Do not mutilate dead bodies of the enemy. Be gracious and courteous, for Allah loves those who act with grace.” The Prophet (ﷺ) also says, “Do not wish to meet your enemy in battle but always pray for well-being. If fighting is a must, then be steadfast.”",
  "76440": "This is probably the most misquoted verse from the Quran. To properly understand the verse, we need to put it into context. Misquoting verses and taking them out of context can be applied to any scripture. For example, in the Bible, Jesus says, “Do not think that I came to bring peace on earth. I did not come to bring peace but a sword!” (Matthew 10:34). He also says, “But as for these enemies of mine who did not want me to be their king—bring them here and slaughter them in my presence!” (Luke 19:27). And Moses says, “The Lord is a man of war, the Lord is his name.” (Exodus 15:3). For more details, see the Introduction.",
  "76441": "Persecuting Muslims to abandon their faith.",
  "76442": "The sacred months are the 1st, 7th, 11th, and 12th months of the Islamic calendar.",
  "76443": "Ḥajj, the pilgrimage to Mecca, is required at least once in a Muslim’s lifetime if they are physically and financially able to. ’Umrah, which is a short version of ḥajj, is recommended, but not obligatory.",
  "76444": "Although pilgrimage is performed over the course of a few days in the 12th month of the Islamic calendar, the intention to perform pilgrimage can be made during the 10th, 11th, and the first half of the 12th months.",
  "76445": "By trading during ḥajj season.",
  "76446": "’Arafât is a hill in Saudi Arabia, near Mecca, which is visited during pilgrimage.",
  "76447": "A sacred place called Muzdalifah.",
  "76448": "Swift in reckoning (sarî’ul-ḥisâb) means “He is quick in recording the deeds and judging them.”",
  "76449": "The 11th-13th of Ⱬul-Ḥijjah, the 12th month of the Islamic calendar. These days are part of pilgrimage rituals.",
  "76450": "Another possible translation: “And when they assume authority, they strive …”",
  "76451": "The pagans of Mecca.",
  "76452": "See footnote for 2:194.",
  "76453": "Persecuting Muslims to abandon their faith.",
  "76454": "While many traditional scholars maintain that apostates are to be first invited to re-enter the fold of Islam then executed if the invitation is turned down, some traditional and modern scholars (like Sufyân Ath-Thawri, the late Grand Imâm of Al-Azhar Sheikh Maḥmûd Shaltût, and Dr. Jamal Badawi) are of the opinion that the Quran (2:256) guarantees freedom of religion and (2:217) promises no worldly punishment for leaving Islam. It is reported in a ḥadîth collected by Imâm Muslim that a man came to the Prophet (ﷺ) in Medina and retracted the allegiance he had pledged to him (ﷺ)—leaving Islam. The Prophet (ﷺ) did not punish the man. The narrations that command the killing of apostates refer only to those who fight against Muslims—so they are killed for treason, not for apostasy. Other aḥâdîth are meant to deter those who conspired to accept Islam then leave it soon after only to shake the faith of early Muslims, as mentioned in 3:72.",
  "76455": "See footnote for 4:43.",
  "76456": "Literal translation, “They are your brothers.”",
  "76457": "By not allowing partnership between you and orphans.",
  "76458": "lit., “by His permission.”",
  "76459": "Do not have intercourse with them until their menstruation is over and they have taken a full bath.",
  "76460": "Ḥarth means “farmland”—the husband being like a farmer, the wife like productive land, and children like seeds—a metaphor for fertility and growth.",
  "76461": "It is permissible to have intimate relations in any position. However vaginal penetration during monthly cycles or while bleeding persists after childbirth (up to forty days) is not permitted.",
  "76462": "This can either imply “sending forth good deeds that will be rewarded in the next life” or—according to some interpretations—“engaging in foreplay with one’s spouse before intercourse.”",
  "76463": "This ruling is called ilâ'. Ilâ' means that a husband vows not to be intimate with his wife because of a dispute or any other legitimate reason. The verse here says if it is four months or less and the husband keeps his vow, then he does not have to make up for breaking his vow (by feeding ten poor people, or fasting three days), otherwise he will need to make up for breaking his vow. If the vow is made for over four months, the wife has the right to seek divorce after four months. Ilâ' should be avoided altogether since it deprives the wife of her right to sexual satisfaction. Instead, counselling is a better alternative at the time of dispute.",
  "76464": "This could mean “pregnancy” or “accurate information about monthly cycles.”",
  "76465": "A husband may separate from his wife after each of the first two counts of divorce or at the end of her waiting period (see 65:1-5) with dignity. If he chooses to stay with her after the first two counts of divorce then divorces her a third time, the marriage is terminated at the end of her third waiting period. The wife will have to marry and divorce another man before she can be remarried to her ex-husband (see 2:230). However, a woman marrying someone with the intention of getting divorced, in order to return to her first husband, is forbidden.",
  "76466": "The “limits of Allah” implies fidelity to one’s spouse according to Allah’s commands.",
  "76467": "If the wife does not want to continue in the marriage for legitimate reasons, then she can return the dowry (mahr) to the husband in compensation for divorce. This ruling is called khul’.",
  "76468": "“Wisdom” means the “sunnah” or the tradition of the Prophet (ﷺ) when it is mentioned along with the Book (i.e., the Quran).",
  "76469": "i.e., the guardians.",
  "76470": "During their waiting periods.",
  "76471": "As mentioned in several authentic sayings of Prophet Muḥammad (ﷺ), the middle prayer is the afternoon prayer, ’Aṣr.",
  "76472": "This ruling was later replaced by the ruling in 2:234.",
  "76473": "They fled in the wake of a plague or an enemy attack.",
  "76474": "Ṭalûṭ.",
  "76475": "Reassurance refers to the Torah.",
  "76476": "i.e., the staff of Moses and fragments of the Tablets.",
  "76477": "Those messengers mentioned earlier in this sûrah (see verse 136).",
  "76478": "i.e., Gabriel.",
  "76479": "This implies ransoming one’s self.",
  "76480": "i.e., friendly connections.",
  "76481": "The Arabic word kursi can either mean seat or knowledge. There are some narrations attributed to Prophet Muḥammad (ﷺ) that describe Allah’s Throne (’Arsh) as being greater than His Kursi.",
  "76482": "According to Muslim belief, this is the greatest verse in the Quran.",
  "76483": "This verse was revealed when some new Muslims tried to force their Jewish and Christian children to convert to Islam after the Prophet’s emigration (Hijrah) to Medina. The verse prohibits forced conversion.",
  "76484": "Bringing the donkey back to life.",
  "76485": "It could also mean “… seeking Allah’s pleasure and proving their sincerity.”",
  "76486": "Donations for a public cause may be done openly to encourage others to donate, whereas it is recommended to give charity to the poor secretly.",
  "76487": "lit., seeking the Face of Allah.",
  "76488": "Verse 281 is believed by many scholars to be the last verse revealed of the Quran.",
  "76489": "Generally speaking, there is a difference between witnessing and giving testimony before a judge. Verse 2:282 talks about witnessing a debt contract, not giving testimony. To fully understand the context of this verse, we need to keep in mind that 1500 years ago women did not normally participate in business transactions or travel with trading caravans and, therefore, not every woman had the expertise to witness a debt contract. Even if two women were available at the time of signing the contract, perhaps the primary witness might not be able to recall the details of the contract or appear before a judge because of compelling circumstances such as pregnancy or delivery. In any of these cases, the second woman will be a back-up. Some scholars maintain that one woman can be sufficient as a witness so long as she is reliable. As for giving testimony, a ruling can be made based on available testimony, regardless of the number or gender of the witnesses. For example, the beginning of Ramaḍân is usually confirmed by the sighting of the new moon, regardless of the gender of the person who sights the moon. Also the highest form of witness in Islam is for someone to testify they heard a narration (or ḥadîth) from the Prophet (ﷺ). An authentic ḥadîth is accepted by all Muslims regardless of the gender of the narrator. Moreover, if a husband accuses his wife of adultery and he has no witnesses, each spouse must testify five times that they are telling the truth and the other side is lying. Both testimonies are equal (see 24:6-10). In some cases, only women’s testimony is accepted while men’s testimony is rejected, such as testifying regarding a woman’s pregnancy or virginity."
}