{
  "76929": "Moses and his family lost their way in the dark while they were travelling from Midian to Egypt.",
  "76930": "Moses could have just said, “A staff.” But he volunteered to talk about the uses of the staff, adding that there are many other uses he has not mentioned, with the hope that Allah would ask him about it more. The reason is that Moses wanted to prolong the conversation with Allah as much as he could.",
  "76931": "Moses, who was dark-skinned, was asked to put his hand under his armpit. When he took it out it was shining white, but not out of a skin condition like vitiligo.",
  "76932": "Moses (ﷺ) put a brand of fire in his mouth, which hindered his speech as he grew up. In this verse, he prays to Allah to help him speak clearly, and his prayer is answered.",
  "76933": "In other words, Allah made Moses a likeable person so Pharaoh and his wife would agree to keep him.",
  "76934": "Moses had refused all wet-nurses that were brought for him.",
  "76935": "See footnote for 17:101.",
  "76936": "By saying that Moses’ miracle is pure magic.",
  "76937": "i.e., your prophet to receive the Tablets for your guidance.",
  "76938": "Manna (heavenly bread) and quails (chicken-like birds) sustained the children of Israel in the wilderness after they left Egypt.",
  "76939": "Moses selected a delegation of seventy people from his community to go to Mount Ṭûr where it was appointed for him to receive the Tablets. On the way, he rushed for the appointment with Allah, arriving before the delegation.",
  "76940": "The Sâmiri, or the man from Samaria, was a hypocrite who led the Children of Israel into idol-worship.",
  "76941": "To reveal the Torah for their guidance.",
  "76942": "To worship Allah alone until Moses returned with the Tablets.",
  "76943": "The jewellery they borrowed from their Egyptian neighbours before they fled Egypt.",
  "76944": "Moses’ orders are mentioned in 7:142.",
  "76945": "This verse could also be translated as follows: “I had an insight which they did not have, then grasped some knowledge from the messenger ˹Moses˺, but ˹later˺ threw it away. This is what my lower-self tempted me to do.” According to many Quran commentators, while Moses and the Children of Israel were crossing the sea to escape abuse by Pharaoh and his people, the Sâmiri saw Gabriel on a horse leading the way, and every time the horse touched the ground, it turned green. So the Sâmiri took a handful of dust from the hoof-prints of the horse, and later tossed it at the calf so it started to make a lowing sound.",
  "76946": "Meaning, alienated in the dessert, away from the people.",
  "76947": "lit., destined time.",
  "76948": "The Quran.",
  "76949": "See footnote for 18:99.",
  "76950": "This can also mean “blind.”",
  "76951": "This can also mean “footsteps.”",
  "76952": "Allah fully knows what fate awaits them and what they did in the world.",
  "76953": "Or “… they cannot encompass His knowledge.”",
  "76954": "The Prophet (ﷺ) was eager to recite the Quran while it was being revealed to him through the angel Gabriel. So he (ﷺ) was told to take his time to learn it by heart once the verses are properly delivered to him.",
  "76955": "See footnote for 2:34.",
  "76956": "There is no sun or cold weather in Paradise, only light. See 76:13.",
  "76957": "Unlike the Bible (Genesis 3), the Quran does not blame Eve for Adam’s fall from the Garden.",
  "76958": "The Reminder is another name for the Quran.",
  "76959": "That He will delay their judgment until the Hereafter.",
  "76960": "This verse refers to the times of the five daily prayers.",
  "76961": "The pagans of Mecca were not satisfied with a literary miracle in the form of the Quran, so they asked for a tangible miracle (see 17:90-91) similar to the staff of Moses.",
  "76962": "This either refers to the Biblical stories confirmed by the Quran or the prophecies of Muḥammad (ﷺ) in the Bible. Some Muslim scholars cite Deuteronomy 18:15-18 and 33:2, Isaiah 42, and John 14:16 as examples of the description of Prophet Muḥammad (ﷺ) in the Bible. However, Bible scholars interpret these verses differently."
}