{
  "76963": "lit., extinguished like ashes.",
  "76964": "That Allah has a partner and children.",
  "76965": "The Prophet (ﷺ) is ordered to challenge the pagans to produce logical and scriptural proofs for the existence of other gods beside Allah. The verses then argue that if there is more than one god, the different gods would have fought among themselves for domination, and the whole universe would have been ruined. The Quran, the Torah, and the Gospel are all in agreement that there is only One God.",
  "76966": "Some pagans claimed that the angels are Allah’s daughters.",
  "76968": "The signs of the heaven include the galaxies, planets, stars, etc., all of which have an orbit. Our planet orbits the sun, the sun orbits the Milky Way Galaxy, and the Milky Way Galaxy orbits the Virgo Supercluster, etc.",
  "76969": "This can also mean that they are in awe of their Lord as much in private as they are in public.",
  "76970": "It is reported in a ḥadîth collected by Bukhâri that Abraham (ﷺ) said, while being thrown into the fire, “Allah ˹alone˺ is sufficient ˹as an aid˺ for us and ˹He˺ is the best Protector.”",
  "76971": "Abraham and his nephew, Lot, migrated from Babel, Iraq to Jerusalem.",
  "76972": "i.e., the believers in his family.",
  "76973": "A man’s flock of sheep strayed into another man’s vineyard, eating and destroying all his produce. When the two men came to David for judgment, he ruled that the shepherd must give his animals to the vineyard owner in compensation for the damage. On their way out, the two men met young Solomon and the shepherd complained to him. Solomon discussed the case with his father, and suggested that the sheep should be kept with the man who lost his produce so he may benefit from their milk and wool, while the shepherd worked on the farm to restore it to its original state. Eventually the famer would take back his farm in perfect condition, and the sheep would be returned to the shepherd. David was impressed by his son’s insight and approved his fair judgment immediately.",
  "76974": "lit., devils.",
  "76975": "The jinn dived to bring him pearls.",
  "76976": "This refers to his loss of health, wealth, and children.",
  "76977": "Scholars are in disagreement as to whether Ⱬul-Kifl was a prophet or just a righteous man. Those who maintain that he was a prophet identify him with various Biblical prophets such as Ezekiel, Isaiah, and Obadiah.",
  "76978": "Or “thinking We will let him get away with it.” Jonah (ﷺ) had been met with denial for many years. When he sensed the coming of Allah’s torment, he abandoned his city without Allah’s permission. Eventually, his people repented before the coming of the torment, and Allah accepted their repentance (see 10:98), whereas Jonah ended up in the belly of the whale (see 37:140-148).",
  "76979": "The darkness of the night, the sea, and the belly of the whale.",
  "76980": "Meaning, “You will be there for eternity after all pass away.”",
  "76981": "Gabriel breathed into the sleeves of Mary’s garment so she conceived Jesus.",
  "76982": "See 18:93-99.",
  "76983": "i.e., the Final Hour.",
  "76984": "See footnote for 43:57-58.",
  "76985": "This refers to Psalm 37:29: “The righteous shall inherit the land.” See footnote for 39:47.",
  "76986": "Meaning, “We seek Allah’s help against your claims that He has partners ˹in worship˺.”"
}