{
  "76987": "Your father, Adam.",
  "76988": "Nuṭfah refers to the union of male and female gametes (sperm and egg) which results in the zygote after fertilization.",
  "76989": "’Alaqah, meaning the embryo resembles a leech.",
  "76990": "Muḍghah, meaning it resembles a chewed morsel.",
  "76991": "Fully formed or defected, evolving into a healthy embryo or ending in miscarriage.",
  "76992": "lit., they tumble on their faces.",
  "76993": "Meaning, no matter what the deniers do, Allah will never stop supporting His Prophet (ﷺ).",
  "76994": "See footnote for 2:62.",
  "76995": "Magi (singular: magus): Zoroastrians; fire-worshippers.",
  "76996": "lit., prostrate. Meaning, all beings submit to His Will.",
  "76997": "Another possible translation: “… and they have been guided to the Path of the Praiseworthy ˹God˺.”",
  "76998": "The Sacred Mosque is in Mecca.",
  "76999": "Generally, intending to do wrong does not necessitate a punishment, unless the person acts upon it. But the Sacred Mosque is unique in that intending to sin in it is sufficient to bring punishment from Allah, unless the person repents.",
  "77000": "According to Ibn Kathîr, Abraham (ﷺ) said to Allah, “But my voice cannot reach all peoples.” Allah responded, “You make the call, and We will deliver the invitation to all.”",
  "77001": "Spiritual benefits such as prayers, pilgrimage, and forgiveness of sins, as well as worldly benefits such as meeting Muslims from everywhere and trading.",
  "77002": "Shaving their hair, clipping nails, and taking a shower.",
  "77003": "See 5:3.",
  "77004": "Milking or riding them until the time for sacrifice.",
  "77005": "For over thirteen years, Muslims had not been allowed to fight back against the brutality of the Meccan pagans, leading to the emigration of the Prophet and many of his companions to Medina. As the hostilities continued, this verse was later revealed allowing Muslims to fight back in self-defence.",
  "77006": "The Day ˹of Judgment˺ is described as ’aqîm (lit., barren) because it will terminate all forms of life on earth and no new day will be born.",
  "77007": "Allah grants authority to some of His servants in this world, but none will have authority on Judgment Day except Him. See 3:26.",
  "77008": "For your service.",
  "77009": "All prophets came with the same message: have faith in one God and do good. But each faith-community had their own law.",
  "77010": "The Muslim code of life is called Sharî’ah, which means a “path.” For more information, see the Introduction.",
  "77011": "Another possible translation: “How weak are the seekers (i.e., the idols) and the sought (i.e., the fly)!”",
  "77012": "i.e., Muslims."
}