{
  "77013": "Zakâh means purification and growth. Paying alms-tax and charity are forms of purifying one’s wealth.",
  "77014": "lit., private parts.",
  "77015": "See footnote for 4:3.",
  "77016": "Al-Firdaws, the highest place in Paradise.",
  "77017": "Adam (ﷺ).",
  "77018": "See footnote for 22:5.",
  "77019": "This happens when the spirit is breathed into the embryo.",
  "77020": "So he may recover from his “madness” or die.",
  "77021": "Noah was given a signal that once the water gushes out of a particular oven then the Flood is about to begin. It can also be translated as: “The fountains of the earth gushed forth.”",
  "77022": "lit., signs.",
  "77023": "The nine signs are: the staff, the hand (both mentioned in 20:17-22), famine, shortage of crops, floods, locusts, lice, frogs, and blood (all mentioned in 7:130-133).",
  "77024": "It is reported in an authentic narration collected by At-Tirmiⱬi that ’Ȃishah, the Prophet’s wife, asked him (ﷺ) if this verse refers to those who steal or drink ˹alcohol˺. The Prophet (ﷺ) answered, “No, it refers to those who pray, fast, and donate, but are afraid that their deeds are rejected because they are not good enough.” Then he (ﷺ) recited the last part of the verse: “It is they who race to do good deeds, always taking the lead.”",
  "77025": "This refers to the believers’ good deeds mentioned in 23:57-62.",
  "77026": "Their desire that the universe has more than one God. See 21:22.",
  "77027": "This refers to famine which affected the pagans of Mecca.",
  "77028": "The Meccan pagans.",
  "77029": "Their claims that there are many gods, and that the Prophet is a liar, a poet, etc.",
  "77030": "Meaning, once they are dead, they will never return to the world.",
  "77031": "On the Day of Judgment, the Trumpet will be blown by an angel—causing all to die. When it is blown a second time, everyone will be raised from the dead for judgment (see 39:68).",
  "77032": "Everyone will be busy with their own situation.",
  "77033": "Compared to the length and misery of their stay in the grave and Hell, their worldly life will seem very short to them."
}