{
  "77034": "The address here is to legal authorities. Adultery has to be proven either by confession or the testimony of four reliable witnesses.",
  "77035": "It is reported in a ḥadîth collected by At-Tirmiⱬi that Marthad ibn Abi Marthad, a companion of the Prophet (ﷺ), asked if he could marry ’Anâq, a pagan prostitute he befriended in Mecca before he accepted Islam. So this verse was revealed. However, if someone committed a sin then later repented genuinely, they will be accepted by Allah and the rest of the believers.",
  "77036": "In order to be spared the punishment for false accusation.",
  "77037": "This ruling is called li’ân in Islamic legal system. Once the husband and the wife swear each five times, as specified in 24:6-9, the marriage is terminated forever—which means that they can never be remarried.",
  "77038": "Because now you can tell who is a true believer and who is a hypocrite.",
  "77039": "This refers to ’Abdullâh ibn Ubai, the leader of the hypocrites in Medina.",
  "77040": "This verse was revealed when Abu Bakr Aṣ-Ṣiddîq, ’Ȃishah’s father, swore to end his financial assistance to his poor cousin, Misṭaḥ ibn Athathah, for taking part in the rumours against ’Ȃishah. Once the verse was revealed, Abu Bakr resumed his assistance to Misṭaḥ.",
  "77041": "Immoral thoughts never cross the minds of these chaste women and, therefore, they never expect slander.",
  "77042": "This passage declares the innocence of ’Ȃishah, the Prophet’s wife.",
  "77043": "lit., non-residential buildings.",
  "77044": "i.e., hair, body shape, and underclothes.",
  "77045": "i.e., the face, hands, outer clothes, rings, kohl, and henna.",
  "77046": "i.e., hair, arms, and legs.",
  "77047": "This is a metaphor for the light of guidance in the heart of the believer.",
  "77048": "Meaning, the olive tree is wholesome because it is located in a central place, so it is hit by sunrays all day-long, and, therefore, the oil is of a premium quality.",
  "77049": "See footnote for 7:46.",
  "77050": "This is another scientific fact mentioned in the Quran: the existence of underwater waves, like layers.",
  "77051": "Those at fault.",
  "77052": "This is used in a sarcastic way. It means, “Save your oaths! Everyone knows you are only bluffing. It is actions that matter, not words.”",
  "77053": "The Prophet’s only duty is to deliver the message.",
  "77054": "Their only duty is to obey the Prophet (ﷺ) by submitting to Allah.",
  "77055": "There is no blame on any of the three if they do not march forth in Allah’s cause. Moreover, some Muslims would give the keys of their homes to one of those who could not march forth (namely the blind, the disabled, or the sick) or their own relatives and ask them to enter their houses and eat at will but these people were shy to do that.",
  "77056": "i.e., the home of your spouse or children.",
  "77057": "If someone is in the house, greet them by saying, ‘As-salâmu ’alaikum’ (peace be upon you).” But if there is no one there, you greet yourselves by saying, ‘Asalâmu ’alaina wa ’ala ’ibâd-illâhi aṣ-ṣâliḥîn’ (peace be upon us and all righteous servants of Allah).”",
  "77058": "There is also a different interpretation: “Do not call the Messenger ˹by his name˺ as you call one another.” In other words, Do not say, ‘O Muḥammad.’ Rather, say, ‘O Prophet.’",
  "77059": "Some hypocrites used to sneak out while the Prophet (ﷺ) was talking."
}