{
  "77060": "Al-Furqân, which is one of names of the Quran, means \"the Decisive Authority.”",
  "77061": "Prophet Muḥammad (ﷺ).",
  "77062": "For both humans and jinn.",
  "77063": "The Prophet (ﷺ).",
  "77064": "Some Arab pagans claimed that the Prophet (ﷺ) had been taught the Bible by some non-Arab Christians. The Quran itself (16:103) refutes this claim by arguing that a non-Arab could not come up with an eloquent Arabic scripture like the Quran when eloquent Arabs failed to produce something like it. For more details, see the Introduction.",
  "77065": "He forgives those who repent, and gives a grace period to those who do not.",
  "77066": "i.e., a magician, a poet, a fabricator, and a madman.",
  "77067": "What they have said about you are only excuses to justify their denial of the Hereafter.",
  "77068": "e.g., Jesus and the angels.",
  "77069": "Another possible translation: “They will say, ‘Glory be to You! We would not dare to take other lords besides You ˹so how can we claim to be lords?˺’”",
  "77070": "Another possible translation: “And the angels will say, ‘All good is forbidden to you!’”",
  "77071": "The good deeds of the disbelievers (like charity) will have no weight on Judgment Day.",
  "77072": "Some people (like kings and rulers) have some sort of authority in this world. But on Judgment Day Allah will be the sole authority.",
  "77073": "lit., messengers, because denying Noah was equal to denying all of Allah’s messengers.",
  "77074": "Ar-Rass means “well” or “water-pit”. This refers to a pagan people, along with Midian, to whom Allah sent Prophet Shu’aib.",
  "77075": "They neither pay attention, nor think for themselves. They only follow others blindly.",
  "77076": "Generally, animals are obedient and loyal to their masters who care for them and they seem to know their way, whereas Meccan pagans are disobedient and ungrateful to their Lord and Sustainer, choosing to stray from the right path.",
  "77077": "This means that one of the great miracles of Allah is that He allows the sun to rise in the morning, causing darkness to retreat. He could have stopped the sun and the earth from rotating, so half of the world would be engulfed in complete darkness, leading to an imbalance in the earth’s eco-systems and endangering life on the planet.",
  "77078": "This refers to estuaries where salt and fresh waters meet forming brackish water. Although both waters mix together, each still keeps its distinctive qualities.",
  "77079": "The mixture of sperm and egg.",
  "77080": "See footnote for 7:54.",
  "77081": "The sun.",
  "77082": "For example, in retaliation for intentional killing through legal channels."
}