{
  "77083": "For killing an Egyptian by mistake before prophethood. See 28:15-17.",
  "77084": "See previous footnote.",
  "77085": "Pharaoh and his soldiers.",
  "77086": "It is reported in an authentic narration collected by At-Tirmiⱬi that Prophet Muḥammad (ﷺ) said that Abraham (ﷺ) did not tell the full truth only on three different occasions: when he justified his absence from the pagan festival by saying ‘I am really sick’ (see 37:89), and when he destroyed the idols and blamed it on the biggest one (see 21:63), and when he said that Sarah was his sister to save her from a tyrant ruler.",
  "77087": "On a daily basis, Muslims invoke Allah’s blessings upon Prophet Muḥammad (ﷺ) and his family and Prophet Abraham (ﷺ) and his family, in both obligatory and optional prayers.",
  "77088": "A pure and sound heart is that of the believer, compared to that of the disbeliever and the hypocrite.",
  "77089": "Iblîs was the name of Satan before his fall from grace. See footnote for 2:34.",
  "77090": "lit., messengers, because denying Noah (ﷺ) was equal to denying all of Allah’s messengers.",
  "77091": "The pagans were accusing the impoverished believers of following Noah (ﷺ) only for personal gain, not out of sincere faith.",
  "77092": "lit., men of the world.",
  "77093": "Lot’s wife, who betrayed her husband.",
  "77094": "Unlike other prophets in this sûrah who are identified as the brothers of fellow tribesmen, Shu’aib is not identified as the brother of the people of the Aykah (which is the name of the forest where they used to worship a particular tree) because they are identified by faith, rather than a tribal connection.",
  "77095": "They were targeted by scorching heat, so they did not know where to go. Finally, a soothing cloud appeared in the sky, so they rushed to it for shade, then the cloud rained torment upon them, as they had requested.",
  "77096": "i.e., ’Abdullâh ibn Salâm, a Jewish authority, who accepted Islam during the time of the Prophet (ﷺ).",
  "77097": "The devils can no longer eavesdrop on heaven. See 72:8-10.",
  "77098": "This refers to fortune-tellers who listen to Satanic whispers, adding more lies as they pass on the information to people.",
  "77099": "lit., roam aimlessly in every valley."
}