{
  "77100": "lit., information. Moses and his family lost their way in the dark while they were travelling from Midian to Egypt.",
  "77101": "This refers to the angels who were present around the light.",
  "77102": "See footnote for 20:22.",
  "77103": "See footnote for 23:45.",
  "77104": "The privilege was their ability to communicate with members of the animal kingdom, control the wind, utilize the jinn for their service, etc.",
  "77105": "The Queen of Sheba is known in Islamic tradition as Bilkis.",
  "77106": "She wanted to test Solomon (ﷺ) to see if he was only a king (so he would be satisfied with a tribute) or a prophet (who would only settle with submission to the True God).",
  "77107": "If they refuse to submit.",
  "77108": "To explain why Prophet Solomon brought the Queen’s magnificent throne and built the marvellous palace, many traditional commentators cite some folkloric or legendary stories. However, none of these stories is supported by reliable Islamic sources.",
  "77109": "This refers to ’Aṣif ibn Barkhiya, a knowledgeable and righteous assistant of Solomon.",
  "77110": "Because he had refused her tribute.",
  "77111": "Bringing her well-guarded, mighty throne all the way from Sheba, Yemen.",
  "77112": "i.e., believers and disbelievers.",
  "77113": "lit., the evil.",
  "77114": "lit., the good.",
  "77115": "They were struck with famine, which they blamed on Ṣâliḥ and his followers.",
  "77116": "See footnote for 25:53.",
  "77117": "Via the stars and constellations.",
  "77118": "In the form of rain.",
  "77119": "By delaying their punishment and allowing them time to repent.",
  "77120": "Through their tongues or actions.",
  "77121": "The Record refers to the Preserved Tablet (Al-Lawḥ Al-Maḥfûẓ) in which Allah has written the destiny of His entire creation.",
  "77122": "The beast is believed to be one of the major signs of the Day of Judgment. No further details are given in reliable resources about this beast.",
  "77123": "To demonstrate His ability to bring people back to life, Allah usually refers to some wonders of His creation, such as the planets, the alternation of the day and night, the mountains, and the development of the human embryo.",
  "77124": "The Trumpet will be blown at two different occasions, signalling the beginning of Judgment Day. The first blow will cause all creation to die, except whoever Allah spares, and the second one will cause them to be raised from the dead."
}