{
  "77125": "It is commonly believed that Hamân was in charge of architecture during the reign of Pharaoh at the time of Moses (ﷺ).",
  "77126": "The fulfilment of the Pharaoh’s old dream that his reign would come to an end at the hands of a boy from the Children of Israel.",
  "77127": "In his adulthood, Moses and Pharaoh’s people were not on good terms because he started to question their evil practices.",
  "77128": "The man assumed that Moses was going to hit him.",
  "77129": "Moses left Egypt with no food, money, or even shoes. He was completely worn out by the time he arrived in Midian. After he prayed for help, Allah gave him a wife, a job, and a home on the same day.",
  "77130": "lit., information. Moses and his family lost their way in the dark while they were travelling from Midian to Egypt.",
  "77131": "See footnote for 20:22.",
  "77132": "When Moses put his arm through the opening in his collar again, his hand returned to its original colour.",
  "77133": "The pagans are reminded repeatedly in the Quran that the Prophet (ﷺ) did not witness any of these events that happened centuries before he was born. For example, the conspiracies that were made against Joseph (12:102), the dispute on who should be the guardian of young Mary (3:44), and the drowning of Noah’s son in the Flood (11:49). These details were not known to Arabs before the revelation of the Quran. So the only logical way that the Prophet (ﷺ) knew about these stories is through divine revelation.",
  "77134": "So they neglected the Commandments over time.",
  "77135": "The pagans of Mecca demanded that the Quran should have been revealed all at once like the Torah, and the Prophet (ﷺ) should have had some tangible signs like the staff of Moses.",
  "77136": "Some Meccan pagans approached some Jewish authorities to inquire about the Prophet’s message and they were told that there are references of him in the Torah. So the pagans immediately rejected both the Torah and the Quran as two works of magic.",
  "77137": "lit., ‘We had already been Muslims.’",
  "77138": "By travellers such as the Meccan pagans.",
  "77139": "A prophet.",
  "77140": "Korah was the cousin of Moses. Because of Korah’s close association with Pharaoh, he became very rich and started to behave arrogantly towards his own people. When he was asked repeatedly by Moses (ﷺ) to pay his alms-tax to help poor Israelites, Korah refused and eventually conspired with a prostitute to damage the reputation of Moses, but Moses was cleared of any wrongdoing.",
  "77141": "Or: “I have been granted all this because I know that Allah knows I deserve it.”",
  "77142": "Since their sins are already known to Allah and written in perfect records, they will only be interrogated as a form of punishment.",
  "77143": "This verse was revealed while the Prophet (ﷺ) was on the way to Medina, emigrating from Mecca after years of persecution. Eventually the Prophet (ﷺ) returned to Mecca and the majority of its people accepted Islam.",
  "77144": "lit., except His Face."
}