{
  "76490": "The Decisive Authority (Al-Furqân) is one of the names of the Quran.",
  "76491": "The precise verses are easy to understand and deal mostly with matters of belief and practice, such as the belief in one God (Sûrah 112), forbidden foods (see 5:3), and the commandments in 6:151-152 and 17:23-39. As for the elusive verses, their full meaning is known only to Allah, such as the meaning of letter combinations at the beginning of some sûrahs, such as Alif-Lãm-Mĩm (see Stylistic Features), and how Allah settles Himself on the Throne.",
  "76492": "Wealth and children were considered the most important things in pre-Islamic Arabia, and so the frequent mention of these things in the Quran is meant to represent all worldly gains.",
  "76493": "It can also be understood that the disbelievers were made to think there were twice as many believers in the battlefield.",
  "76494": "Banîn means sons. In the ancient Arab culture, sons were a source of pride for their parents and tribes. This is because they provided for their families and took up arms in defence of their tribes.",
  "76495": "See footnote for 2:25.",
  "76496": "Optional prayers before dawn are recommended and are more likely to be accepted.",
  "76497": "i.e., full submission to the Will of Allah.",
  "76498": "No community split into believers and disbelievers until they received the knowledge given by their prophet.",
  "76499": "This refers to the pagans of Arabia before Islam.",
  "76500": "i.e., the Torah.",
  "76501": "i.e., dedicating the child to service in the temple.",
  "76502": "Service at the temple was hosted by males only.",
  "76503": "The prayers of Mary’s mother were answered. In a ḥadîth collected by Bukhâri and Muslim, the Prophet (ﷺ) says, “Every child is touched by Satan when they are born—and they cry because of this contact—except Jesus and his mother.”",
  "76504": "In the Quran, Jesus is called the “Word” of Allah since he was created with the word “Be!”",
  "76505": "Messiah (Masîḥ) means the “anointed one.” It is used in the Quran exclusively as a title for Jesus Christ.",
  "76506": "‘Mutawaffîka’ means literally: “I will make you reach the end of your worldly term.” The popular Muslim belief is that a conspiracy was made to kill Jesus. Allah made the main culprit who betrayed Jesus look exactly like Jesus, while the culprit was crucified. Similar to Christians, Muslims believe in the second coming of Jesus (ﷺ).",
  "76507": "As a testament to your prophethood.",
  "76508": "The perception of Jesus (ﷺ).",
  "76509": "Abraham (ﷺ) being Jewish or Christian.",
  "76510": "Linguistically, “Muslim” means “someone who has submitted themselves to Allah.”",
  "76511": "Muḥammad (ﷺ).",
  "76512": "“Gentiles” here refers to the pagans of Arabia.",
  "76513": "Muḥammad (ﷺ).",
  "76514": "i.e., full submission to the Will of Allah.",
  "76515": "Their repentance will not be accepted if they die as disbelievers.",
  "76516": "Jacob (ﷺ).",
  "76517": "When Jacob fell sick, he made camel meat unlawful for himself, but not for the rest of his people.",
  "76518": "Pilgrimage is obligatory on every Muslim at least once in their lifetime if the person is physically and financially able.",
  "76519": "Meaning, always be conscious of Him; obedient and grateful to Him.",
  "76520": "lit., except as Muslims.",
  "76521": "i.e., Allah’s covenant.",
  "76522": "i.e., they can only annoy you with their words.",
  "76523": "When the Prophet (ﷺ) was injured at the Battle of Uḥud, some of his companions suggested that he should pray against the pagans of Mecca. He responded, “I have not come to condemn people, but as a mercy to pray for their guidance.” The verse here says that it is not up to the Prophet whether they believe or disbelieve. A prophet’s only duty is to convey the message. Eventually, almost all Meccans accepted Islam before the death of the Prophet (ﷺ).",
  "76524": "“This” either refers to how the forces of evil are ultimately destroyed, or that the Quran is a reminder of the destruction of evildoers.",
  "76525": "The archers disputed whether to keep their positions after the initial victory. Eventually, most of them decided to go in pursuit of the spoils of war, disobeying the Prophet’s direct orders not to leave their position no matter what happened. Defeat became inevitable.",
  "76526": "i.e., the hypocrites.",
  "76527": "i.e., try not to die when your time comes.",
  "76528": "The Prophet (ﷺ) realized that the city of Medina became vulnerable after the Muslim loss at Uḥud. So on the next day of the battle he decided to lead a small force of his companions—many of whom had been wounded at Uḥud—to chase away the Meccan army which was camping at a place called Ḥamrâ' Al-Asad—not far from Medina. Abu Sufyân, commander of the Meccan army, sent a man to discourage the Muslims from following the Meccans. Although the man falsely claimed that the Meccans were mobilizing to launch a decisive attack on Medina, the Prophet became more determined to chase them away. Eventually, the Meccans decided to flee and not waste their victory after the Prophet sent a revert to Islam—who was friends with Abu Sufyân—to convince him to withdraw; otherwise Muslims were going to avenge their loss at Uḥud.",
  "76529": "This refers to the warning mentioned in 3:173.",
  "76530": "i.e., the distinction between the true believers and hypocrites.",
  "76531": "i.e., your forefathers.",
  "76532": "i.e., the original Torah of Moses and the Gospel of Jesus.",
  "76533": "Meaning, a believer is always tested through the loss of wealth as well as sickness, injuries, and the loss of life.",
  "76534": "The caller is Muḥammad (ﷺ).",
  "76535": "Râbiṭo refers to watching over the borders of one’s homeland. It can also mean keeping up one’s prayers."
}