{
  "77175": "This divorce (called ẓihâr) was commonly practiced in Arabia before the Prophet (ﷺ). If a man declared his wife as unlawful for him as the ẓahr (back) of his mother, his wife would be divorced. Islam abolished this type of divorce (see 58:3-4).",
  "77176": "The following distinction should be made:Sponsorship (which is permissible): a person can sponsor a child or host them in their home and care for them as they care for their own children, except for legal matters. For example, adopted children keep their last names, are allowed to marry the children of their adopted parent, adopted and biological children of the opposite sex should dress modestly in front of each other, and do not have a share in the estate of their adopted parents, but can get a share of inheritance (up to one-third of the estate) through bequest (waṣiyah). Adoption: a person is not allowed to take an orphan and give them his/her last name, give them a share of inheritance similar to their own children, etc.",
  "77177": "This verse confirms a ruling mentioned in 8:75 which ended a previous ruling that allowed inheritance between Muslims from Mecca (Al-Muhâjirûn, the Emigrants) and Muslims from Medina (Al-Anṣâr, the Helpers). Now, only relatives can inherit from one another, whereas non-heirs can receive a share through bequest, up to one third of the estate. See 4:7, 11-13, 32-33, and 176.",
  "77178": "See footnote for 27:75.",
  "77179": "In 5 A.H./627 C.E., the Meccan pagans along with some Arab and Jewish tribes (totalling around 10 000 soldiers) laid a siege around Medina, where the Prophet (ﷺ) was positioned with 3000 soldiers. The Prophet (ﷺ) had anticipated the offence and, upon an advice from one of his companions, dug a trench around the city to protect it from invaders. After several unsuccessful attempts to cross the trench, the allied enemies quickly lost morale, and were forced to end the siege due to severe weather conditions. This encounter is commonly known as the Battle of the Trench or the Enemy Alliance.",
  "77180": "The angels.",
  "77181": "lit., from above and below you.",
  "77182": "The believers were reassured while the doubts of the hypocrites grew more fierce.",
  "77183": "Yathrib was the name of Medina before the arrival of the Prophet (ﷺ) and Muslim emigrants.",
  "77184": "Until the end of your short life on earth.",
  "77185": "See footnote for 7:46.",
  "77186": "The Jews of Banu Quraiẓah who had violated their treaty with the Muslims and sided with the enemy alliance. The Prophet (ﷺ) asked how they wished to be judged, and they chose to be judged by their book, the Torah—in which the penalty for treason is death.",
  "77187": "Allah’s revelations refers to verses of the Quran whereas prophetic wisdom refers to the sayings and teachings of the Prophet (ﷺ), known collectively as ḥadîth.",
  "77188": "Though Islam and Îmân are sometimes used interchangeably in the Quran, Îmân is a higher state of Islam. A Muslim is someone who observes the five pillars of Islam, but a believer is someone with strong faith, who does everything purely for the sake of Allah, and is mindful of Allah in everything they say or do. Every Mu'min (believer/faithful) is a Muslim, but not every Muslim is a Mu'min. See 49:14.",
  "77189": "Meaning, if Allah makes a ruling in the Quran or the Prophet (ﷺ) makes a ruling, then a Muslim is not allowed to seek judgment from anyone else, nor follow their own desires.",
  "77190": "This refers to Zaid ibn Ḥârithah, the Prophet’s adopted son before adoption was made unlawful. His wife, Zainab bint Jaḥsh was from a prestigious family. Because Zaid and Zainab came from two different social classes, the marriage was not successful. Eventually, Zaid insisted on divorcing his wife, despite several appeals from the Prophet (ﷺ). Since one’s adopted son was no longer considered to be one’s own son, the Prophet (ﷺ) was later allowed to marry Zainab.",
  "77191": "Allah’s favour to Zaid was to guide him to Islam, and the Prophet’s favour was to free him from slavery.",
  "77192": "He (ﷺ) is not the father of Zaid (mentioned in 33:37) or any other man. The Prophet (ﷺ) had three biological sons, who all died in childhood.",
  "77193": "Before the marriage is consummated.",
  "77194": "If divorce is pronounced after the consummation of marriage, a waiting period of three months is observed to give the couple a chance to get back together and to see if the wife is pregnant (see 65:4). But if the divorce happens before the marriage is consummated, then there is no waiting period.",
  "77195": "See footnote for 4:3.",
  "77196": "This ruling was exclusively for the Prophet (which he never took advantage of), but Muslims have to pay a dowry to their wives. Some women did offer themselves to the Prophet (ﷺ) in marriage, but he declined.",
  "77197": "The Prophet’s married life can be classified as follows:Until the age of 25: he was single.Age 25 – 50: he was married only to Khadîjah.Age 50 – 52: he was single after Khadîjah’s death.Age 53 – his death at the age of 63: he had a total of ten wives. Many of these marriages were to widows (who had been left with their children without a provider) and in some cases to foster stronger ties with some of his companions and neighbouring tribes. Of all the women he married, ’Ȃishah was the only virgin.",
  "77198": "Paternal and maternal uncles are similar to the fathers.",
  "77199": "By attributing children to Him or associating gods with Him in worship.",
  "77200": "By calling him a liar or speaking ill of him and his family.",
  "77201": "By harming them physically or accusing them falsely.",
  "77202": "He has forgiven what Muslim women did in the past because they were not obligated to cover up.",
  "77203": "This verse is intended to deter the hypocrites. The Prophet (ﷺ) never killed any hypocrite as long as they did not join the enemy to attack and kill Muslims.",
  "77204": "The Quran does not specify how Moses was slandered by some of his people. Some narrations suggest that he was either falsely accused of adultery (see footnote for 28:76), killing his brother Aaron (who died a natural death), or having a skin disease since he, unlike others, used to bathe with his clothes on.",
  "77205": "This is a guarantee from Allah that if the hypocrites and polytheists ever turn to Him in repentance, He is always willing to forgive them."
}