{
  "77239": "i.e., the angels, the sun, the moon, the stars, and the mountains.",
  "77240": "Their father Adam (ﷺ).",
  "77241": "This is when the Trumpet will be blown the second time.",
  "77242": "Other possible translations: 1. “It was you who used to pressure us.” 2. “It was you who tricked us in the name of the truth.” 3. “It was you who dissuaded us from doing good.” 4. “It was you who deceived us with false oaths.”",
  "77243": "This implies all sorts of delicacies, not just fruits.",
  "77244": "Facing each other implies that no one will have anything in their hearts against others.",
  "77245": "‘Baiḍun maknûn’ can also mean spotless eggs.",
  "77246": "It is assumed that they will ask each other about their lives in the world and what led them to Paradise.",
  "77247": "The pagans of Mecca used to make fun of the Prophet (ﷺ) when he warned them of this tree. They asked, “How can a tree grow in Hell?” So Allah revealed this verse in response.",
  "77248": "i.e., the believers in his family.",
  "77249": "Noah’s sons: Shem, Ham, and Japheth.",
  "77250": "His people reportedly made decisions based on constellations, so Abraham (ﷺ) pretended to do the same to convince them he was not able to join them at their pagan feast.",
  "77251": "See footnote for 26:82.",
  "77252": "Allah sent a ram to be sacrificed in place of Ishmael.",
  "77253": "The birth of Isaac is announced after the story of sacrifice. So this is a proof that the son who was going to be sacrificed was Ishmael, not Isaac. This is also supported by 11:71, where Sarah is told that she would give birth to Isaac, who would (reach adulthood and) have a son by the name of Jacob.",
  "77254": "Abraham or Ishmael.",
  "77255": "Lot’s wife.",
  "77256": "For abandoning his city without Allah’s permission.",
  "77257": "Before being swallowed and while inside the whale (see 21:87). The lesson is: good deeds are of great help during difficult times.",
  "77258": "The belly of the whale would have become his grave.",
  "77259": "The squash plant provided Jonah with shade and repelled harmful insects.",
  "77260": "Some pagan Arabs believed that the angels were Allah’s daughters. Some of them were ashamed to have daughters and took pride in their own sons.",
  "77261": "Both sexes are equal before Allah, so the verse questions pagan chauvinism.",
  "77262": "Or “Yet the jinn know well that they themselves will be brought ˹for judgment˺.” This is based on the claim of some pagan Arabs that the angels are Allah’s daughters through female jinn.",
  "77263": "The “Reminder” mentioned here refers to Scriptures such as the Torah and the Gospel. It is commonly used in the Quran as another name for Islam’s holy book.",
  "77264": "lit., when it lands in their courtyards."
}