{
  "77265": "The pagans demanded an angel to deliver the message, not a human being like themselves.",
  "77266": "They meant that the Prophet (ﷺ) is not concerned with their guidance, and that he only wants to gain dominance over them.",
  "77267": "This refers either to the concept of the Trinity in Christianity or Arab polytheistic beliefs.",
  "77268": "In other words, they do not question the honesty of the Prophet (ﷺ), but question the Quran itself. This verse is similar to 6:33.",
  "77269": "This verse alludes to the defeat of the Meccan pagans later at Badr.",
  "77270": "i.e., pyramids and obelisks.",
  "77271": "i.e., the people of Shu’aib (ﷺ).",
  "77272": "Brother in faith or business partner.",
  "77273": "Some commentators have a different interpretation, which is not supported by reliable sources. They maintain that Solomon kept watching these fine horses until the sun set, then he realized that he had missed the noon prayer because of his love for horses, so he killed them, striking at their legs and necks.",
  "77274": "It is reported in a ḥadîth collected by Bukhâri that one night Solomon said that each of his wives would conceive a boy who would struggle in Allah’s cause. He forgot to say ‘Allah willing,” so only one of them gave birth to a deformed, dead baby. So Solomon prayed to Allah for forgiveness.",
  "77275": "The jinn dived to bring him pearls.",
  "77276": "Job was afflicted with losing his children, community, and with a long illness. Only his wife stayed with him. He once became angry with his wife and vowed to give her one hundred lashes if he recovered. When Job’s affliction was lifted, he became remorseful at what he had said. To help Job fulfil his vow without harming his wife, Allah ordered him to strike her with a bundle of one hundred blades of grass.",
  "77277": "Scholars are in disagreement as to whether Ⱬul-Kifl was a prophet or just a righteous man. Those who maintain that he was a prophet identify him with various Biblical prophets such as Ezekiel, Isaiah, and Obadiah.",
  "77278": "Meaning, they are not welcome since their presence in Hell with us will not benefit us in anyway.",
  "77279": "In other words, did we underestimate them?",
  "77280": "When the angels obeyed Allah’s orders to prostrate before Adam, whereas Satan refused to comply.",
  "77281": "See footnote for 2:34.",
  "77282": "The command to bow down was a test of obedience. Satan arrogantly refused to comply because he believed he was superior to Adam (ﷺ)."
}