{
  "77283": "Those who are devoted to Allah alone and those who associate other gods with Him.",
  "77284": "i.e., Adam (ﷺ).",
  "77285": "i.e., Eve.",
  "77286": "The four pairs (males and females), as listed in 6:143-144, are: a pair of sheep, a pair of goats, a pair of camels, and a pair of oxen.",
  "77287": "The three layers of darkness are: the belly, the womb, and the amniotic sac.",
  "77288": "This verse can apply to anything that a person listens to, and it can also apply specifically to the Quran—meaning, for example, those who read verses about retaliation and other verses about forgiveness, then they opt for forgiveness.",
  "77289": "The slave owned by several quarrelsome masters will always be confused because their masters will always give them conflicting orders—similarly, one who worships multiple gods will never find peace between them. This parable is a logical argument against the existence of multiple gods, since each god would try to covet what it created. See 23:91 for a similar argument.",
  "77290": "Like Korah (see 28:76-81).",
  "77291": "No matter how big someone’s sins are, they cannot be bigger than Allah’s mercy. Based on 4:48, the only unforgivable sin in Islam is if someone dies while disbelieving in Allah or associating others with Him in worship. In an authentic narration collected by At-Tirmiⱬi, the Prophet (ﷺ) reports that Almighty Allah says, \"O children of Adam! As long as you call upon Me, putting your hope in Me, I will forgive you for what you have done, and I will not mind. O  children of Adam! If your sins were to reach the clouds of the sky and then you sought My forgiveness, I would ˹still˺ forgive you. O  children of Adam! If you were to come to Me with sins filling the whole world and then you came to Me without associating other gods with Me, I would certainly match your sins with forgiveness.\"",
  "77292": "This refers to the place where the judgment will be held. The Prophet (ﷺ) is reported in a ḥadîth collected by Aṭ-Ṭabarâni to have said, “The Judgment will be passed on an earth where neither blood has been shed nor any sin committed.”",
  "77293": "This is emphasized in 21:105. The meaning is that Allah will award Paradise to the believers to be its residents forever. Some commentators say that the word “inherit” is used because of the understanding that when Allah created Paradise and Hell, He made places for all of humanity in both. Those who will go to Paradise will inherit the spots of the disbelievers who chose misguidance (which leads to Hell), and those who will go to Hell will inherit the spots of those who chose guidance (which leads to Paradise).",
  "77294": "The believers will praise Him for His grace, and the disbelievers will praise Him for His justice."
}