{
  "77295": "You created us from nothing, then gave us life in the wombs of our mothers, then caused us to die at the end of our worldly lives, and finally resurrected us after our death (see 2:28).",
  "77296": "It is reported in a ḥadîth collected by Imâm Muslim that everyone and everything that has ever existed will die on that Day, except for Allah—the Eternal. He will then ask, “Who does all authority belong to this Day? Where are the kings of the world? I am the King.” Since no one will be there to answer, Allah will answer Himself, “˹All authority belongs˺ to Allah—the One, the Supreme!”",
  "77297": "i.e., Moses (ﷺ).",
  "77298": "Meaning, your ancestors, because Joseph (ﷺ) died over 400 hundred years before Moses (ﷺ).",
  "77299": "See 28:38.",
  "77300": "Another possible translation: “Without a doubt, whatever ˹gods˺ you are calling me to ˹worship˺ have no claim ˹to divinity˺ in this world or the Hereafter.”",
  "77301": "The verse does not say “Those in the Fire will cry out to its keepers,” simply because there are levels in the Fire: those in higher levels will plead to the keepers of the depths of Hell to appeal to Allah to lighten the punishment even for one day, since they think they are better than those at the bottom.",
  "77302": "i.e., the Hellfire.",
  "77303": "Like other prophets, Muḥammad (ﷺ) was infallible of sin. The verse here refers to misjudgments, such as the Prophet’s response to the blind man (80:1-10), Jonah’s departure from his city without Allah’s permission (21:87-88), and David’s suspicions of the two men who scaled the wall of his sanctuary (38:21-25). If the Prophet (ﷺ) himself is urged to seek forgiveness, then the believers are even more in need of praying for Allah’s forgiveness.",
  "77304": "Your father, Adam.",
  "77305": "Nuṭfah refers to the union of male and female gametes (sperm and egg) which results in the zygote after fertilization.",
  "77306": "’Alaqah, meaning the embryo resembles a leech.",
  "77307": "i.e., milk, wool, and hide.",
  "77308": "And ridiculed the divine knowledge brought to them by their messengers."
}