{
  "77328": "This refers to the Preserved Tablet, Al-Lawḥ Al-Maḥfûẓ, in which Allah has written the destiny of His entire creation.",
  "77329": "For example, in the stories of the people of Noah, Lot, Shu’aib and other nations that were destroyed, found throughout the Quran.",
  "77330": "For example, male and female, sweet and bitter, day and night, plains and mountains, heat and cold, light and darkness.",
  "77331": "See footnote for 37:149.",
  "77332": "i.e., the birth of a baby girl.",
  "77333": "See 2:130-132.",
  "77334": "This refers to Mecca and Ṭâif, two cities in Arabia, around 100 km apart.",
  "77335": "From a worldly perspective, many people are comforted when they hear of others who went through similar trials as them. But this will not be the case on Judgment Day. Everyone will be desperate to save themselves from the punishment, regardless of others.",
  "77336": "i.e., the hand and the staff (see 20:17-22).",
  "77337": "The torments were: famine, shortage of crops, floods, locusts, lice, frogs, and blood (see 7:130-133).",
  "77338": "See 7:134.",
  "77339": "Branches of the Nile.",
  "77340": "Moses used to have a speech impediment. But when he became a prophet he prayed to Allah to help him speak clearly, and his prayer was answered (see 20:25-36).",
  "77341": "When 21:98 was revealed, warning the polytheists that all false gods will be in Hell, ’Abdullâh ibn Az-Ziba’ra, a poet who always attacked Islam, argued with the Prophet (ﷺ) that if what the verse says is true, then Jesus will be in Hell as well! The polytheists, who were present, laughed in agreement with this argument. The Prophet (ﷺ) replied that the verse was talking exclusively about idols, adding that Jesus himself did not ask anyone to worship him. Verse 21:101 was later revealed in support of the Prophet’s argument. Eventually, ’Abdullâh accepted Islam.",
  "77342": "Or “We could have easily produced angels from you …”",
  "77343": "Fruit also implies delicacies.",
  "77344": "Angel Mâlik is the chief keeper of Hell.",
  "77345": "i.e., Jesus, Ezra, and the angels."
}