{
  "77371": "This Medinian sûrah takes its name from the clear triumph (i.e., Treaty of Ḥudaibiyah) in verse 1. The Prophet (ﷺ) and 1400 of his companions travelled to Mecca to perform the minor pilgrimage (’umrah) in 6 A.H./628 C.E. He (ﷺ) sent ’Uthmân ibn ’Affân to let the Meccans know that the Muslims had come in peace, only to visit the Sacred House. When the Meccans delayed ’Uthmân, the Prophet (ﷺ) thought they might have killed his envoy. So he (ﷺ) called upon the faithful to pledge allegiance to him under a tree at Ḥudaibiyah in the outskirts of Mecca. Shortly after, ’Uthmân returned safely and a peace agreement was signed by the Muslims and Meccan pagans, stating in part that the Muslims would have to return to Medina and come back next year for ’umrah. The Treaty of Ḥudaibiyah is described as a clear triumph since it established peace, temporarily diffused the tension between the Muslims and the Meccan pagans, and gave the Muslims plenty of time to spread awareness and understanding of their faith. Thousands from different tribes accepted Islam during that truce.",
  "77372": "See footnote for 47:19.",
  "77373": "i.e., that Allah will not support His Prophet (ﷺ) and that misfortune will befall the believers.",
  "77374": "Another possible translation: “… so that you ˹all˺ may believe in Allah and His Messenger, support ˹His cause˺, revere, and glorify Him morning and evening.”",
  "77375": "Those who pledged allegiance at Ḥudaibiyah were promised by Allah that the spoils of war obtained from the Tribe of Khaibar would be exclusively theirs.",
  "77376": "Meaning, you only say so to deprive us of our share.",
  "77377": "This refers to Hawâzin and Thaqîf, two pagan Arab tribes.",
  "77378": "The conquest of Khaibar in 7 A.H./628 C.E.",
  "77379": "Or the spoils of Khaibar.",
  "77380": "lit., turn their backs.",
  "77381": "A group of Meccans wanted to attack the Muslims on their way to Mecca, but were taken captive by the Muslims, then were released.",
  "77382": "The animals that Muslims had brought along to be sacrificed after completing the rituals of the minor pilgrimage (’umrah).",
  "77383": "By doing so, the Meccan Muslims who were unknown to their fellow believers were safe, along with the pagans who later accepted Islam.",
  "77384": "This is when the pagans prevented the Prophet (ﷺ) and the believers from entering the Sacred House for ’umrah and the arrogance they showed when drafting the peace agreement.",
  "77385": "The declaration of faith that there is only one God to be worshipped and that Muḥammad (ﷺ) is His Messenger.",
  "77386": "Pilgrims are required to shave or trim their hair upon successfully completing the rituals of pilgrimage.",
  "77387": "This refers to the Treaty of Ḥudaibiyah and/or the gains of Khaibar before the fulfilment of the Prophet’s vision to enter Mecca for ’umrah.",
  "77388": "This passage and the next should be understood in their historical context. The Muslims were urged to be firm with the Arab pagans and their allies who were at war with Muslims at that time. Otherwise, Islam encourages Muslims to treat peaceful non-Muslims with kindness and fairness. See 60:8-9.",
  "77389": "Prostration means lying down on one’s face (i.e., touching the ground with the forehead and nose while resting on knees and flat palms of both hands) as an act of prayer and submission to Allah.",
  "77390": "In Deuteronomy 33:1-3, ˹Moses proclaimed:˺ “The Lord came from Sinai. Rising from Seir upon us, he shone forth from Mount Paran, accompanied by a myriad of his holy ones, with flaming fire from his right hand for them. Indeed, lover of people, all of his holy ones are in your control. They gather at your feet to do as you have instructed. [sic]” Paran is a mountain in Mecca.",
  "77391": "In Matthew 13:3-9, “˹Jesus˺ spoke many things to them in parables, saying, “Behold, the sower went out to sow. … ˹A seed˺ fell on the good soil and yielded a crop, some a hundredfold, some sixty, and some thirty. “He who has ears, let him hear.”’ Or the parable of the growing seed in Mark 4:26-28.",
  "77392": "See the first footnote for 48:29."
}