{
  "76627": "“Light” is always used in the Quran in the singular (nûr), whereas “darkness” is used in the plural (ẓulumât). Nûr is usually used in a metaphorical sense to refer to true guidance, whereas ẓulumât refers to different forms of misguidance.",
  "76628": "i.e., created your father, Adam, from clay. Some scholars suggest that if we examine all the minerals found in the earth (potassium, nitrogen, and carbon), we find that these are the same minerals that make up our body. Furthermore when we die, our bodies are absorbed back into the ground. And when we are resurrected, we will be resurrected from the ground (see 20:55).",
  "76629": "i.e., they would have been destroyed immediately upon denying the angel.",
  "76630": "Allah has created living beings (like animals, birds, and fish) just like He created human beings. He provides for all and is merciful to all. They all belong to communities and have their own systems of living.",
  "76631": "The Record refers to the Preserved Tablet (Al-Lawḥ Al-Maḥfûẓ) in which Allah has written the destiny of His entire creation.",
  "76632": "lit., seeking His Face.",
  "76633": "The five keys of the unseen are mentioned in 31:34.",
  "76634": "See footnote for 6:38.",
  "76635": "lit., their faith (which they are supposed to follow).",
  "76636": "Allah grants authority to some of His servants in this world, but none will have authority on Judgment Day except Him. See 3:26.",
  "76637": "On the Day of Judgment, the Trumpet will be blown by an angel—causing all to die. When it is blown a second time, everyone will be raised from the dead for judgment (see 39:68).",
  "76638": "i.e., associating false gods in worship with the Almighty.",
  "76639": "i.e., the companions of the Prophet (ﷺ).",
  "76640": "Some Jews.",
  "76641": "“The Mother of Cities” is an honorary title given to the city of Mecca because of its great religious significance as the home of Allah’s first house of worship ever built on earth, and perhaps because of its central location as well.",
  "76642": "i.e., Adam (ﷺ).",
  "76643": "Jinn are another creation of Allah, made of “smokeless fire,” and inhabit a realm parallel to our own. Like us, they have free will and can choose guidance or disobedience.",
  "76644": "i.e., “Jesus” in Christian belief.",
  "76645": "i.e., “the angels” in pre-Islamic Arab tradition.",
  "76646": "No one is able to see Allah in this world, but there is extensive evidence in the Quran and the teachings of the Prophet (ﷺ) that the believers will be able to see their Lord on the Day of Judgment.",
  "76647": "Allegations have always been made that the Prophet (ﷺ) copied the Quran from the Bible, mostly because of similar narratives in both Scriptures (such as the stories of Adam, Joseph, Moses, and others). Historically, the Bible was not translated into Arabic until centuries after the Prophet (ﷺ). Even if an Arabic translation of the Bible existed at his time, he (ﷺ) could not have copied it because he could not read or write. From an Islamic point of view, similarities stem from the fact that both scriptures came originally from the same source—divine revelation. For more details, see the Introduction.",
  "76648": "Because Muslims are allowed to eat the meat of animals slaughtered properly and not carrion, the pagans of Mecca used to argue, “Why are you only allowed to eat what you yourselves kill but not what Allah causes to die?”",
  "76649": "The Quran often compares disbelief to death and blindness whereas belief is compared to life and the ability to see.",
  "76650": "Islam literally means ‘submission to the Will of Allah.’",
  "76651": "For example, the jinn helped humans with magic, while the jinn had a feeling of importance when they had a human following.",
  "76652": "i.e., disobedient Muslims. They will be punished according to the severity of their sins, but eventually no Muslim will stay in Hell forever.",
  "76653": "Or trellised and untrellised.",
  "76654": "Strong cattle like camels and oxen can be used for labour, whereas smaller ones like goats and sheep are not suitable for labour but are good for their meat, milk, hide, etc.",
  "76655": "For example, in retaliation for intentional killing through legal channels.",
  "76656": "i.e., when you testify or judge.",
  "76657": "i.e., the Quran.",
  "76658": "This refers to disobedient believers who neither did any good nor repented before the time of their death or the arrival of the Day of Judgment. This is supported by authentic narrations from the Prophet (ﷺ)."
}