{
  "76659": "i.e., your father, Adam (ﷺ).",
  "76660": "See footnote for 2:34.",
  "76661": "Satan asked to be allowed to live until humans are resurrected in order to escape death at the end of time. He was told he was going to live only until the time appointed by Allah Almighty.",
  "76662": "There will be enmity between humans and Satan.",
  "76663": "It was customary for the pagans of Mecca to circle the Ka’bah while naked. So verses 26-31 of this sûrah were revealed commanding the believers to cover themselves properly when praying to their Lord.",
  "76664": "The pleasures of this worldly life are shared by believers and disbelievers, whereas the pleasures of the Hereafter will be enjoyed exclusively by the believers.",
  "76665": "i.e., they will receive all provisions and bounties destined for them by their Lord.",
  "76666": "i.e., the bitterness they had in their hearts towards other believers who wronged them in the worldly life.",
  "76667": "Although the word “rijâl” generally means “men,” some Quran commentators believe that the word “rijâl” here can also mean “people,” but they are called men since men make up the majority in the group. In some Arabic dialects, “rijâl” is the plural of “rajul” (man) and “rajulah” (woman).",
  "76668": "The faces of the residents of Paradise will be bright, whereas those of the residents of Hell will be gloomy.",
  "76669": "lit., their faith (which they are supposed to follow).",
  "76670": "The word day is not always used in the Quran to mean a 24-hour period. According to 22:47, a heavenly Day is 1000 years of our time. The Day of Judgment will be 50 000 years of our time (see 70:4). Hence, the six Days of creation refer to six eons of time, known only by Allah.",
  "76671": "They argued that life has its ups and downs and, therefore, they did not perceive adversity as a punishment or prosperity as a test—arguing that the same thing happened to their ancestors.",
  "76672": "lit., as Muslims.",
  "76673": "As we did before the birth of Moses.",
  "76674": "In psychology, this is called self-serving bias and scapegoating.",
  "76675": "i.e., their drowning in the sea.",
  "76676": "Allah reminds Moses that even though his request to see Allah was denied, he has already been favoured by Allah over the people of his time through prophethood and direct communication with the Almighty.",
  "76677": "To follow the commandments that generate more rewards than others, to put grace before justice, etc.",
  "76678": "This could either mean the ruins of destroyed nations or the Hellfire which is the home of the wicked.",
  "76679": "For asking Moses to make Allah visible to them.",
  "76680": "Some Muslim scholars cite Deuteronomy 18:15-18 and 33:2, Isaiah 42, and John 14:16 as examples of the description of Prophet Muḥammad in the Bible. However, Bible scholars interpret these verses differently. The name of Prophet Muḥammad (ﷺ) appears several times in the Gospel of Barnabas, which is deemed apocryphal by Christian authorities.",
  "76681": "Manna (heavenly bread) and quails (chicken-like birds) sustained the children of Israel in the wilderness after they left Egypt.",
  "76682": "The people of Aylah, an ancient town by the Red Sea, were forbidden to catch fish on the Sabbath. However, on Saturdays fish were everywhere, whereas on weekdays no fish were seen. To get around the prohibition, some decided to lay their nets on Fridays and collect the fish caught in their nets on Sundays. Those opposed to this practice were divided into two groups: one group tried to convince the offenders to honour the Sabbath, but soon gave up when their advice was not taken seriously. The second group was persistent in giving advice to the Sabbath-breakers. Eventually, the Sabbath-breakers were punished whereas the other two groups were saved.",
  "76683": "Literally or metaphorically. See footnote for 2:65.",
  "76684": "The mountain was raised over their heads when Moses came to them with the teachings of the Torah and was met with defiance. So the mountain was raised as a miracle and a display of Allah’s infinite power over them.",
  "76685": "Bal’am ibn Ba’ûrâ' was a scholar who lived at the time of Moses (ﷺ) but later deviated from the truth.",
  "76686": "Regardless of whether they are warned or not, still they will not believe.",
  "76687": "Those who twist Allah’s Names then use them to call false gods. For example, Allât, a name of one of the idols was derived from Allah (the One God), Al-’Uzza was derived from Al-’Azîz (the Almighty), and Manât was derived from Al-Mannân (the Bestower).",
  "76688": "i.e., Muḥammad (ﷺ).",
  "76689": "lit., their brothers."
}