{
  "76373": "i.e., Lord of everything in existence including angels, humans, and animals.",
  "76374": "It is customary to say “Âmîn” or “Amen” at the end of this sûrah.",
  "76736": "See footnote for 7:54.",
  "76737": "When they pray against themselves or their children, or when they demand to be destroyed.",
  "76738": "i.e., they split into believers and disbelievers.",
  "76739": "That He will delay their judgment until the Hereafter.",
  "76740": "Paradise.",
  "76741": "Seeing Almighty Allah in the Hereafter.",
  "76742": "The Prophet (ﷺ).",
  "76743": "This refers metaphorically to the pagans who fail to see and hear the truth.",
  "76744": "i.e., only for a short period of time.",
  "76745": "Either in this life to deliver the message or on the Day of Judgment to testify for or against them.",
  "76746": "This refers to 6:138-139.",
  "76747": "By delaying their punishment and allowing them time to repent.",
  "76748": "See footnote for 6:38.",
  "76749": "The Christians, pagans, etc.",
  "76750": "Jesus in Christianity, the angels in pagan Arab mythology, etc.",
  "76751": "Moses prayed while Aaron said, “Amen.” So it is as if both of them prayed.",
  "76752": "lit., sign.",
  "76753": "In Egypt, Jerusalem, and other places.",
  "76754": "They did not split into believers and disbelievers until they received the knowledge given to their prophets.",
  "76755": "When these verses were revealed, the Prophet (ﷺ) responded, “I am not in doubt and I will not ask ˹anyone˺.”",
  "76756": "Initially, the people of Jonah rejected his message. When he was told they would be punished after three days for their defiance, he left his city without Allah’s permission before its destruction. Jonah’s people became convinced that they were going to be destroyed when he left them and they saw signs of the imminent torment, so they felt remorseful and cried out for forgiveness before the coming of the punishment. Therefore, Allah accepted their repentance and the torment was retracted.",
  "76757": "i.e., until the end of their term.",
  "77637": "lit., visited the graves, since the stay in the grave is brief, followed by eternal life either in Paradise or Hell.",
  "77638": "Other possible translations: 1. “The Fire will be in towering columns.” 2. “They will be tied to long pillars.”",
  "77639": "Or worm-eaten leaves.",
  "77640": "Blessing the people of Quraysh with provision and security is probably the answer to Abraham’s prayer in 14:35-37.",
  "77641": "They refuse to help others with small things like salt or water, let alone alms-tax.",
  "77642": "This includes a heavenly river as well other favours in both worlds.",
  "76758": "The hypocrites or the disbelievers.",
  "76759": "See footnote for 10:61.",
  "76760": "See footnote for 7:54.",
  "76761": "The Prophet (ﷺ).",
  "76762": "i.e., the angels and the prophets.",
  "76763": "Typically, the poor and the helpless are the first to believe in prophets, taking them as saviours, whereas the rich and powerful are hesitant to believe, perceiving the new faith as a threat to their influence.",
  "76764": "Mercy here means prophethood.",
  "76765": "Muḥammad (ﷺ).",
  "76766": "Noah was given a signal that once the water gushes out of a particular oven then the Flood is about to begin. It can also be translated as: “The fountains of the earth gushed forth.”",
  "76767": "lit., there is no moving creature that He does not hold by its forelock.",
  "76768": "lit., my Lord is on the Straight Path.",
  "76769": "They believed that Ṣâliḥ had the potential to be their future leader.",
  "76770": "The she-camel came out of a mountain as a sign for them.",
  "76771": "In ancient Middle Eastern culture, if a guest refused to eat the food provided by their host, it was a sign of ill-will.",
  "76772": "She laughed after her husband was assured that the guests intended no harm or when she heard the news of the imminent destruction of the sinful people of Lot.",
  "76773": "Since the angels came in the form of handsome men, Lot was worried for the dignity and safety of his guests among his people—not knowing that they were angels.",
  "76774": "Single women of his community.",
  "76775": "Lot’s wife disbelieved in his message. It is believed that she is the one who informed the people of Lot’s handsome guests.",
  "76776": "Geographically and chronologically.",
  "76777": "Sinful believers will eventually be removed from Hell after receiving their punishment.",
  "76778": "Except the time they spend on earth and in the grave, or except the time the sinful believers spend in Hell before being transferred to Paradise.",
  "76779": "That He will delay their judgment until the Hereafter.",
  "76780": "This verse talks about the five daily prayers. The prayers at the two ends of the day are the dawn prayer (Fajr) at one end and the afternoon prayers (Ẓuhr and ’Aṣr) at the other. Prayers in the early part of the night include the sunset (Maghrib) and late evening (’Ishâ') prayers.",
  "77643": "Since she used to carry thorny branches and throw them in the way of the Prophet (ﷺ), she will be carrying firewood in Hell.",
  "77644": "This was one of the earliest sûrahs revealed of the Quran. Paradoxically, for Abu Lahab to disprove the Quran, all he had to do was accept Islam because this verse condemns him to Hell.",
  "77645": "As mentioned in the Introduction, the Quran has three main themes: 1. Stories. 2. Muslim teachings. 3. And belief in the unseen. Since Sûrah 112 covers the third theme, the Prophet (ﷺ) says in a ḥadîth collected by Bukhâri and Muslim that reading this sûrah equals reading one third of the Quran.",
  "76781": "Quran literally means recitation.",
  "76782": "The address here is to the Arabs and, by extension, all of humanity.",
  "76783": "This dream came true at the end of the story (see 12:100).",
  "76784": "Unlike Joseph’s other brothers, Benjamin was Joseph’s full brother. They lost their mother at a young age, so their half-brothers thought that their father loved them more.",
  "76785": "They stained Joseph’s shirt with blood from a sheep, but forgot to tear his shirt. So Jacob became suspicious when he saw the intact shirt.",
  "76786": "i.e., patience without complaining.",
  "76787": "Other possible translations: 1. “… so little did they value him.” 2. “… they had no interest in him.” In any case, they wanted to sell him immediately before someone claimed him. According to some Quran commentators, it was Joseph’s brothers who sold him to the travellers after he was picked up from the well. The verse states that Joseph was sold for a few worthless coins. Ironically, in 12:88 Joseph’s brothers came to him after he became Egypt’s Chief Minister, begging for supplies and saying that the only money they could afford was a few worthless coins. This is when Joseph revealed his true identity to them.",
  "76788": "Potiphar, the Chief Minister of Egypt (Al-’Azîz).",
  "76789": "Joseph (ﷺ) received warning against fornication either through divine inspiration or a vision of his father.",
  "76790": "She was urged to seek forgiveness from her husband.",
  "76791": "The women’s only objection was because the wife of the Chief Minister was in love with someone raised in her house like a son.",
  "76792": "lit., ‘their cunning’ because the women themselves were probably interested in Joseph.",
  "76793": "The women were cutting fruit, and when Joseph came out they were so impressed by his beauty that they sliced through the fruit and into their hands without knowing.",
  "76794": "The women tried to convince him to obey the Chief Minister’s wife, so Joseph prayed to Allah to keep him away from them.",
  "76795": "To stop women from being charmed by Joseph’s beauty, or to put an end to the rumours, or to keep him away from the Minister’s wife.",
  "76796": "Meaning, “You call them gods while in fact they are not gods.”",
  "76797": "The King of Egypt.",
  "76798": "In the Bible (the Book of Genesis), this ruler is referred to as a pharaoh, while in the Quran he is referred to as a king. Typically, Egypt was ruled by pharaohs, but there existed a brief period in Egyptian history in which Egypt was ruled by the Hyksos invaders (1700-1550 B.C.E.). Hyksos rulers were called kings, not pharaohs. Joseph entered Egypt during the reign of the Hyksos, who used to appoint some foreigners to prominent positions in Egypt. According to The Jewish Encyclopedia, “Those who regard the Joseph stories as historical generally hold that the Pharaoh by whom Joseph was made the practical ruler of Egypt was one of the Hyksos kings.” \"Joseph,\" The Jewish Encyclopedia, Volume VII (London: Funk and Wagnalls Company, 1916), p. 252.",
  "76799": "i.e., Benjamin. When Joseph hosted his half-brothers, they told him the number of people in their household for future supplies.",
  "76800": "He told them that every three or four of them should enter through a different gate. His desire was to protect them from envy and harm.",
  "76801": "Joseph was falsely accused of theft when he was young.",
  "76802": "He meant: I did not steal anything, nor did my brother ˹Benjamin˺. You are the real thieves; you stole me from my father and threw me into the well.",
  "76803": "We did not know when we gave you our solemn oath that our brother was going to steal.",
  "76804": "i.e., patience without complaining.",
  "76805": "Jacob (ﷺ) cried for so long that he became very weak-sighted. Some scholars suggest that he lost his sight completely. This does not contradict Jacob’s beautiful patience because he did not complain to anyone, but expressed his sorrow only to Allah.",
  "76806": "Jacob (ﷺ) delayed the prayer for his children to be forgiven until pre-dawn, which is a blessed time for supplication.",
  "76807": "Joseph’s parents and his eleven brothers prostrated before him out of respect, not as an act of worship. This was permissible in their tradition, but in Islam, Muslims prostrate only to Allah.",
  "76808": "Joseph (ﷺ) did not mention how Allah saved him from the well because he did not want to embarrass his brothers after forgiving them.",
  "76809": "lit., as a Muslim.",
  "76810": "This includes Joseph’s brothers, the travellers who picked him up from the well and sold him into slavery, and the Chief Minister’s wife and other women in the city.",
  "76811": "Males and females, sweet and bitter, etc.",
  "76812": "He knows whether the egg will be fertilized or not, whether the baby will be born before or after nine months, whether the pregnancy will end with delivery or miscarriage, and whether there will be one baby or more.",
  "76813": "Hope of rain and fear of torment.",
  "76814": "lit., prostrate. Meaning, all beings submit to His Will.",
  "76815": "Blindness and darkness are commonly used as an analogy for disbelief, whereas the ability to see and light refer to true faith in Allah.",
  "76816": "lit., seeking their Lord’s Face.",
  "76817": "i.e., the Hellfire.",
  "76818": "The disbelievers demanded a tangible miracle such as the staff of Moses.",
  "76819": "See 17:110 and 25:60.",
  "76820": "See footnote for 6:38.",
  "76821": "This can mean that the disbelievers bit their own hands in rage, or they covered their own mouths mockingly, or that they put their hands over their messengers’ mouths to silence them.",
  "76822": "It is out of Allah’s mercy that He does not hasten your punishment but delays your death until your destined time.",
  "76823": "That there is only one God worthy of worship.",
  "76824": "In this context, “humankind” refers only to those who deny Allah’s favours.",
  "76825": "Arab traders used to pass by the homes of some destroyed nations on their journeys to Syria and Yemen (such as ’Ȃd and Thamûd, respectively), stopping shortly for rest.",
  "76826": "lit., had been Muslims.",
  "76827": "i.e., the Quran.",
  "76828": "Some jinn used to eavesdrop on the angels in heaven so they could disclose this information to their human associates. But this practice came to an end when the Prophet (ﷺ) was sent with the message of Islam. See 72:8-10.",
  "76829": "Allah will remain eternally after all pass away.",
  "76830": "This does not contradict other verses that say Adam was created out of dust and those that say he was made out of mud. Adam was created in stages: first from dust, which was later turned into mud, then clay. This is similar to saying: I made a loaf of bread out of grain, or flour, or dough.",
  "76831": "See footnote for 2:34.",
  "76832": "i.e., the bitterness they had in their hearts towards other believers who wronged them in the worldly life.",
  "76833": "As mentioned in 11:69-70, the angels came to Abraham in the form of men and when he offered them food, they did not eat. In ancient Middle Eastern culture, if a guest refused to eat the food provided by their host, it was a sign of ill-will.",
  "76834": "Single women of his community.",
  "76835": "This is the only time in the Quran where Allah swears by the life of a human being. Elsewhere Allah swears by the sun, the moon, the stars, and other marvels of His creation.",
  "76836": "lit., messengers, because denying Ṣâliḥ (ﷺ) was equal to denying all of Allah’s messengers.",
  "76837": "Sûrah 1 of the Quran.",
  "76838": "i.e., lit., what is certain—death.",
  "76839": "The verse refers to the diverse creatures that have been created for the service of humanity.",
  "76840": "This verse refers to a tyrant king who ordered the building of a tower so he can reach the heavens and fight Allah and the angels. Eventually the tower collapsed, leaving the tyrant crushed.",
  "76841": "lit., prostrates.",
  "76842": "The angels.",
  "76843": "Some pagan Arabs used to bury their infant daughters alive for fear of shame or poverty. This practice was condemned and abolished by Islam. See 6:151 and 81:8-9.",
  "76844": "They say that Allah has daughters (i.e., the angels), although they themselves do not like to have daughters.",
  "76845": "lit., pleasant for those who drink.",
  "76846": "Intoxicants were later prohibited in the Quran in three stages: 2:19, 4:43, and finally 5:90-91.",
  "76847": "In other words, if the pagan slave-masters are not willing to be equal to their slaves, why would they make anyone equal to Allah—the Supreme Master and Creator of all things?",
  "76848": "Ḥafadah means grandchildren, but can also mean children-in-law.",
  "76849": "The two parables emphasize that Almighty Allah masterfully conducts the affairs of the heavens and the earth, whereas false gods are incapable of anything. If this is the case, these gods are not His equal and He is the only one worthy of worship.",
  "76850": "He guides those who are sincere in their quest for guidance.",
  "76851": "See footnote for 2:106.",
  "76852": "The angel Gabriel.",
  "76853": "Some Meccan pagans claimed that the Prophet (ﷺ) received the Quran from a non-Arab slave owned by an Arab pagan.",
  "76854": "This refers to ’Ammâr ibn Yâsser, an early revert to Islam, who was tortured to leave Islam. To save his life, ’Ammâr pretended to denounce Islam, but his heart was full of faith. When he told the Prophet (ﷺ) about what happened, this verse was revealed, reassuring him that his faith was intact.",
  "76855": "See footnote for 2:173.",
  "76856": "What is mentioned in 6:146.",
  "76857": "i.e., honourable mention and a righteous family.",
  "76858": "This verse refers to the Jews who claimed that Abraham was Jewish. See 3:65-68.",
  "76859": "Al-Isrâ' refers to the Prophet’s Night Journey from Mecca to Jerusalem about a year before his emigration (or Hijrah) from Mecca to Medina. This journey came as a comfort for the Prophet after several years of hardship and persecution, which included a 3-year siege by Meccan pagans, who drove the Muslims out of the city and forbade anyone from trading, marrying, or feeding them. This was followed by the “Year of Sadness,” which included the death of the Prophet’s uncle Abu Ṭâlib, the major defender of Muḥammad (ﷺ) despite his disbelief in his message, as well as the death of the Prophet’s beloved wife Khadîjah. The Prophet was carried overnight by a noble steed (called Burâq) from Mecca to Jerusalem where he met some earlier prophets and led them in prayer. He was later carried to the heavens (this journey is called Al-Mi’râj, or the Ascension) where he received direct orders from Allah to observe five daily prayers. The Ascension is referred to in 53:13–18.",
  "76860": "i.e., Allah.",
  "76861": "Some people are quick to pray against themselves or others in times of anger and frustration.",
  "76862": "This refers to the deeds that one is destined to do of their own free will. Out of His infinite knowledge, Allah knows people’s choices even before they make them. In the Hereafter, He will raise them from the dead for judgment.",
  "76863": "For example, in retaliation for intentional killing through legal channels.",
  "76864": "Here the word wali, “heir,” actually means awliyâ' or “heirs,” which includes the closest relatives, both men and women.",
  "76865": "By killing anyone other than the killer, or killing others with the killer.",
  "76866": "Some pagans had the belief that the angels are the daughters of Allah.",
  "76867": "They rejected you as a magician, a poet, a fabricator, and madman.",
  "76868": "When everyone is raised from the dead, they will all praise Allah, regardless of what they had believed in this life.",
  "76869": "The reason David is singled out here is because some Jewish authorities at the time of the Prophet (ﷺ) claimed that no scripture had been revealed after Moses. So this verse refutes this claim by referring to the Psalms of David.",
  "76870": "i.e., Jesus, Ezra, and the angels. Idol worship is refuted in other passages such as 7:191-198 and 34:22.",
  "76871": "Or they did wrong by it.",
  "76872": "During the Night Journey mentioned in 17:1.",
  "76873": "The tree of Zaqqûm which grows in the depths of Hell as mentioned in 37:62-65. The pagans of Mecca used to make fun of the Prophet (ﷺ) and say, “How can a tree grow in Hell?”",
  "76874": "See footnote for 2:34.",
  "76875": "Other meanings include: with their record of deeds, or their prophet, or their scripture.",
  "76876": "The pagans of Mecca tried in vain to dissuade the Prophet (ﷺ) from preaching the message of Islam. In some instances they offered to worship his Allah if he agreed to bow to their idols, and some even offered him riches and positions if he just stopped preaching in the city.",
  "76877": "This verse gives the times of the five daily prayers: the decline of the sun refers to the afternoon and late afternoon prayers, the darkness of night refers to sunset and late evening prayers, then the dawn prayer.",
  "76878": "This refers to the time when the Prophet (ﷺ) will make intercession (shafâ’ah) on the Day of Judgment.",
  "76879": "This verse was revealed when the Prophet (ﷺ) received the order to emigrate from Mecca to Medina. So here he (ﷺ) is praying to leave Mecca honourably and enter Medina honourably. It can also apply to any worldly activity that a person starts and finishes.",
  "76880": "The nine signs of Moses are: the staff, the hand (both mentioned in 20:17-22), famine, shortage of crops, floods, locusts, lice, frogs, and blood (all mentioned in 7:130-133). These signs came as proofs for Pharaoh and the Egyptians. Otherwise, Moses had some other signs such water gushing out of the rock after he hit it with his staff, and splitting the sea.",
  "76881": "This may also refer to the second warning in 17:7.",
  "76882": "i.e., the faithful among the scholars of the Torah and the Gospel.",
  "76883": "i.e., Jesus, Ezra, or the angels.",
  "76884": "i.e., another god equal to Him.",
  "76885": "i.e., the idols.",
  "76886": "Muḥammad (ﷺ).",
  "76887": "i.e., Jesus in Christianity and the angels in Arab pagan tradition.",
  "76888": "Ar-Raqîm is the plaque that was placed at the entrance of the cave with the names and story of the People of the Cave. This is the story of a group of Christian youths who hid inside a cave outside the city of Ephesus around 250 C.E., to escape persecution at the hands of pagans during the reign of the Roman emperor Decius. The Quran does not give an exact number of the youths, although many scholars believe there were seven in addition to a dog. The youths slept for 300 years, plus nine (300 solar years equal 309 lunar years).",
  "76889": "lit., We cast a cover of ˹deep˺ sleep over their ears.",
  "76890": "The People of the Cave themselves disagreed on how long they had slept in the cave. See 18:19.",
  "76891": "While they slept in the open space of the cave, fresh air blew through the cave, but they were protected from the heat of the sun.",
  "76892": "This is because, during their long sleep, their eyes were open, their hair grew long, and their bodies rolled over to the right and left to prevent bedsores.",
  "76893": "Their antique silver coins gave them away. People rushed to the cave to greet the youths, who finally passed away and were buried in the cave. The King decided to build a place of worship at the cave to commemorate their story.",
  "76894": "Some pagans suggested that a wall should be built to seal off the cave, whereas the believers decided to build a place of worship at the cave to honour those youths.",
  "76895": "Based on what has been revealed in the Quran.",
  "76896": "Three hundred years in the Gregorian calendar equal three hundred and nine years in the Islamic lunar calendar.",
  "76897": "lit., seeking His Face.",
  "76898": "The word “thamar” can mean fruits, gold and silver, etc.",
  "76899": "Created your father, Adam, from dust.",
  "76900": "This refers to good deeds that will benefit the believer in the Hereafter such as prayers or praises of Allah such as saying: ‘Subḥâna-Allâh’ (Glory be to Allah), ‘Alḥamdulillâh’ (Praise be to Allah), ‘Lâ ilâha illa-Allâh’ (There is no god ˹worthy of worship˺ except Allah), and ‘Allâhu akbar’ (Allah is the Greatest).",
  "76901": "See footnote for 2:34.",
  "76902": "i.e., the peoples of ’Ȃd and Thamûd.",
  "76903": "It is reported in an authentic narration collected by Bukhâri that a man approached Moses after he gave a talk and asked him, “Who is the most knowledgeable person on earth?” Moses responded, “That would be me!” So Allah revealed to Moses that he should not have said this and there was in fact someone who was more knowledgeable than him. Moses was commanded to travel to meet this man, named Al-Khaḍir, at the junction of the two seas (which could be the northern part of Sinai between the Red Sea and the Mediterranean Sea, or the Southern part of Sinai where the Rea Sea splits into the Gulf of Suez and the Gulf of Aqaba).",
  "76904": "Another possible translation: “The ˹salted˺ fish must have made its way into the sea. How strange!”",
  "76905": "Moses was given a sign: when he and his assistant Joshua (or Yûsha’ ibn Nûn) lost their food (a salted fish), this would be the place where they would find the man of knowledge.",
  "76906": "This is the royal ‘we’.",
  "76907": "The Prophet (ﷺ) commented on the story, “I wish Moses had been more patient so we can learn more from that wise man.”",
  "76908": "This is the story of a righteous king who travelled far and wide. He is titled Ⱬul-Qarnain (lit., the man of the two horns) because of his journeys to the far east and far west (or the two horns/points of sunrise and sunset). Some believe Ⱬul-Qarnain was Alexander the Great, but this is not sound since Alexander the Great was a polytheist. Many scholars believe it was Abu Kuraib Al-Ḥamiri, a righteous king from Yemen.",
  "76909": "They either had no clothes or homes to protect them from the sun.",
  "76910": "Gog and Magog are two wild peoples who were sealed off by a barrier built by Ⱬul-Qarnain to stop them from raiding their peaceful neighbours. There are many speculations as to their location, but none is supported by reliable sources. Their coming out is mentioned in 21:96-97 as one of the major signs of the final Hour.",
  "76911": "Gog and Magog.",
  "76912": "On the Day of Judgment, the Trumpet will be blown by an angel—causing all to die. When it is blown a second time, everyone will be raised from the dead to be assembled for the Judgment (see 39:68).",
  "76913": "i.e., the Quran.",
  "76914": "i.e., Jesus, Ezra, and the angels.",
  "76915": "Al-Firdaws, the highest place in Paradise.",
  "76916": "This was the voice of baby Jesus. Some say it was Gabriel.",
  "76917": "lit., fast ˹from speech˺. Linguistically, ṣawm means to abstain from something, such as food, speaking, and playing.",
  "76918": "i.e., his twin in virtue. They meant that they did not expect her to do something like that because they held her in high esteem like Aaron, Moses’ brother (perhaps because she was his descendant).",
  "76919": "On a daily basis, Muslims invoke Allah’s blessings upon Prophet Muḥammad (ﷺ) and his family and Prophet Abraham (ﷺ) and his family, in both obligatory and optional prayers.",
  "76920": "Prophet Enoch (Idrîs) (ﷺ) is said to be in the fourth heaven.",
  "76921": "Israel is another name for Jacob (ﷺ).",
  "76922": "The word ghai can either mean the evil consequences or a valley in Hell where they will be punished.",
  "76923": "There is no day or night in Paradise, only light. The verse says that the residents of Paradise will either be receiving provisions around these worldly times or without failure. Words such as morning and evening are used to make it easier for the people to understand.",
  "76924": "This refers to the bridge (known as Aṣ-Ṣirâṭ) which is extended over Hell. Both the believers and disbelievers will be made to cross that bridge. The believers will cross it safely, each at a different speed according to the strength of their faith, whereas the disbelievers and the hypocrites will plunge into the Fire.",
  "76925": "See footnote for 18:46.",
  "76926": "This statement was made by Al-’Ȃṣ ibn Wâ'il, a Meccan pagan who staunchly disbelieved in resurrection.",
  "76927": "No one will be allowed to intercede except those who firmly believe in Almighty Allah.",
  "76928": "The pagans who claimed that the angels are Allah’s daughters, the Christians who claim that Jesus is the son of Allah, etc.",
  "76375": "See Stylistic Features for information about these letters.",
  "76376": "i.e., there is no doubt regarding its authenticity or consistency.",
  "76377": "The word muttaqi (plural muttaqûn) can be translated as one who is mindful ˹of Allah˺, devout, pious, God-fearing, righteous, or God-conscious.",
  "76378": "i.e., the belief in Allah, the angels, and the Day of Judgment.",
  "76379": "See Notes on Translation for information about the use of ˹O Prophet˺.",
  "76380": "When they were criticized for their close association with the pagans who were hostile to Muslims, they would argue that they only wanted to make peace between Muslims and their enemies.",
  "76381": "Muḥammad (ﷺ).",
  "76382": "Residents of Paradise will be in a perfect condition. There will be neither physical impurities such as illness, urination, defecation, or menstruation; nor spiritual blemishes such as jealousy, envy, or hatred.",
  "76383": "Allah knew that there would be many righteous people who would do good, make peace, and stand up for justice. Since humans have free choice, whoever chooses to believe and do good is better in the sight of Allah than all other beings, and whoever chooses to disbelieve and do evil is worse than all other beings. See 98:6-8.",
  "76384": "If you are true that Allah will never create anyone who is more honourable and knowledgeable than you.",
  "76385": "Prostration in this verse does not mean worship, but an act of respect. A similar occurrence can be found in Sûrah 12, where Jacob (ﷺ), his wife, and his eleven children knelt down before Joseph (ﷺ).",
  "76386": "Iblîs was the name of Satan before his fall from grace. Iblîs was not an angel, but one of the jinn (see 18:50). Jinn are another creation of Allah, similar to humans in that they—unlike angels—have free will, but are made of smokeless fire and live in another plane of existence.",
  "76387": "The command to prostrate was a test of obedience. Satan arrogantly refused to comply because he believed he was superior to Adam—arguing that Adam was made of mud while Satan was made of fire (see 7:12).",
  "76388": "Both Adam and Eve were deceived, both sinned, and both were later forgiven. There is no concept of original sin in Islam.",
  "76389": "i.e., humans and Satan.",
  "76390": "The prayer that Adam and Eve were inspired to say is mentioned in 7:23, “Our Lord! We have wronged ourselves. If You do not forgive us and have mercy on us, we will certainly be losers.”",
  "76391": "Israel is another name for Prophet Jacob.",
  "76392": "This refers to the passages in the Torah and the Gospel that call for the worship of the One True God, doing what is good, and avoiding what is evil.",
  "76393": "Trading Allah’s revelations for a fleeting gain is a recurring theme in the first few sûrahs of the Quran. This refers to the practice of some Jewish authorities in Medina who contradicted certain rulings in the Torah by giving people lenient opinions only to please them in exchange for money.",
  "76394": "The alms-tax (zakâh) is the payment of 2.5% of someone’s savings only if the amount is equivalent to or greater than 85 g of gold, if that amount remains untouched for a whole Islamic year—around 355 days.",
  "76395": "Meaning, I chose you above all peoples of your time.",
  "76396": "“Intercession” is the act of pleading with Allah on behalf of another person on the Day of Judgment.",
  "76397": "Manna (heavenly bread) and quails (chicken-like birds) sustained the children of Israel in the wilderness after they left Egypt.",
  "76398": "The Sabians are an indigenous group that believes in a supreme being and lives mostly in Iraq.",
  "76399": "This verse should be understood in light of 3:19 and 3:85. For more details, see the Introduction.",
  "76400": "Although many scholars believe that these individuals were turned into real apes, others interpret this verse in a metaphorical sense. This style is not uncommon in the Quran. See 62:5 regarding the donkey that carries books and 2:18 regarding the deaf, dumb, and blind.",
  "76401": "This sûrah is named after the cow in this story, which happened at the time of Moses (ﷺ). A rich man was killed by his nephew, his only heir, and the body was thrown at the door of an innocent man. After a long investigation, no one was identified as the killer. Moses (ﷺ) prayed for guidance and was told that the only way to find the killer was to sacrifice a cow and strike the victim with a piece of it. When this was done, the victim spoke miraculously and said who the killer was.",
  "76402": "i.e., verses prophesizing the coming of the Prophet (ﷺ) in the Torah (including Deuteronomy 18:15-18 and 33:2).",
  "76403": "i.e., warning of a curse or punishment.",
  "76404": "The indigenous people of Medina were divided into two warring groups: Al-Aws and Al-Khazraj. Some Jewish tribes were allied with the former and others with the latter, which meant that in times of war each of these Jewish tribes had to fight along with their allies against their enemies, including other Jews. When the Prophet (ﷺ) migrated to Medina, he brought about a lasting peace in the city.",
  "76405": "The holy spirit is Gabriel, a mighty angel created from light, whose main duty is to communicate Allah’s messages to prophets.",
  "76406": "Their hearts are unreceptive because they claim they have enough knowledge already.",
  "76407": "lit., the disbelievers.",
  "76408": "i.e., the Quran.",
  "76409": "i.e., disobeying Allah, killing some of the prophets (including Zachariah and John the Baptist), claiming to have killed Jesus, accusing Mary of adultery, and dealing with usury. See 4:153-158.",
  "76410": "The two angels, Hârût and Mârût, were sent to enlighten the people in Babylon so they would not confuse magic tricks with miracles. Still some people abused this knowledge, causing mischief in the land. These practices persisted until the time of Solomon, who himself was falsely accused of utilizing magic to run his kingdom, subdue the jinn, and control the wind.",
  "76411": "Some of the disbelievers used to  play with words when they addressed the Prophet (ﷺ) in order to ridicule him. So instead of saying, râ’ina “listen to us,” they would say, râ’îna “our shepherd” or “the foolish among us.” They would say loudly, “We listen,” then whisper, “but we disobey!” and say, “Hear us,” then, “may you never hear!” They used to say to each other, “If he had truly been a prophet of Allah, he would have known that we are mocking him.” Therefore, this verse (along with 4:46) was revealed commanding the believers to avoid such words altogether. Better words are recommended.",
  "76412": "The Quran was revealed over a period of twenty-three years. New rules were introduced when the believers were ready to accept and apply them. Replacing a ruling with another is called abrogation (naskh). For example, alcohol consumption was forbidden over three stages (see 2:219, 4:43, and 5:90, respectively). Some of the Prophet’s companions said, “If drinking had been forbidden from day one, no one would have accepted Islam!”",
  "76413": "i.e., asking to make Allah visible to them and make the angels talk to them.",
  "76414": "Or “Such people should not have even entered these places except with reverence.”",
  "76415": "lit., wherever you turn, there is the Face of Allah.",
  "76416": "His mercy and knowledge covers all.",
  "76417": "The Christians, pagans, etc.",
  "76418": "Jesus in Christianity, the angels in pagan Arab mythology, etc.",
  "76419": "“The Sacred House” (Ka’bah) is a cube-shaped building in Mecca, Islam’s holiest sanctuary, which Muslims face when they pray five times a day.",
  "76420": "“The standing-place of Abraham” is the stone on which Abraham stood while he was building the Ka’bah.",
  "76421": "lit., make both of us Muslims. The word “Muslim” means “one who submits to Allah.” All of the prophets submitted to Allah and were, therefore, Muslims.",
  "76422": "For about sixteen months after daily prayers became obligatory, Muslims used to face towards Jerusalem before the order came to face a new qiblah (direction of prayer)—the Sacred Mosque in Mecca.",
  "76423": "i.e., moderate, balanced, and outstanding.",
  "76424": "Ṣafa and Marwah are two hills near the Ka’bah in Mecca.",
  "76425": "Known as ḥajj and ’umrah to the Sacred Mosque in Mecca.",
  "76426": "Eating pork is forbidden in the Old Testament in Leviticus 11:7-8 and Deuteronomy 14:8.",
  "76427": "No one else should be executed in place of the killer. This verse was revealed regarding a particular incident. Nevertheless, the killer is killed regardless of the difference in gender or status, unless the victim’s family opts for blood money.",
  "76428": "The guardian is the victim’s closest heir—male or female.",
  "76429": "Or according to common law.",
  "76430": "This ruling should be understood in light of the inheritance laws in 4:11-12, which give specific shares to parents and close relatives. Relatives who do not have a share may get a bequest up to one third of the estate.",
  "76431": "After the death of the one who made the will.",
  "76432": "i.e., the followers of previous prophets.",
  "76433": "i.e., the month of Ramaḍân, the 9th month in the Islamic calendar.",
  "76434": "In the case of old age or chronic disease.",
  "76435": "“Garment” (libâs) is a metaphor for comfort, chastity, and protection.",
  "76436": "Initially, intimate relations during the night of Ramaḍân were not permissible. Since some Muslims could not resist not having intercourse with their spouses, this verse was revealed allowing intimacy during the nights preceding the fast.",
  "76437": "This implies offspring.",
  "76438": "Before Islam, there was a superstitious practice for pilgrims to enter their homes through the back door upon returning from the pilgrimage. The verse suggests that being devoted to Allah wholeheartedly is more important than blindly following old traditions.",
  "76439": "“Do not exceed the limits” refers to Islamic warfare guidelines set by the Prophet. In an authentic saying collected by Abu Dawûd, he (ﷺ) is reported to have instructed the Muslim army, “Depart in the Name of Allah and with His help—following the way of the Messenger of Allah. Do not kill an old man, a child, or a woman. Do not mutilate dead bodies of the enemy. Be gracious and courteous, for Allah loves those who act with grace.” The Prophet (ﷺ) also says, “Do not wish to meet your enemy in battle but always pray for well-being. If fighting is a must, then be steadfast.”",
  "76440": "This is probably the most misquoted verse from the Quran. To properly understand the verse, we need to put it into context. Misquoting verses and taking them out of context can be applied to any scripture. For example, in the Bible, Jesus says, “Do not think that I came to bring peace on earth. I did not come to bring peace but a sword!” (Matthew 10:34). He also says, “But as for these enemies of mine who did not want me to be their king—bring them here and slaughter them in my presence!” (Luke 19:27). And Moses says, “The Lord is a man of war, the Lord is his name.” (Exodus 15:3). For more details, see the Introduction.",
  "76441": "Persecuting Muslims to abandon their faith.",
  "76442": "The sacred months are the 1st, 7th, 11th, and 12th months of the Islamic calendar.",
  "76443": "Ḥajj, the pilgrimage to Mecca, is required at least once in a Muslim’s lifetime if they are physically and financially able to. ’Umrah, which is a short version of ḥajj, is recommended, but not obligatory.",
  "76444": "Although pilgrimage is performed over the course of a few days in the 12th month of the Islamic calendar, the intention to perform pilgrimage can be made during the 10th, 11th, and the first half of the 12th months.",
  "76445": "By trading during ḥajj season.",
  "76446": "’Arafât is a hill in Saudi Arabia, near Mecca, which is visited during pilgrimage.",
  "76447": "A sacred place called Muzdalifah.",
  "76448": "Swift in reckoning (sarî’ul-ḥisâb) means “He is quick in recording the deeds and judging them.”",
  "76449": "The 11th-13th of Ⱬul-Ḥijjah, the 12th month of the Islamic calendar. These days are part of pilgrimage rituals.",
  "76450": "Another possible translation: “And when they assume authority, they strive …”",
  "76451": "The pagans of Mecca.",
  "76452": "See footnote for 2:194.",
  "76453": "Persecuting Muslims to abandon their faith.",
  "76454": "While many traditional scholars maintain that apostates are to be first invited to re-enter the fold of Islam then executed if the invitation is turned down, some traditional and modern scholars (like Sufyân Ath-Thawri, the late Grand Imâm of Al-Azhar Sheikh Maḥmûd Shaltût, and Dr. Jamal Badawi) are of the opinion that the Quran (2:256) guarantees freedom of religion and (2:217) promises no worldly punishment for leaving Islam. It is reported in a ḥadîth collected by Imâm Muslim that a man came to the Prophet (ﷺ) in Medina and retracted the allegiance he had pledged to him (ﷺ)—leaving Islam. The Prophet (ﷺ) did not punish the man. The narrations that command the killing of apostates refer only to those who fight against Muslims—so they are killed for treason, not for apostasy. Other aḥâdîth are meant to deter those who conspired to accept Islam then leave it soon after only to shake the faith of early Muslims, as mentioned in 3:72.",
  "76455": "See footnote for 4:43.",
  "76456": "Literal translation, “They are your brothers.”",
  "76457": "By not allowing partnership between you and orphans.",
  "76458": "lit., “by His permission.”",
  "76459": "Do not have intercourse with them until their menstruation is over and they have taken a full bath.",
  "76460": "Ḥarth means “farmland”—the husband being like a farmer, the wife like productive land, and children like seeds—a metaphor for fertility and growth.",
  "76461": "It is permissible to have intimate relations in any position. However vaginal penetration during monthly cycles or while bleeding persists after childbirth (up to forty days) is not permitted.",
  "76462": "This can either imply “sending forth good deeds that will be rewarded in the next life” or—according to some interpretations—“engaging in foreplay with one’s spouse before intercourse.”",
  "76463": "This ruling is called ilâ'. Ilâ' means that a husband vows not to be intimate with his wife because of a dispute or any other legitimate reason. The verse here says if it is four months or less and the husband keeps his vow, then he does not have to make up for breaking his vow (by feeding ten poor people, or fasting three days), otherwise he will need to make up for breaking his vow. If the vow is made for over four months, the wife has the right to seek divorce after four months. Ilâ' should be avoided altogether since it deprives the wife of her right to sexual satisfaction. Instead, counselling is a better alternative at the time of dispute.",
  "76464": "This could mean “pregnancy” or “accurate information about monthly cycles.”",
  "76465": "A husband may separate from his wife after each of the first two counts of divorce or at the end of her waiting period (see 65:1-5) with dignity. If he chooses to stay with her after the first two counts of divorce then divorces her a third time, the marriage is terminated at the end of her third waiting period. The wife will have to marry and divorce another man before she can be remarried to her ex-husband (see 2:230). However, a woman marrying someone with the intention of getting divorced, in order to return to her first husband, is forbidden.",
  "76466": "The “limits of Allah” implies fidelity to one’s spouse according to Allah’s commands.",
  "76467": "If the wife does not want to continue in the marriage for legitimate reasons, then she can return the dowry (mahr) to the husband in compensation for divorce. This ruling is called khul’.",
  "76468": "“Wisdom” means the “sunnah” or the tradition of the Prophet (ﷺ) when it is mentioned along with the Book (i.e., the Quran).",
  "76469": "i.e., the guardians.",
  "76470": "During their waiting periods.",
  "76471": "As mentioned in several authentic sayings of Prophet Muḥammad (ﷺ), the middle prayer is the afternoon prayer, ’Aṣr.",
  "76472": "This ruling was later replaced by the ruling in 2:234.",
  "76473": "They fled in the wake of a plague or an enemy attack.",
  "76474": "Ṭalûṭ.",
  "76475": "Reassurance refers to the Torah.",
  "76476": "i.e., the staff of Moses and fragments of the Tablets.",
  "76477": "Those messengers mentioned earlier in this sûrah (see verse 136).",
  "76478": "i.e., Gabriel.",
  "76479": "This implies ransoming one’s self.",
  "76480": "i.e., friendly connections.",
  "76481": "The Arabic word kursi can either mean seat or knowledge. There are some narrations attributed to Prophet Muḥammad (ﷺ) that describe Allah’s Throne (’Arsh) as being greater than His Kursi.",
  "76482": "According to Muslim belief, this is the greatest verse in the Quran.",
  "76483": "This verse was revealed when some new Muslims tried to force their Jewish and Christian children to convert to Islam after the Prophet’s emigration (Hijrah) to Medina. The verse prohibits forced conversion.",
  "76484": "Bringing the donkey back to life.",
  "76485": "It could also mean “… seeking Allah’s pleasure and proving their sincerity.”",
  "76486": "Donations for a public cause may be done openly to encourage others to donate, whereas it is recommended to give charity to the poor secretly.",
  "76487": "lit., seeking the Face of Allah.",
  "76488": "Verse 281 is believed by many scholars to be the last verse revealed of the Quran.",
  "76489": "Generally speaking, there is a difference between witnessing and giving testimony before a judge. Verse 2:282 talks about witnessing a debt contract, not giving testimony. To fully understand the context of this verse, we need to keep in mind that 1500 years ago women did not normally participate in business transactions or travel with trading caravans and, therefore, not every woman had the expertise to witness a debt contract. Even if two women were available at the time of signing the contract, perhaps the primary witness might not be able to recall the details of the contract or appear before a judge because of compelling circumstances such as pregnancy or delivery. In any of these cases, the second woman will be a back-up. Some scholars maintain that one woman can be sufficient as a witness so long as she is reliable. As for giving testimony, a ruling can be made based on available testimony, regardless of the number or gender of the witnesses. For example, the beginning of Ramaḍân is usually confirmed by the sighting of the new moon, regardless of the gender of the person who sights the moon. Also the highest form of witness in Islam is for someone to testify they heard a narration (or ḥadîth) from the Prophet (ﷺ). An authentic ḥadîth is accepted by all Muslims regardless of the gender of the narrator. Moreover, if a husband accuses his wife of adultery and he has no witnesses, each spouse must testify five times that they are telling the truth and the other side is lying. Both testimonies are equal (see 24:6-10). In some cases, only women’s testimony is accepted while men’s testimony is rejected, such as testifying regarding a woman’s pregnancy or virginity.",
  "76929": "Moses and his family lost their way in the dark while they were travelling from Midian to Egypt.",
  "76930": "Moses could have just said, “A staff.” But he volunteered to talk about the uses of the staff, adding that there are many other uses he has not mentioned, with the hope that Allah would ask him about it more. The reason is that Moses wanted to prolong the conversation with Allah as much as he could.",
  "76931": "Moses, who was dark-skinned, was asked to put his hand under his armpit. When he took it out it was shining white, but not out of a skin condition like vitiligo.",
  "76932": "Moses (ﷺ) put a brand of fire in his mouth, which hindered his speech as he grew up. In this verse, he prays to Allah to help him speak clearly, and his prayer is answered.",
  "76933": "In other words, Allah made Moses a likeable person so Pharaoh and his wife would agree to keep him.",
  "76934": "Moses had refused all wet-nurses that were brought for him.",
  "76935": "See footnote for 17:101.",
  "76936": "By saying that Moses’ miracle is pure magic.",
  "76937": "i.e., your prophet to receive the Tablets for your guidance.",
  "76938": "Manna (heavenly bread) and quails (chicken-like birds) sustained the children of Israel in the wilderness after they left Egypt.",
  "76939": "Moses selected a delegation of seventy people from his community to go to Mount Ṭûr where it was appointed for him to receive the Tablets. On the way, he rushed for the appointment with Allah, arriving before the delegation.",
  "76940": "The Sâmiri, or the man from Samaria, was a hypocrite who led the Children of Israel into idol-worship.",
  "76941": "To reveal the Torah for their guidance.",
  "76942": "To worship Allah alone until Moses returned with the Tablets.",
  "76943": "The jewellery they borrowed from their Egyptian neighbours before they fled Egypt.",
  "76944": "Moses’ orders are mentioned in 7:142.",
  "76945": "This verse could also be translated as follows: “I had an insight which they did not have, then grasped some knowledge from the messenger ˹Moses˺, but ˹later˺ threw it away. This is what my lower-self tempted me to do.” According to many Quran commentators, while Moses and the Children of Israel were crossing the sea to escape abuse by Pharaoh and his people, the Sâmiri saw Gabriel on a horse leading the way, and every time the horse touched the ground, it turned green. So the Sâmiri took a handful of dust from the hoof-prints of the horse, and later tossed it at the calf so it started to make a lowing sound.",
  "76946": "Meaning, alienated in the dessert, away from the people.",
  "76947": "lit., destined time.",
  "76948": "The Quran.",
  "76949": "See footnote for 18:99.",
  "76950": "This can also mean “blind.”",
  "76951": "This can also mean “footsteps.”",
  "76952": "Allah fully knows what fate awaits them and what they did in the world.",
  "76953": "Or “… they cannot encompass His knowledge.”",
  "76954": "The Prophet (ﷺ) was eager to recite the Quran while it was being revealed to him through the angel Gabriel. So he (ﷺ) was told to take his time to learn it by heart once the verses are properly delivered to him.",
  "76955": "See footnote for 2:34.",
  "76956": "There is no sun or cold weather in Paradise, only light. See 76:13.",
  "76957": "Unlike the Bible (Genesis 3), the Quran does not blame Eve for Adam’s fall from the Garden.",
  "76958": "The Reminder is another name for the Quran.",
  "76959": "That He will delay their judgment until the Hereafter.",
  "76960": "This verse refers to the times of the five daily prayers.",
  "76961": "The pagans of Mecca were not satisfied with a literary miracle in the form of the Quran, so they asked for a tangible miracle (see 17:90-91) similar to the staff of Moses.",
  "76962": "This either refers to the Biblical stories confirmed by the Quran or the prophecies of Muḥammad (ﷺ) in the Bible. Some Muslim scholars cite Deuteronomy 18:15-18 and 33:2, Isaiah 42, and John 14:16 as examples of the description of Prophet Muḥammad (ﷺ) in the Bible. However, Bible scholars interpret these verses differently.",
  "76963": "lit., extinguished like ashes.",
  "76964": "That Allah has a partner and children.",
  "76965": "The Prophet (ﷺ) is ordered to challenge the pagans to produce logical and scriptural proofs for the existence of other gods beside Allah. The verses then argue that if there is more than one god, the different gods would have fought among themselves for domination, and the whole universe would have been ruined. The Quran, the Torah, and the Gospel are all in agreement that there is only One God.",
  "76966": "Some pagans claimed that the angels are Allah’s daughters.",
  "76968": "The signs of the heaven include the galaxies, planets, stars, etc., all of which have an orbit. Our planet orbits the sun, the sun orbits the Milky Way Galaxy, and the Milky Way Galaxy orbits the Virgo Supercluster, etc.",
  "76969": "This can also mean that they are in awe of their Lord as much in private as they are in public.",
  "76970": "It is reported in a ḥadîth collected by Bukhâri that Abraham (ﷺ) said, while being thrown into the fire, “Allah ˹alone˺ is sufficient ˹as an aid˺ for us and ˹He˺ is the best Protector.”",
  "76971": "Abraham and his nephew, Lot, migrated from Babel, Iraq to Jerusalem.",
  "76972": "i.e., the believers in his family.",
  "76973": "A man’s flock of sheep strayed into another man’s vineyard, eating and destroying all his produce. When the two men came to David for judgment, he ruled that the shepherd must give his animals to the vineyard owner in compensation for the damage. On their way out, the two men met young Solomon and the shepherd complained to him. Solomon discussed the case with his father, and suggested that the sheep should be kept with the man who lost his produce so he may benefit from their milk and wool, while the shepherd worked on the farm to restore it to its original state. Eventually the famer would take back his farm in perfect condition, and the sheep would be returned to the shepherd. David was impressed by his son’s insight and approved his fair judgment immediately.",
  "76974": "lit., devils.",
  "76975": "The jinn dived to bring him pearls.",
  "76976": "This refers to his loss of health, wealth, and children.",
  "76977": "Scholars are in disagreement as to whether Ⱬul-Kifl was a prophet or just a righteous man. Those who maintain that he was a prophet identify him with various Biblical prophets such as Ezekiel, Isaiah, and Obadiah.",
  "76978": "Or “thinking We will let him get away with it.” Jonah (ﷺ) had been met with denial for many years. When he sensed the coming of Allah’s torment, he abandoned his city without Allah’s permission. Eventually, his people repented before the coming of the torment, and Allah accepted their repentance (see 10:98), whereas Jonah ended up in the belly of the whale (see 37:140-148).",
  "76979": "The darkness of the night, the sea, and the belly of the whale.",
  "76980": "Meaning, “You will be there for eternity after all pass away.”",
  "76981": "Gabriel breathed into the sleeves of Mary’s garment so she conceived Jesus.",
  "76982": "See 18:93-99.",
  "76983": "i.e., the Final Hour.",
  "76984": "See footnote for 43:57-58.",
  "76985": "This refers to Psalm 37:29: “The righteous shall inherit the land.” See footnote for 39:47.",
  "76986": "Meaning, “We seek Allah’s help against your claims that He has partners ˹in worship˺.”",
  "76987": "Your father, Adam.",
  "76988": "Nuṭfah refers to the union of male and female gametes (sperm and egg) which results in the zygote after fertilization.",
  "76989": "’Alaqah, meaning the embryo resembles a leech.",
  "76990": "Muḍghah, meaning it resembles a chewed morsel.",
  "76991": "Fully formed or defected, evolving into a healthy embryo or ending in miscarriage.",
  "76992": "lit., they tumble on their faces.",
  "76993": "Meaning, no matter what the deniers do, Allah will never stop supporting His Prophet (ﷺ).",
  "76994": "See footnote for 2:62.",
  "76995": "Magi (singular: magus): Zoroastrians; fire-worshippers.",
  "76996": "lit., prostrate. Meaning, all beings submit to His Will.",
  "76997": "Another possible translation: “… and they have been guided to the Path of the Praiseworthy ˹God˺.”",
  "76998": "The Sacred Mosque is in Mecca.",
  "76999": "Generally, intending to do wrong does not necessitate a punishment, unless the person acts upon it. But the Sacred Mosque is unique in that intending to sin in it is sufficient to bring punishment from Allah, unless the person repents.",
  "77000": "According to Ibn Kathîr, Abraham (ﷺ) said to Allah, “But my voice cannot reach all peoples.” Allah responded, “You make the call, and We will deliver the invitation to all.”",
  "77001": "Spiritual benefits such as prayers, pilgrimage, and forgiveness of sins, as well as worldly benefits such as meeting Muslims from everywhere and trading.",
  "77002": "Shaving their hair, clipping nails, and taking a shower.",
  "77003": "See 5:3.",
  "77004": "Milking or riding them until the time for sacrifice.",
  "77005": "For over thirteen years, Muslims had not been allowed to fight back against the brutality of the Meccan pagans, leading to the emigration of the Prophet and many of his companions to Medina. As the hostilities continued, this verse was later revealed allowing Muslims to fight back in self-defence.",
  "77006": "The Day ˹of Judgment˺ is described as ’aqîm (lit., barren) because it will terminate all forms of life on earth and no new day will be born.",
  "77007": "Allah grants authority to some of His servants in this world, but none will have authority on Judgment Day except Him. See 3:26.",
  "77008": "For your service.",
  "77009": "All prophets came with the same message: have faith in one God and do good. But each faith-community had their own law.",
  "77010": "The Muslim code of life is called Sharî’ah, which means a “path.” For more information, see the Introduction.",
  "77011": "Another possible translation: “How weak are the seekers (i.e., the idols) and the sought (i.e., the fly)!”",
  "77012": "i.e., Muslims.",
  "77013": "Zakâh means purification and growth. Paying alms-tax and charity are forms of purifying one’s wealth.",
  "77014": "lit., private parts.",
  "77015": "See footnote for 4:3.",
  "77016": "Al-Firdaws, the highest place in Paradise.",
  "77017": "Adam (ﷺ).",
  "77018": "See footnote for 22:5.",
  "77019": "This happens when the spirit is breathed into the embryo.",
  "77020": "So he may recover from his “madness” or die.",
  "77021": "Noah was given a signal that once the water gushes out of a particular oven then the Flood is about to begin. It can also be translated as: “The fountains of the earth gushed forth.”",
  "77022": "lit., signs.",
  "77023": "The nine signs are: the staff, the hand (both mentioned in 20:17-22), famine, shortage of crops, floods, locusts, lice, frogs, and blood (all mentioned in 7:130-133).",
  "77024": "It is reported in an authentic narration collected by At-Tirmiⱬi that ’Ȃishah, the Prophet’s wife, asked him (ﷺ) if this verse refers to those who steal or drink ˹alcohol˺. The Prophet (ﷺ) answered, “No, it refers to those who pray, fast, and donate, but are afraid that their deeds are rejected because they are not good enough.” Then he (ﷺ) recited the last part of the verse: “It is they who race to do good deeds, always taking the lead.”",
  "77025": "This refers to the believers’ good deeds mentioned in 23:57-62.",
  "77026": "Their desire that the universe has more than one God. See 21:22.",
  "77027": "This refers to famine which affected the pagans of Mecca.",
  "77028": "The Meccan pagans.",
  "77029": "Their claims that there are many gods, and that the Prophet is a liar, a poet, etc.",
  "77030": "Meaning, once they are dead, they will never return to the world.",
  "77031": "On the Day of Judgment, the Trumpet will be blown by an angel—causing all to die. When it is blown a second time, everyone will be raised from the dead for judgment (see 39:68).",
  "77032": "Everyone will be busy with their own situation.",
  "77033": "Compared to the length and misery of their stay in the grave and Hell, their worldly life will seem very short to them.",
  "77034": "The address here is to legal authorities. Adultery has to be proven either by confession or the testimony of four reliable witnesses.",
  "77035": "It is reported in a ḥadîth collected by At-Tirmiⱬi that Marthad ibn Abi Marthad, a companion of the Prophet (ﷺ), asked if he could marry ’Anâq, a pagan prostitute he befriended in Mecca before he accepted Islam. So this verse was revealed. However, if someone committed a sin then later repented genuinely, they will be accepted by Allah and the rest of the believers.",
  "77036": "In order to be spared the punishment for false accusation.",
  "77037": "This ruling is called li’ân in Islamic legal system. Once the husband and the wife swear each five times, as specified in 24:6-9, the marriage is terminated forever—which means that they can never be remarried.",
  "77038": "Because now you can tell who is a true believer and who is a hypocrite.",
  "77039": "This refers to ’Abdullâh ibn Ubai, the leader of the hypocrites in Medina.",
  "77040": "This verse was revealed when Abu Bakr Aṣ-Ṣiddîq, ’Ȃishah’s father, swore to end his financial assistance to his poor cousin, Misṭaḥ ibn Athathah, for taking part in the rumours against ’Ȃishah. Once the verse was revealed, Abu Bakr resumed his assistance to Misṭaḥ.",
  "77041": "Immoral thoughts never cross the minds of these chaste women and, therefore, they never expect slander.",
  "77042": "This passage declares the innocence of ’Ȃishah, the Prophet’s wife.",
  "77043": "lit., non-residential buildings.",
  "77044": "i.e., hair, body shape, and underclothes.",
  "77045": "i.e., the face, hands, outer clothes, rings, kohl, and henna.",
  "77046": "i.e., hair, arms, and legs.",
  "77047": "This is a metaphor for the light of guidance in the heart of the believer.",
  "77048": "Meaning, the olive tree is wholesome because it is located in a central place, so it is hit by sunrays all day-long, and, therefore, the oil is of a premium quality.",
  "77049": "See footnote for 7:46.",
  "77050": "This is another scientific fact mentioned in the Quran: the existence of underwater waves, like layers.",
  "77051": "Those at fault.",
  "77052": "This is used in a sarcastic way. It means, “Save your oaths! Everyone knows you are only bluffing. It is actions that matter, not words.”",
  "77053": "The Prophet’s only duty is to deliver the message.",
  "77054": "Their only duty is to obey the Prophet (ﷺ) by submitting to Allah.",
  "77055": "There is no blame on any of the three if they do not march forth in Allah’s cause. Moreover, some Muslims would give the keys of their homes to one of those who could not march forth (namely the blind, the disabled, or the sick) or their own relatives and ask them to enter their houses and eat at will but these people were shy to do that.",
  "77056": "i.e., the home of your spouse or children.",
  "77057": "If someone is in the house, greet them by saying, ‘As-salâmu ’alaikum’ (peace be upon you).” But if there is no one there, you greet yourselves by saying, ‘Asalâmu ’alaina wa ’ala ’ibâd-illâhi aṣ-ṣâliḥîn’ (peace be upon us and all righteous servants of Allah).”",
  "77058": "There is also a different interpretation: “Do not call the Messenger ˹by his name˺ as you call one another.” In other words, Do not say, ‘O Muḥammad.’ Rather, say, ‘O Prophet.’",
  "77059": "Some hypocrites used to sneak out while the Prophet (ﷺ) was talking.",
  "77060": "Al-Furqân, which is one of names of the Quran, means \"the Decisive Authority.”",
  "77061": "Prophet Muḥammad (ﷺ).",
  "77062": "For both humans and jinn.",
  "77063": "The Prophet (ﷺ).",
  "77064": "Some Arab pagans claimed that the Prophet (ﷺ) had been taught the Bible by some non-Arab Christians. The Quran itself (16:103) refutes this claim by arguing that a non-Arab could not come up with an eloquent Arabic scripture like the Quran when eloquent Arabs failed to produce something like it. For more details, see the Introduction.",
  "77065": "He forgives those who repent, and gives a grace period to those who do not.",
  "77066": "i.e., a magician, a poet, a fabricator, and a madman.",
  "77067": "What they have said about you are only excuses to justify their denial of the Hereafter.",
  "77068": "e.g., Jesus and the angels.",
  "77069": "Another possible translation: “They will say, ‘Glory be to You! We would not dare to take other lords besides You ˹so how can we claim to be lords?˺’”",
  "77070": "Another possible translation: “And the angels will say, ‘All good is forbidden to you!’”",
  "77071": "The good deeds of the disbelievers (like charity) will have no weight on Judgment Day.",
  "77072": "Some people (like kings and rulers) have some sort of authority in this world. But on Judgment Day Allah will be the sole authority.",
  "77073": "lit., messengers, because denying Noah was equal to denying all of Allah’s messengers.",
  "77074": "Ar-Rass means “well” or “water-pit”. This refers to a pagan people, along with Midian, to whom Allah sent Prophet Shu’aib.",
  "77075": "They neither pay attention, nor think for themselves. They only follow others blindly.",
  "77076": "Generally, animals are obedient and loyal to their masters who care for them and they seem to know their way, whereas Meccan pagans are disobedient and ungrateful to their Lord and Sustainer, choosing to stray from the right path.",
  "77077": "This means that one of the great miracles of Allah is that He allows the sun to rise in the morning, causing darkness to retreat. He could have stopped the sun and the earth from rotating, so half of the world would be engulfed in complete darkness, leading to an imbalance in the earth’s eco-systems and endangering life on the planet.",
  "77078": "This refers to estuaries where salt and fresh waters meet forming brackish water. Although both waters mix together, each still keeps its distinctive qualities.",
  "77079": "The mixture of sperm and egg.",
  "77080": "See footnote for 7:54.",
  "77081": "The sun.",
  "77082": "For example, in retaliation for intentional killing through legal channels.",
  "77083": "For killing an Egyptian by mistake before prophethood. See 28:15-17.",
  "77084": "See previous footnote.",
  "77085": "Pharaoh and his soldiers.",
  "77086": "It is reported in an authentic narration collected by At-Tirmiⱬi that Prophet Muḥammad (ﷺ) said that Abraham (ﷺ) did not tell the full truth only on three different occasions: when he justified his absence from the pagan festival by saying ‘I am really sick’ (see 37:89), and when he destroyed the idols and blamed it on the biggest one (see 21:63), and when he said that Sarah was his sister to save her from a tyrant ruler.",
  "77087": "On a daily basis, Muslims invoke Allah’s blessings upon Prophet Muḥammad (ﷺ) and his family and Prophet Abraham (ﷺ) and his family, in both obligatory and optional prayers.",
  "77088": "A pure and sound heart is that of the believer, compared to that of the disbeliever and the hypocrite.",
  "77089": "Iblîs was the name of Satan before his fall from grace. See footnote for 2:34.",
  "77090": "lit., messengers, because denying Noah (ﷺ) was equal to denying all of Allah’s messengers.",
  "77091": "The pagans were accusing the impoverished believers of following Noah (ﷺ) only for personal gain, not out of sincere faith.",
  "77092": "lit., men of the world.",
  "77093": "Lot’s wife, who betrayed her husband.",
  "77094": "Unlike other prophets in this sûrah who are identified as the brothers of fellow tribesmen, Shu’aib is not identified as the brother of the people of the Aykah (which is the name of the forest where they used to worship a particular tree) because they are identified by faith, rather than a tribal connection.",
  "77095": "They were targeted by scorching heat, so they did not know where to go. Finally, a soothing cloud appeared in the sky, so they rushed to it for shade, then the cloud rained torment upon them, as they had requested.",
  "77096": "i.e., ’Abdullâh ibn Salâm, a Jewish authority, who accepted Islam during the time of the Prophet (ﷺ).",
  "77097": "The devils can no longer eavesdrop on heaven. See 72:8-10.",
  "77098": "This refers to fortune-tellers who listen to Satanic whispers, adding more lies as they pass on the information to people.",
  "77099": "lit., roam aimlessly in every valley.",
  "77100": "lit., information. Moses and his family lost their way in the dark while they were travelling from Midian to Egypt.",
  "77101": "This refers to the angels who were present around the light.",
  "77102": "See footnote for 20:22.",
  "77103": "See footnote for 23:45.",
  "77104": "The privilege was their ability to communicate with members of the animal kingdom, control the wind, utilize the jinn for their service, etc.",
  "77105": "The Queen of Sheba is known in Islamic tradition as Bilkis.",
  "77106": "She wanted to test Solomon (ﷺ) to see if he was only a king (so he would be satisfied with a tribute) or a prophet (who would only settle with submission to the True God).",
  "77107": "If they refuse to submit.",
  "77108": "To explain why Prophet Solomon brought the Queen’s magnificent throne and built the marvellous palace, many traditional commentators cite some folkloric or legendary stories. However, none of these stories is supported by reliable Islamic sources.",
  "77109": "This refers to ’Aṣif ibn Barkhiya, a knowledgeable and righteous assistant of Solomon.",
  "77110": "Because he had refused her tribute.",
  "77111": "Bringing her well-guarded, mighty throne all the way from Sheba, Yemen.",
  "77112": "i.e., believers and disbelievers.",
  "77113": "lit., the evil.",
  "77114": "lit., the good.",
  "77115": "They were struck with famine, which they blamed on Ṣâliḥ and his followers.",
  "77116": "See footnote for 25:53.",
  "77117": "Via the stars and constellations.",
  "77118": "In the form of rain.",
  "77119": "By delaying their punishment and allowing them time to repent.",
  "77120": "Through their tongues or actions.",
  "77121": "The Record refers to the Preserved Tablet (Al-Lawḥ Al-Maḥfûẓ) in which Allah has written the destiny of His entire creation.",
  "77122": "The beast is believed to be one of the major signs of the Day of Judgment. No further details are given in reliable resources about this beast.",
  "77123": "To demonstrate His ability to bring people back to life, Allah usually refers to some wonders of His creation, such as the planets, the alternation of the day and night, the mountains, and the development of the human embryo.",
  "77124": "The Trumpet will be blown at two different occasions, signalling the beginning of Judgment Day. The first blow will cause all creation to die, except whoever Allah spares, and the second one will cause them to be raised from the dead.",
  "77125": "It is commonly believed that Hamân was in charge of architecture during the reign of Pharaoh at the time of Moses (ﷺ).",
  "77126": "The fulfilment of the Pharaoh’s old dream that his reign would come to an end at the hands of a boy from the Children of Israel.",
  "77127": "In his adulthood, Moses and Pharaoh’s people were not on good terms because he started to question their evil practices.",
  "77128": "The man assumed that Moses was going to hit him.",
  "77129": "Moses left Egypt with no food, money, or even shoes. He was completely worn out by the time he arrived in Midian. After he prayed for help, Allah gave him a wife, a job, and a home on the same day.",
  "77130": "lit., information. Moses and his family lost their way in the dark while they were travelling from Midian to Egypt.",
  "77131": "See footnote for 20:22.",
  "77132": "When Moses put his arm through the opening in his collar again, his hand returned to its original colour.",
  "77133": "The pagans are reminded repeatedly in the Quran that the Prophet (ﷺ) did not witness any of these events that happened centuries before he was born. For example, the conspiracies that were made against Joseph (12:102), the dispute on who should be the guardian of young Mary (3:44), and the drowning of Noah’s son in the Flood (11:49). These details were not known to Arabs before the revelation of the Quran. So the only logical way that the Prophet (ﷺ) knew about these stories is through divine revelation.",
  "77134": "So they neglected the Commandments over time.",
  "77135": "The pagans of Mecca demanded that the Quran should have been revealed all at once like the Torah, and the Prophet (ﷺ) should have had some tangible signs like the staff of Moses.",
  "77136": "Some Meccan pagans approached some Jewish authorities to inquire about the Prophet’s message and they were told that there are references of him in the Torah. So the pagans immediately rejected both the Torah and the Quran as two works of magic.",
  "77137": "lit., ‘We had already been Muslims.’",
  "77138": "By travellers such as the Meccan pagans.",
  "77139": "A prophet.",
  "77140": "Korah was the cousin of Moses. Because of Korah’s close association with Pharaoh, he became very rich and started to behave arrogantly towards his own people. When he was asked repeatedly by Moses (ﷺ) to pay his alms-tax to help poor Israelites, Korah refused and eventually conspired with a prostitute to damage the reputation of Moses, but Moses was cleared of any wrongdoing.",
  "77141": "Or: “I have been granted all this because I know that Allah knows I deserve it.”",
  "77142": "Since their sins are already known to Allah and written in perfect records, they will only be interrogated as a form of punishment.",
  "77143": "This verse was revealed while the Prophet (ﷺ) was on the way to Medina, emigrating from Mecca after years of persecution. Eventually the Prophet (ﷺ) returned to Mecca and the majority of its people accepted Islam.",
  "77144": "lit., except His Face.",
  "77145": "Other gods.",
  "77146": "The burdens of those they misled.",
  "77147": "lit., My mercy.",
  "77148": "The idolaters tried to burn Abraham because he smashed their idols. See 21:51-71 for the full story.",
  "77149": "Through honourable mention, righteous family, etc.",
  "77150": "Since the angels came in the form of handsome men, Lot was worried for the dignity and safety of his guests among his people—not knowing that they were angels.",
  "77151": "Meccan caravans always passed by these ruins on the way to Yemen and Syria for business.",
  "77152": "Externally, the web is too flimsy to protect the spider against rain and strong wind. Internally, the spider’s family structure is fragile, since some species are cannibalistic, with the female preying on the male and the young eating their own mother.",
  "77153": "Mecca was considered as a sanctuary. Therefore, fighting was not allowed there, and whoever entered Mecca (especially in the neighbourhood of the Ka’bah) was safe—a privilege that other cities in Arabia did not have.",
  "77154": "i.e., the false gods and idols.",
  "76490": "The Decisive Authority (Al-Furqân) is one of the names of the Quran.",
  "76491": "The precise verses are easy to understand and deal mostly with matters of belief and practice, such as the belief in one God (Sûrah 112), forbidden foods (see 5:3), and the commandments in 6:151-152 and 17:23-39. As for the elusive verses, their full meaning is known only to Allah, such as the meaning of letter combinations at the beginning of some sûrahs, such as Alif-Lãm-Mĩm (see Stylistic Features), and how Allah settles Himself on the Throne.",
  "76492": "Wealth and children were considered the most important things in pre-Islamic Arabia, and so the frequent mention of these things in the Quran is meant to represent all worldly gains.",
  "76493": "It can also be understood that the disbelievers were made to think there were twice as many believers in the battlefield.",
  "76494": "Banîn means sons. In the ancient Arab culture, sons were a source of pride for their parents and tribes. This is because they provided for their families and took up arms in defence of their tribes.",
  "76495": "See footnote for 2:25.",
  "76496": "Optional prayers before dawn are recommended and are more likely to be accepted.",
  "76497": "i.e., full submission to the Will of Allah.",
  "76498": "No community split into believers and disbelievers until they received the knowledge given by their prophet.",
  "76499": "This refers to the pagans of Arabia before Islam.",
  "76500": "i.e., the Torah.",
  "76501": "i.e., dedicating the child to service in the temple.",
  "76502": "Service at the temple was hosted by males only.",
  "76503": "The prayers of Mary’s mother were answered. In a ḥadîth collected by Bukhâri and Muslim, the Prophet (ﷺ) says, “Every child is touched by Satan when they are born—and they cry because of this contact—except Jesus and his mother.”",
  "76504": "In the Quran, Jesus is called the “Word” of Allah since he was created with the word “Be!”",
  "76505": "Messiah (Masîḥ) means the “anointed one.” It is used in the Quran exclusively as a title for Jesus Christ.",
  "76506": "‘Mutawaffîka’ means literally: “I will make you reach the end of your worldly term.” The popular Muslim belief is that a conspiracy was made to kill Jesus. Allah made the main culprit who betrayed Jesus look exactly like Jesus, while the culprit was crucified. Similar to Christians, Muslims believe in the second coming of Jesus (ﷺ).",
  "76507": "As a testament to your prophethood.",
  "76508": "The perception of Jesus (ﷺ).",
  "76509": "Abraham (ﷺ) being Jewish or Christian.",
  "76510": "Linguistically, “Muslim” means “someone who has submitted themselves to Allah.”",
  "76511": "Muḥammad (ﷺ).",
  "76512": "“Gentiles” here refers to the pagans of Arabia.",
  "76513": "Muḥammad (ﷺ).",
  "76514": "i.e., full submission to the Will of Allah.",
  "76515": "Their repentance will not be accepted if they die as disbelievers.",
  "76516": "Jacob (ﷺ).",
  "76517": "When Jacob fell sick, he made camel meat unlawful for himself, but not for the rest of his people.",
  "76518": "Pilgrimage is obligatory on every Muslim at least once in their lifetime if the person is physically and financially able.",
  "76519": "Meaning, always be conscious of Him; obedient and grateful to Him.",
  "76520": "lit., except as Muslims.",
  "76521": "i.e., Allah’s covenant.",
  "76522": "i.e., they can only annoy you with their words.",
  "76523": "When the Prophet (ﷺ) was injured at the Battle of Uḥud, some of his companions suggested that he should pray against the pagans of Mecca. He responded, “I have not come to condemn people, but as a mercy to pray for their guidance.” The verse here says that it is not up to the Prophet whether they believe or disbelieve. A prophet’s only duty is to convey the message. Eventually, almost all Meccans accepted Islam before the death of the Prophet (ﷺ).",
  "76524": "“This” either refers to how the forces of evil are ultimately destroyed, or that the Quran is a reminder of the destruction of evildoers.",
  "76525": "The archers disputed whether to keep their positions after the initial victory. Eventually, most of them decided to go in pursuit of the spoils of war, disobeying the Prophet’s direct orders not to leave their position no matter what happened. Defeat became inevitable.",
  "76526": "i.e., the hypocrites.",
  "76527": "i.e., try not to die when your time comes.",
  "76528": "The Prophet (ﷺ) realized that the city of Medina became vulnerable after the Muslim loss at Uḥud. So on the next day of the battle he decided to lead a small force of his companions—many of whom had been wounded at Uḥud—to chase away the Meccan army which was camping at a place called Ḥamrâ' Al-Asad—not far from Medina. Abu Sufyân, commander of the Meccan army, sent a man to discourage the Muslims from following the Meccans. Although the man falsely claimed that the Meccans were mobilizing to launch a decisive attack on Medina, the Prophet became more determined to chase them away. Eventually, the Meccans decided to flee and not waste their victory after the Prophet sent a revert to Islam—who was friends with Abu Sufyân—to convince him to withdraw; otherwise Muslims were going to avenge their loss at Uḥud.",
  "76529": "This refers to the warning mentioned in 3:173.",
  "76530": "i.e., the distinction between the true believers and hypocrites.",
  "76531": "i.e., your forefathers.",
  "76532": "i.e., the original Torah of Moses and the Gospel of Jesus.",
  "76533": "Meaning, a believer is always tested through the loss of wealth as well as sickness, injuries, and the loss of life.",
  "76534": "The caller is Muḥammad (ﷺ).",
  "76535": "Râbiṭo refers to watching over the borders of one’s homeland. It can also mean keeping up one’s prayers.",
  "77155": "This can also mean “in the lowest part of the earth.”",
  "77156": "This Meccan sûrah takes its name from the reference to the Romans in verse 2. The world’s superpowers in the early 7th century were the Roman Byzantine and Persian Empires. When they went to war in 614 C.E., the Romans suffered a devastating defeat. The Meccan pagans rejoiced at the defeat of the Roman Christians at the hands of the Persian pagans. Soon verses 30:1-5 were revealed, stating that the Romans would be victorious in three to nine years. Eight years later, the Romans won a decisive battle against the Persians, reportedly on the same day the Muslims vanquished the Meccan army at the Battle of Badr.",
  "77157": "This verse outlines the times of the five daily prayers. The evening refers to Maghrib and ’Ishâ' prayers, the morning refers to Fajr, the afternoon refers to ’Aṣr, and noon refers to Ẓuhr.",
  "77158": "Hope of rain and fear of torment.",
  "77159": "lit., to Him.",
  "77160": "This is from a human perspective. Otherwise, both the creation of the universe and the resurrection of humans are easy for Allah.",
  "77161": "The passage says that since humans would not allow those who are inferior to them to become their partners in wealth, how can they set up helpless partners with Allah in His kingdom?",
  "77162": "lit., seek the Face of Allah.",
  "77163": "Another meaning is the gift given to someone with the intention of getting a more expensive gift in return—a common ancient practice.",
  "77164": "lit., grey hair.",
  "77165": "Some pagan Arabs used to utilize singing, dancing, chanting, etc. to distract people’s attention from listening to the recitation of the Quran.",
  "77166": "Luqmân is believed to have been a righteous, wise man who lived around the time of Prophet David (ﷺ).",
  "77167": "Other gods.",
  "77168": "Satan.",
  "77169": "He knows precisely when, where, and how much rain falls, and whether it is going to be drunk by people and animals or used for irrigation, or absorbed by the earth, etc.",
  "77170": "The Prophet (ﷺ) was reported in a ḥadîth collected by Bukhâri and Muslim to have said, “Indeed, the creation of each one of you is brought together in the womb of one’s mother as a drop of ˹male and female˺ discharges for forty days, then one becomes a clinging clot for a similar period, then a lump of flesh for a similar period. Then an angel is sent to blow the breath of life into the embryo. The angel is then commanded to write four things: one’s destined provisions, lifespan, actions, and whether one will be happy or miserable ˹in the Hereafter˺.”",
  "77171": "See footnote for 7:54.",
  "77172": "Adam (ﷺ).",
  "77173": "Other possible translations: 1. “Do not be in doubt that Moses received it.” 2. “Do not be in doubt of your meeting with Moses.”",
  "77174": "i.e., prophets.",
  "77175": "This divorce (called ẓihâr) was commonly practiced in Arabia before the Prophet (ﷺ). If a man declared his wife as unlawful for him as the ẓahr (back) of his mother, his wife would be divorced. Islam abolished this type of divorce (see 58:3-4).",
  "77176": "The following distinction should be made:Sponsorship (which is permissible): a person can sponsor a child or host them in their home and care for them as they care for their own children, except for legal matters. For example, adopted children keep their last names, are allowed to marry the children of their adopted parent, adopted and biological children of the opposite sex should dress modestly in front of each other, and do not have a share in the estate of their adopted parents, but can get a share of inheritance (up to one-third of the estate) through bequest (waṣiyah). Adoption: a person is not allowed to take an orphan and give them his/her last name, give them a share of inheritance similar to their own children, etc.",
  "77177": "This verse confirms a ruling mentioned in 8:75 which ended a previous ruling that allowed inheritance between Muslims from Mecca (Al-Muhâjirûn, the Emigrants) and Muslims from Medina (Al-Anṣâr, the Helpers). Now, only relatives can inherit from one another, whereas non-heirs can receive a share through bequest, up to one third of the estate. See 4:7, 11-13, 32-33, and 176.",
  "77178": "See footnote for 27:75.",
  "77179": "In 5 A.H./627 C.E., the Meccan pagans along with some Arab and Jewish tribes (totalling around 10 000 soldiers) laid a siege around Medina, where the Prophet (ﷺ) was positioned with 3000 soldiers. The Prophet (ﷺ) had anticipated the offence and, upon an advice from one of his companions, dug a trench around the city to protect it from invaders. After several unsuccessful attempts to cross the trench, the allied enemies quickly lost morale, and were forced to end the siege due to severe weather conditions. This encounter is commonly known as the Battle of the Trench or the Enemy Alliance.",
  "77180": "The angels.",
  "77181": "lit., from above and below you.",
  "77182": "The believers were reassured while the doubts of the hypocrites grew more fierce.",
  "77183": "Yathrib was the name of Medina before the arrival of the Prophet (ﷺ) and Muslim emigrants.",
  "77184": "Until the end of your short life on earth.",
  "77185": "See footnote for 7:46.",
  "77186": "The Jews of Banu Quraiẓah who had violated their treaty with the Muslims and sided with the enemy alliance. The Prophet (ﷺ) asked how they wished to be judged, and they chose to be judged by their book, the Torah—in which the penalty for treason is death.",
  "77187": "Allah’s revelations refers to verses of the Quran whereas prophetic wisdom refers to the sayings and teachings of the Prophet (ﷺ), known collectively as ḥadîth.",
  "77188": "Though Islam and Îmân are sometimes used interchangeably in the Quran, Îmân is a higher state of Islam. A Muslim is someone who observes the five pillars of Islam, but a believer is someone with strong faith, who does everything purely for the sake of Allah, and is mindful of Allah in everything they say or do. Every Mu'min (believer/faithful) is a Muslim, but not every Muslim is a Mu'min. See 49:14.",
  "77189": "Meaning, if Allah makes a ruling in the Quran or the Prophet (ﷺ) makes a ruling, then a Muslim is not allowed to seek judgment from anyone else, nor follow their own desires.",
  "77190": "This refers to Zaid ibn Ḥârithah, the Prophet’s adopted son before adoption was made unlawful. His wife, Zainab bint Jaḥsh was from a prestigious family. Because Zaid and Zainab came from two different social classes, the marriage was not successful. Eventually, Zaid insisted on divorcing his wife, despite several appeals from the Prophet (ﷺ). Since one’s adopted son was no longer considered to be one’s own son, the Prophet (ﷺ) was later allowed to marry Zainab.",
  "77191": "Allah’s favour to Zaid was to guide him to Islam, and the Prophet’s favour was to free him from slavery.",
  "77192": "He (ﷺ) is not the father of Zaid (mentioned in 33:37) or any other man. The Prophet (ﷺ) had three biological sons, who all died in childhood.",
  "77193": "Before the marriage is consummated.",
  "77194": "If divorce is pronounced after the consummation of marriage, a waiting period of three months is observed to give the couple a chance to get back together and to see if the wife is pregnant (see 65:4). But if the divorce happens before the marriage is consummated, then there is no waiting period.",
  "77195": "See footnote for 4:3.",
  "77196": "This ruling was exclusively for the Prophet (which he never took advantage of), but Muslims have to pay a dowry to their wives. Some women did offer themselves to the Prophet (ﷺ) in marriage, but he declined.",
  "77197": "The Prophet’s married life can be classified as follows:Until the age of 25: he was single.Age 25 – 50: he was married only to Khadîjah.Age 50 – 52: he was single after Khadîjah’s death.Age 53 – his death at the age of 63: he had a total of ten wives. Many of these marriages were to widows (who had been left with their children without a provider) and in some cases to foster stronger ties with some of his companions and neighbouring tribes. Of all the women he married, ’Ȃishah was the only virgin.",
  "77198": "Paternal and maternal uncles are similar to the fathers.",
  "77199": "By attributing children to Him or associating gods with Him in worship.",
  "77200": "By calling him a liar or speaking ill of him and his family.",
  "77201": "By harming them physically or accusing them falsely.",
  "77202": "He has forgiven what Muslim women did in the past because they were not obligated to cover up.",
  "77203": "This verse is intended to deter the hypocrites. The Prophet (ﷺ) never killed any hypocrite as long as they did not join the enemy to attack and kill Muslims.",
  "77204": "The Quran does not specify how Moses was slandered by some of his people. Some narrations suggest that he was either falsely accused of adultery (see footnote for 28:76), killing his brother Aaron (who died a natural death), or having a skin disease since he, unlike others, used to bathe with his clothes on.",
  "77205": "This is a guarantee from Allah that if the hypocrites and polytheists ever turn to Him in repentance, He is always willing to forgive them.",
  "77206": "See footnote for 33:6.",
  "77207": "Which was permissible at the time of Solomon (ﷺ).",
  "77208": "Which he died while leaning on.",
  "77209": "lit., tamarisks.",
  "77210": "lit., lote trees.",
  "77211": "i.e., Mecca and Jerusalem.",
  "77212": "They became bored of living comfortably and traveling easily. A similar example can be found in 2:61, where the Children of Israel became bored with the manna and quails and wanted to eat other things such as onions and garlic.",
  "77213": "Iblîs was the name of Satan before his fall from grace (see footnote for 2:33). His assumption (or vow) was that he could easily mislead the majority of people (see 7:16-17, 15:39-40, and 38:82-83).",
  "77214": "The believers and polytheists.",
  "77215": "i.e., the devils.",
  "77216": "Like the people of Pharaoh, ’Ȃd, and Thamûd.",
  "77217": "i.e., Muḥammad (ﷺ).",
  "77218": "From the place of Judgment to Hell.",
  "77219": "When it is already too late.",
  "77220": "Satan.",
  "77221": "Created your father, Adam, from dust.",
  "77222": "Males and females.",
  "77223": "See footnote for 33:6.",
  "77224": "This can also mean that they are in awe of their Lord as much in private as they are in public.",
  "77225": "This implies Hell and Paradise.",
  "77226": "According to a Prophetic narration collected by Ibn Ḥibbân, the total number of prophets sent around the world, from Adam (ﷺ) to Muḥammad (ﷺ), is 124 000—of which only twenty-five are mentioned in the Quran.",
  "77227": "i.e., the Torah, the Gospel, and Psalms.",
  "77228": "See previous footnote.",
  "77229": "The Reminder is another name for the Quran.",
  "77230": "See footnote for 35:18.",
  "77231": "See footnote for 35:11.",
  "77232": "The moon completes a cycle every month (waxing and waning), while the sun takes a whole year to complete its cycle (resulting in the spring, summer, fall, and winter seasons).",
  "77233": "On the Day of Judgment, the Trumpet will be blown by an angel—causing all to die. When it is blown a second time, everyone will be raised from the dead for judgment (see 39:68).",
  "77234": "Meaning, We have the ability to turn them into stone or any other inanimate object.",
  "77235": "Human beings are born weak, then they reach their prime, then they grow weak after a certain age. See 30:54.",
  "77236": "lit., ‘what Our Own Hands have created.’",
  "77237": "Another meaning is that those idols will be assembled to witness the torment of their worshippers on Judgment Day.",
  "77238": "The verse refers to two types of Arabian trees, markh and ’afâr, which produce fire when their green branches are rubbed together.",
  "77265": "The pagans demanded an angel to deliver the message, not a human being like themselves.",
  "77266": "They meant that the Prophet (ﷺ) is not concerned with their guidance, and that he only wants to gain dominance over them.",
  "77267": "This refers either to the concept of the Trinity in Christianity or Arab polytheistic beliefs.",
  "77268": "In other words, they do not question the honesty of the Prophet (ﷺ), but question the Quran itself. This verse is similar to 6:33.",
  "77269": "This verse alludes to the defeat of the Meccan pagans later at Badr.",
  "77270": "i.e., pyramids and obelisks.",
  "77271": "i.e., the people of Shu’aib (ﷺ).",
  "77272": "Brother in faith or business partner.",
  "77273": "Some commentators have a different interpretation, which is not supported by reliable sources. They maintain that Solomon kept watching these fine horses until the sun set, then he realized that he had missed the noon prayer because of his love for horses, so he killed them, striking at their legs and necks.",
  "77274": "It is reported in a ḥadîth collected by Bukhâri that one night Solomon said that each of his wives would conceive a boy who would struggle in Allah’s cause. He forgot to say ‘Allah willing,” so only one of them gave birth to a deformed, dead baby. So Solomon prayed to Allah for forgiveness.",
  "77275": "The jinn dived to bring him pearls.",
  "77276": "Job was afflicted with losing his children, community, and with a long illness. Only his wife stayed with him. He once became angry with his wife and vowed to give her one hundred lashes if he recovered. When Job’s affliction was lifted, he became remorseful at what he had said. To help Job fulfil his vow without harming his wife, Allah ordered him to strike her with a bundle of one hundred blades of grass.",
  "77277": "Scholars are in disagreement as to whether Ⱬul-Kifl was a prophet or just a righteous man. Those who maintain that he was a prophet identify him with various Biblical prophets such as Ezekiel, Isaiah, and Obadiah.",
  "77278": "Meaning, they are not welcome since their presence in Hell with us will not benefit us in anyway.",
  "77279": "In other words, did we underestimate them?",
  "77280": "When the angels obeyed Allah’s orders to prostrate before Adam, whereas Satan refused to comply.",
  "77281": "See footnote for 2:34.",
  "77282": "The command to bow down was a test of obedience. Satan arrogantly refused to comply because he believed he was superior to Adam (ﷺ).",
  "77283": "Those who are devoted to Allah alone and those who associate other gods with Him.",
  "77284": "i.e., Adam (ﷺ).",
  "77285": "i.e., Eve.",
  "77286": "The four pairs (males and females), as listed in 6:143-144, are: a pair of sheep, a pair of goats, a pair of camels, and a pair of oxen.",
  "77287": "The three layers of darkness are: the belly, the womb, and the amniotic sac.",
  "77288": "This verse can apply to anything that a person listens to, and it can also apply specifically to the Quran—meaning, for example, those who read verses about retaliation and other verses about forgiveness, then they opt for forgiveness.",
  "77289": "The slave owned by several quarrelsome masters will always be confused because their masters will always give them conflicting orders—similarly, one who worships multiple gods will never find peace between them. This parable is a logical argument against the existence of multiple gods, since each god would try to covet what it created. See 23:91 for a similar argument.",
  "77290": "Like Korah (see 28:76-81).",
  "77291": "No matter how big someone’s sins are, they cannot be bigger than Allah’s mercy. Based on 4:48, the only unforgivable sin in Islam is if someone dies while disbelieving in Allah or associating others with Him in worship. In an authentic narration collected by At-Tirmiⱬi, the Prophet (ﷺ) reports that Almighty Allah says, \"O children of Adam! As long as you call upon Me, putting your hope in Me, I will forgive you for what you have done, and I will not mind. O  children of Adam! If your sins were to reach the clouds of the sky and then you sought My forgiveness, I would ˹still˺ forgive you. O  children of Adam! If you were to come to Me with sins filling the whole world and then you came to Me without associating other gods with Me, I would certainly match your sins with forgiveness.\"",
  "77292": "This refers to the place where the judgment will be held. The Prophet (ﷺ) is reported in a ḥadîth collected by Aṭ-Ṭabarâni to have said, “The Judgment will be passed on an earth where neither blood has been shed nor any sin committed.”",
  "77293": "This is emphasized in 21:105. The meaning is that Allah will award Paradise to the believers to be its residents forever. Some commentators say that the word “inherit” is used because of the understanding that when Allah created Paradise and Hell, He made places for all of humanity in both. Those who will go to Paradise will inherit the spots of the disbelievers who chose misguidance (which leads to Hell), and those who will go to Hell will inherit the spots of those who chose guidance (which leads to Paradise).",
  "77294": "The believers will praise Him for His grace, and the disbelievers will praise Him for His justice.",
  "76536": "i.e., Adam and Eve.",
  "76537": "The Quran is the only scripture that says marry only one. Unlike any previous faith, Islam puts a limit on the number of wives a man can have. Under certain circumstances, a Muslim man may marry up to four wives as long as he is able to provide for them and maintain justice among them—otherwise it is unlawful. With the exception of Jesus Christ and John the Baptist (neither of whom were married), almost all religious figures in the Bible had more than one wife. According to the Bible, Solomon (ﷺ) had 700 wives and 300 concubines (1 Kings 11:3) and his father, David (ﷺ), had many wives and concubines (2 Samuel 5:13).",
  "76538": "A bondwoman is a female slave that a man owned either through purchase or taking her captive in war—a common ancient practice in many parts of the world. Islam opened the door for ending slavery by making it an act of charity to free slaves. Many sins (such as breaking one’s oath, unintentional killing, and intercourse with one’s wife during the day of fasting in Ramaḍân) can be atoned by freeing a slave. According to Islamic teachings, no free person can be enslaved. Islam also improved the condition of slaves. It was unlawful to separate a mother from her child. Children born to a slave-master were deemed free, and their mother would gain her freedom upon the death of her master. With regards to slaves, Prophet Muḥammad (ﷺ) says, “Feed them from what you eat, clothe them from what you wear, and do not overwhelm them with work unless you assist them.” He (ﷺ) also says, “Whoever kills his slave will be killed and whoever injures his slave will be injured.” In recent times, slavery has been outlawed in all countries—including the Muslim world.",
  "76539": "For example, in the case of orphaned children whose grandfather then dies, leaving behind other children, some scholars rule that an obligatory bequest should be made to them despite not having a share in inheritance.",
  "76540": "According to Islamic law of inheritance, a female—whether she is a mother, a wife, a sister, a daughter, etc.—gets one of three shares, depending on her closeness to the deceased:Less than a male’s share. If she is a daughter, she will get half of the share of her brother, since he—unlike his sister—has to provide for the family and pay a dowry at the time of his marriage. More than a male’s share. For example, if a man leaves $24 000 and six sons, two brothers, a wife, and a mother. The wife will get one-eighth ($3000), the mother one-sixth ($4000), each of the sons will receive about $2 833 and the two brothers will not get anything. An equal share. This is in the case of siblings from the mother’s side (mentioned in verse 12 of this sûrah).",
  "76541": "\"Offspring” here means any number of children—male or female.",
  "76542": "And the father will take the rest of the estate.",
  "76543": "Although the existence of siblings reduces the mother’s share from one-third to one-sixth, siblings themselves do not receive a share of inheritance and the rest of the estate goes to the father.",
  "76544": "Debts as well as any other financial obligations (such as funeral expenses, unfulfilled vows, or unpaid dowry) have to be repaid before the fulfilment of bequests, then the estate can be distributed among the heirs. A person can bequest up to one-third of their estate for charities as well as individuals who are not entitled to a share in inheritance.",
  "76545": "You do not know who will benefit you by looking after you during your life or doing good deeds on your behalf after your death.",
  "76546": "If there are two or more brothers and sisters from the mother’s side, they share one-third equally—the female will receive the same share of the male.",
  "76547": "Harming the heirs includes giving away more than one-third of the estate as a bequest.",
  "76548": "A person’s repentance will be accepted as long as they repent any time before their death. But one should not procrastinate because they do not know when they will die.",
  "76549": "For example, a man would prevent a female relative (such as his sister or mother) from getting married so he can secure her estate for himself.",
  "76550": "lit., blatant misconduct. If someone’s wife has been found guilty of adultery, he has the right to ask for his dowry back.",
  "76551": "i.e., the promise to live with her in kindness or divorce her with dignity.",
  "76552": "A man was not allowed to have a relationship with a bondwoman who he had taken captive in war unless he made sure she was not pregnant. This was verified by her having at least one monthly cycle. See footnote for 4:3.",
  "76553": "Do not be ashamed to marry a bondwoman since you are all part of the same human family and Allah knows you are doing so to avoid illegal relationships.",
  "76554": "A married slave-woman is forbidden from having a relationship with her master.",
  "76555": "i.e., fifty lashes.",
  "76556": "i.e., Paradise.",
  "76557": "This pledge was a common practice before Islam between friends and allies—taking oaths to inherit each other. This practice came to an end with the revelation of verse 8:75 of the Quran. Although friends and allies do not have a share in inheritance anymore, they still can get some of the estate through bequest.",
  "76558": "i.e., their husbands’ honour and wealth.",
  "76559": "Disciplining one’s wife gently is the final resort. The earliest commentators understood that this was to be light enough not to leave a mark, should be done with nothing bigger than a tooth stick, and should not be on the face. Prophet Muḥammad (ﷺ) said to his companions “Do not beat the female servants of Allah.” He said that honourable husbands do not beat their wives, and he himself never hit a woman or a servant. If a woman feels her husband is ill-behaved, then she can get help from her guardian or seek divorce.",
  "76560": "lit., the smallest particle of dust (ⱬarrah).",
  "76561": "Prophet Muḥammad (ﷺ) asked one of his companions, ’Abdullah ibn Mas’ûd, to recite some verses of the Quran for him because he loved to hear it from someone other than himself. ’Abdullah recited from the beginning of this sûrah until he reached verse 42. When he was told he may stop, ’Abdullah said he looked at the face of Prophet (ﷺ) and saw tears rolling down his cheeks.",
  "76562": "Intoxicants were prohibited in the Quran in three stages: 2:219, 4:43, and finally 5:90-91.",
  "76563": "i.e., after sexual intercourse or a wet dream.",
  "76564": "This ruling is called tayammum or ‘dry ablution.’ If someone cannot find water or is unable to use it because of illness or cold weather, then they are allowed to touch clean earth, sand, etc. with the palms of their hands once then blow in their hands and wipe over their face and hands.",
  "76565": "See 7:163-165.",
  "76566": "A person will never be forgiven if they die as a disbeliever. But if they repent before their death and mend their ways, then their repentance will be accepted (see 25:68-70).",
  "76567": "i.e., the polytheists.",
  "76568": "i.e., Abraham (ﷺ) or Muḥammad (ﷺ).",
  "76569": "See footnote for 2:25.",
  "76570": "This verse was revealed right after Mecca had peacefully surrendered to the Muslims. ’Ali ibn Abi Ṭâlib, the Prophet’s cousin and son-in-law, took the Ka’bah’s key by force from Othmân ibn Ṭalḥa, the non-Muslim keeper of the Ka’bah. The verse was revealed to the Prophet (ﷺ) inside the Ka’bah with the order to give the key back to its rightful owner. He (ﷺ) ordered Ali to return the key to the keeper immediately along with an apology. Othmân was also promised that his family would keep the key forever. The keeper was so touched by the Quranic sense of justice that he decided to accept Islam.",
  "76571": "i.e., obeying Allah and His Messenger.",
  "76572": "Both good and evil are destined by Allah. The good comes as Allah’s reward for good deeds, whereas the bad comes as Allah’s punishment for evil deeds. In some cases, bad things happen to good people to test their faith, or as an atonement for their sins, or as part of a process of replacing something with what is better (e.g., a job or a spouse).",
  "76573": "i.e., when they get the news of victory or a threat.",
  "76574": "The verse discusses a group of people who nominally became Muslims and secretly supported the enemies of Muslims. For those hypocrites to prove their loyalty, they were commanded to emigrate and join the ranks of the believers, or they would be considered enemies.",
  "76575": "If a Muslim commits a major sin (such as intentional killing or adultery) and dies without repenting, they will be punished in Hell according to the severity or magnitude of the sin, then eventually be taken out of Hell. No Muslim will stay in Hell forever.",
  "76576": "i.e., spoils of war.",
  "76577": "This includes women, the elderly, the sick, etc.",
  "76578": "This verse refers to some of those who had accepted Islam secretly in Mecca but refused to emigrate to Medina along with the rest of the believers. Some of them were killed in the Battle of Badr when they were rallied by the Meccans to fight against the Muslims. The verse also applies to any Muslim who accepts abuse and refuses to move to another place where they can live with dignity and practice their faith freely.",
  "76579": "Generally, it is permissible for Muslims who are travelling a distance of 85 km or more to shorten their prayers. A four-unit prayer is reduced to two.",
  "76580": "When the first group prays, the second group stands guard behind them, then the first group withdraws to the back when they finish their prayers and stand guard when the second group moves up to pray.",
  "76581": "lit., deceive themselves.",
  "76582": "This applies to those who die in a state of disbelief in Allah. But those who repent before their death and mend their ways, their repentance will be accepted (see 25:68-70).",
  "76583": "The pagans of Arabia used to shape their idols as females and give them feminine names such as Al-Lât, Al-’Uzza, and Manât.",
  "76584": "Slitting the ears of cattle dedicated to idols was a superstitious practice before Islam.",
  "76585": "This refers to verses 2-11 of this sûrah.",
  "76586": "i.e., their inheritance and dowries.",
  "76587": "This implies that many husbands and wives are unwilling to give the other their rights.",
  "76588": "Do not leave one hanging—not fully enjoying the rights of a married woman and not fully divorced.",
  "76589": "This refers to 6:68.",
  "76590": "i.e., Allah does not like talking about people behind their backs—except when someone who has been wronged seeks counselling or assistance from authorities.",
  "76591": "By their claim that they believe in Allah but still reject some of His messengers.",
  "76592": "i.e., they demanded the Quran to be revealed all at once in writing similar to the Tablets of Moses. This demand is refuted in 25:32.",
  "76593": "Their hearts are unreceptive because they claim they have enough knowledge already.",
  "76594": "i.e., they slandered Mary by claiming that she conceived Jesus through an illegal relationship.",
  "76595": "The popular belief among Muslims is that a conspiracy was made to kill Jesus, Allah made the main culprit who betrayed Jesus look exactly like Jesus, then he was crucified in Jesus’ place. Jesus was raised safe and sound to the heavens. Muslims also believe in the second coming of Jesus (ﷺ).",
  "76596": "Scholars disagree whether Jews and Christians will come to realize that Jesus is a prophet of Allah at the time of their death or before the death of Jesus after his second coming.",
  "76597": "The Jews are warned against denying Jesus as the Messiah, while Christians are warned against calling Jesus Allah.",
  "76598": "i.e., Jesus was created by Allah’s Word “Be!” and he was, and life was breathed into Jesus by the holy spirit (the angel Gabriel) at the command of Allah.",
  "76599": "This verse is placed at the end of the sûrah and not with similar verses at the beginning to connect the end of this sûrah with the next one or, according to Al-Fakhr Ar-Râzi, either to tie the end of the sûrah with its beginning for emphasis, as found in 20:2 and 124 as well as 23:1 and 117, or to emphasize Allah’s knowledge, just like the first verse emphasizes His power.",
  "77295": "You created us from nothing, then gave us life in the wombs of our mothers, then caused us to die at the end of our worldly lives, and finally resurrected us after our death (see 2:28).",
  "77296": "It is reported in a ḥadîth collected by Imâm Muslim that everyone and everything that has ever existed will die on that Day, except for Allah—the Eternal. He will then ask, “Who does all authority belong to this Day? Where are the kings of the world? I am the King.” Since no one will be there to answer, Allah will answer Himself, “˹All authority belongs˺ to Allah—the One, the Supreme!”",
  "77297": "i.e., Moses (ﷺ).",
  "77298": "Meaning, your ancestors, because Joseph (ﷺ) died over 400 hundred years before Moses (ﷺ).",
  "77299": "See 28:38.",
  "77300": "Another possible translation: “Without a doubt, whatever ˹gods˺ you are calling me to ˹worship˺ have no claim ˹to divinity˺ in this world or the Hereafter.”",
  "77301": "The verse does not say “Those in the Fire will cry out to its keepers,” simply because there are levels in the Fire: those in higher levels will plead to the keepers of the depths of Hell to appeal to Allah to lighten the punishment even for one day, since they think they are better than those at the bottom.",
  "77302": "i.e., the Hellfire.",
  "77303": "Like other prophets, Muḥammad (ﷺ) was infallible of sin. The verse here refers to misjudgments, such as the Prophet’s response to the blind man (80:1-10), Jonah’s departure from his city without Allah’s permission (21:87-88), and David’s suspicions of the two men who scaled the wall of his sanctuary (38:21-25). If the Prophet (ﷺ) himself is urged to seek forgiveness, then the believers are even more in need of praying for Allah’s forgiveness.",
  "77304": "Your father, Adam.",
  "77305": "Nuṭfah refers to the union of male and female gametes (sperm and egg) which results in the zygote after fertilization.",
  "77306": "’Alaqah, meaning the embryo resembles a leech.",
  "77307": "i.e., milk, wool, and hide.",
  "77308": "And ridiculed the divine knowledge brought to them by their messengers.",
  "77309": "These four Days include the first two, so the total period of creation is six heavenly Days.",
  "77310": "See footnote for 7:54.",
  "77311": "lit., a bitter and screaming wind.",
  "77312": "It is reported in Ibn Kathîr’s commentary that, on the Day of Judgment, the wicked will deny the evil deeds in their records—as a desperate attempt to escape the horrible punishment in Hell. They will be asked if they accept Allah, the angels, or even their own families and neighbours as witnesses, but they will refuse. So Allah will make their organs testify against them.",
  "77313": "i.e., associating others with Allah in worship and denying the Hereafter. See 43:36-37.",
  "77314": "Especially at the time of their death.",
  "77315": "lit., Muslims.",
  "77316": "This refers to the noise the disbelievers used to make when the Quran was recited (see 41:26), or those who twist the meaning of Quranic passages and take them out of context.",
  "77317": "The Reminder is one of the names of the Quran.",
  "77318": "So they neither hear nor understand the call.",
  "77319": "That He will delay their judgment until the Hereafter.",
  "77320": "“The Mother of Cities” is an honorary title given to the city of Mecca because of its great religious significance as the home of Allah’s first house of worship ever built on earth, and perhaps because of its central location as well.",
  "77321": "Like 33:7, this verse names the five greatest prophets of Islam: Noah, Abraham, Moses, Jesus, and Muḥammad.",
  "77322": "No community split into believers and disbelievers until they received the knowledge given by their prophet.",
  "77323": "That He will delay their judgment until the Hereafter.",
  "77324": "i.e., the Jews and Christians.",
  "77325": "This could also be a call to all believers to love and respect the immediate family of the Prophet (ﷺ).",
  "77326": "Other possible translations: 1. “You will have no refuge then, nor will you have an advocate ˹against punishment˺.” 2. “You will have no refuge then, nor ˹grounds˺ to protest ˹the torment˺.”",
  "77327": "They totally deny previous favours.",
  "77328": "This refers to the Preserved Tablet, Al-Lawḥ Al-Maḥfûẓ, in which Allah has written the destiny of His entire creation.",
  "77329": "For example, in the stories of the people of Noah, Lot, Shu’aib and other nations that were destroyed, found throughout the Quran.",
  "77330": "For example, male and female, sweet and bitter, day and night, plains and mountains, heat and cold, light and darkness.",
  "77331": "See footnote for 37:149.",
  "77332": "i.e., the birth of a baby girl.",
  "77333": "See 2:130-132.",
  "77334": "This refers to Mecca and Ṭâif, two cities in Arabia, around 100 km apart.",
  "77335": "From a worldly perspective, many people are comforted when they hear of others who went through similar trials as them. But this will not be the case on Judgment Day. Everyone will be desperate to save themselves from the punishment, regardless of others.",
  "77336": "i.e., the hand and the staff (see 20:17-22).",
  "77337": "The torments were: famine, shortage of crops, floods, locusts, lice, frogs, and blood (see 7:130-133).",
  "77338": "See 7:134.",
  "77339": "Branches of the Nile.",
  "77340": "Moses used to have a speech impediment. But when he became a prophet he prayed to Allah to help him speak clearly, and his prayer was answered (see 20:25-36).",
  "77341": "When 21:98 was revealed, warning the polytheists that all false gods will be in Hell, ’Abdullâh ibn Az-Ziba’ra, a poet who always attacked Islam, argued with the Prophet (ﷺ) that if what the verse says is true, then Jesus will be in Hell as well! The polytheists, who were present, laughed in agreement with this argument. The Prophet (ﷺ) replied that the verse was talking exclusively about idols, adding that Jesus himself did not ask anyone to worship him. Verse 21:101 was later revealed in support of the Prophet’s argument. Eventually, ’Abdullâh accepted Islam.",
  "77342": "Or “We could have easily produced angels from you …”",
  "77343": "Fruit also implies delicacies.",
  "77344": "Angel Mâlik is the chief keeper of Hell.",
  "77345": "i.e., Jesus, Ezra, and the angels.",
  "77346": "The revelation of the Quran started on the 27th night of Ramaḍân—the 9th month of the Islamic calendar (see 97:1 and 2:185)",
  "77347": "This refers to the drought that affected the Meccan pagans so badly that they came to the Prophet (ﷺ), begging him to pray to Allah to remove the affliction from them.",
  "77348": "Meaning, let my people go.",
  "77349": "i.e., Pharaoh and his soldiers.",
  "77350": "Tubba’ Al-Ḥimiari was an ancient righteous Yemeni king whose people persisted in disbelief and were destroyed, although they were superior to Meccans in strength and manpower.",
  "77351": "Zaqqûm is a tree that grows in the depths of Hell as mentioned in 37:62-65. The pagans of Mecca used to make fun of the Prophet and say, “How can a tree grow in Hell?”",
  "77352": "Abu Jahl, a Meccan pagan leader, met the warning of punishment in the Hereafter by exclaiming, “How can I be punished when I am the mighty, noble one!”",
  "77353": "i.e., rain.",
  "77354": "By sending many prophets, and showing them unique miracles such as the splitting of the sea.",
  "77355": "No community split into believers and disbelievers until they received the knowledge given by their prophet.",
  "77356": "Muḥammad (ﷺ).",
  "77357": "This refers to ’Abdullâh ibn Salâm, a Jewish scholar, who embraced Islam when the Prophet (ﷺ) emigrated to Medina.",
  "77358": "Poor and powerless Muslims.",
  "77359": "The people of ’Ȃd were the residents of the hills in the southern part of the Arabian Peninsula.",
  "77360": "The people of Hûd.",
  "77361": "Or never failed in creating them.",
  "77362": "Noah, Abraham, Moses, Jesus, and Muḥammad are called the Messengers of Firm Resolve.",
  "77363": "i.e., only for a very short period of time.",
  "77371": "This Medinian sûrah takes its name from the clear triumph (i.e., Treaty of Ḥudaibiyah) in verse 1. The Prophet (ﷺ) and 1400 of his companions travelled to Mecca to perform the minor pilgrimage (’umrah) in 6 A.H./628 C.E. He (ﷺ) sent ’Uthmân ibn ’Affân to let the Meccans know that the Muslims had come in peace, only to visit the Sacred House. When the Meccans delayed ’Uthmân, the Prophet (ﷺ) thought they might have killed his envoy. So he (ﷺ) called upon the faithful to pledge allegiance to him under a tree at Ḥudaibiyah in the outskirts of Mecca. Shortly after, ’Uthmân returned safely and a peace agreement was signed by the Muslims and Meccan pagans, stating in part that the Muslims would have to return to Medina and come back next year for ’umrah. The Treaty of Ḥudaibiyah is described as a clear triumph since it established peace, temporarily diffused the tension between the Muslims and the Meccan pagans, and gave the Muslims plenty of time to spread awareness and understanding of their faith. Thousands from different tribes accepted Islam during that truce.",
  "77372": "See footnote for 47:19.",
  "77373": "i.e., that Allah will not support His Prophet (ﷺ) and that misfortune will befall the believers.",
  "77374": "Another possible translation: “… so that you ˹all˺ may believe in Allah and His Messenger, support ˹His cause˺, revere, and glorify Him morning and evening.”",
  "77375": "Those who pledged allegiance at Ḥudaibiyah were promised by Allah that the spoils of war obtained from the Tribe of Khaibar would be exclusively theirs.",
  "77376": "Meaning, you only say so to deprive us of our share.",
  "77377": "This refers to Hawâzin and Thaqîf, two pagan Arab tribes.",
  "77378": "The conquest of Khaibar in 7 A.H./628 C.E.",
  "77379": "Or the spoils of Khaibar.",
  "77380": "lit., turn their backs.",
  "77381": "A group of Meccans wanted to attack the Muslims on their way to Mecca, but were taken captive by the Muslims, then were released.",
  "77382": "The animals that Muslims had brought along to be sacrificed after completing the rituals of the minor pilgrimage (’umrah).",
  "77383": "By doing so, the Meccan Muslims who were unknown to their fellow believers were safe, along with the pagans who later accepted Islam.",
  "77384": "This is when the pagans prevented the Prophet (ﷺ) and the believers from entering the Sacred House for ’umrah and the arrogance they showed when drafting the peace agreement.",
  "77385": "The declaration of faith that there is only one God to be worshipped and that Muḥammad (ﷺ) is His Messenger.",
  "77386": "Pilgrims are required to shave or trim their hair upon successfully completing the rituals of pilgrimage.",
  "77387": "This refers to the Treaty of Ḥudaibiyah and/or the gains of Khaibar before the fulfilment of the Prophet’s vision to enter Mecca for ’umrah.",
  "77388": "This passage and the next should be understood in their historical context. The Muslims were urged to be firm with the Arab pagans and their allies who were at war with Muslims at that time. Otherwise, Islam encourages Muslims to treat peaceful non-Muslims with kindness and fairness. See 60:8-9.",
  "77389": "Prostration means lying down on one’s face (i.e., touching the ground with the forehead and nose while resting on knees and flat palms of both hands) as an act of prayer and submission to Allah.",
  "77390": "In Deuteronomy 33:1-3, ˹Moses proclaimed:˺ “The Lord came from Sinai. Rising from Seir upon us, he shone forth from Mount Paran, accompanied by a myriad of his holy ones, with flaming fire from his right hand for them. Indeed, lover of people, all of his holy ones are in your control. They gather at your feet to do as you have instructed. [sic]” Paran is a mountain in Mecca.",
  "77391": "In Matthew 13:3-9, “˹Jesus˺ spoke many things to them in parables, saying, “Behold, the sower went out to sow. … ˹A seed˺ fell on the good soil and yielded a crop, some a hundredfold, some sixty, and some thirty. “He who has ears, let him hear.”’ Or the parable of the growing seed in Mark 4:26-28.",
  "77392": "See the first footnote for 48:29.",
  "77393": "There is also a different interpretation: “… nor call him ˹by his name˺ as you call one another.” In other words, Do not say, ‘O Muḥammad.’ Rather, say, ‘O Prophet.’",
  "77394": "A group from the tribe of Bani Tamîm came to see the Prophet (ﷺ) while he was taking a nap in the afternoon. They stood outside the homes of his wives and started calling him out loud.",
  "77395": "Al-Walîd ibn ’Uqbah ibn Abi Mu’aiṭ was sent by the Prophet (ﷺ) to collect alms-tax from Bani Al-Muṣṭaliq. They went out to receive Al-Walîd but he assumed they wanted to harm him. Therefore, he quickly returned to the Prophet (ﷺ) with the bad news so he would punish them. Shortly after, a delegation from Bani Al-Muṣṭaliq came to clarify the misunderstanding.",
  "77396": "Or things would have been difficult for you.",
  "77397": "Backbiting people is likened to eating their dead bodies. So if eating someone’s flesh is detestable, then backbiting them is no different.",
  "77398": "The Prophet (ﷺ) is reported in a ḥadîth collected by Imâm Aḥmed to have said, \"O humanity! Your Lord is one, and your ancestry is one. No Arab is superior to a non-Arab, nor is any non-Arab superior to any Arab. No white is superior to any black, nor is any black superior to any white except on account of their righteousness.\"",
  "77399": "The verse makes a distinction between Islam (the declaration of accepting the faith, then performing Islamic duties such as prayers and fasting) and Îmân (a higher state of Islam, which means to embrace the faith wholeheartedly). This distinction is very clear in a famous narration from the Prophet (ﷺ), commonly known as the Ḥadîth of Gabriel.",
  "76600": "To make a decision in pre-Islamic Arabia, a person would draw one of three straws: one saying “Do it,” the other “Do not do it,” and the third was left blank, whereas in Islam there is a special prayer (called istikhârah) for guidance when making a decision.",
  "76601": "“The food of the People of the Book” here means the meat of the animals slaughtered by the Jews and Christians.",
  "76602": "For example, following sexual intercourse or a wet dream.",
  "76603": "This ruling is called tayammum or ‘dry ablution.’ See footnote for 4:43.",
  "76604": "He rescued you from Egypt where the Pharaoh treated you like slaves and blessed you with freedom so you can manage your own affairs.",
  "76605": "i.e., the miracles of splitting the sea, water coming out of the rock, manna and quails, and clouds shading them.",
  "76606": "In Islam, regret for doing something wrong is essential for repentance. But in the case of Cain, his regret was not for killing his brother, but for failing to bury his corpse to hide the evidence of his crime. Therefore, his regret was not intended as a step towards repentance.",
  "76607": "Although this is addressed to the Children of Israel, it is applicable to everyone at all times.",
  "76608": "This ruling (called ḥirâbah) applies to crimes committed by armed individuals or groups against civilians—Muslim or non-Muslim. Different punishments apply depending on the severity of the crime:In the case of murder or rape, offenders are to be executed.In the case of armed robbery, offenders’ right hands and left feet are to be cut off.In the case of terrorizing innocent people, offenders are to be jailed in exile.Penalties for lesser offences are left for the judge to decide.",
  "76609": "In Islam, strict conditions must be met for punishments to be carried out. For example, for someone to be punished for theft, the thief must be a sane adult who knows that theft is forbidden, the crime has to be proven either by confession or the testimony of two reliable eyewitnesses, the stolen item has to be of value and taken secretly from a safe place, and the owner has to claim it. Otherwise, the punishment is not applied. Islamic punishments apply neither in non-Muslim countries nor in Muslim countries where Sharî’ah is not fully applied. Moreover, the punishment is only applicable in a society where the needs of the poor are adequately met (i.e., they receive alms-tax, charity, or welfare) and where theft is more out of desire than necessity. It is worth mentioning that ’Umar ibn Al-Khaṭṭâb, Islam’s 2nd Caliph, suspended this punishment for one year due to widespread famine.",
  "76610": "i.e., bribes and interest.",
  "76611": "Wali means guardian, caretaker, protector, provider, ally, etc. The Prophet (ﷺ) for example says, “A woman should not get married without a wali.”—that is a guardian such as her father to represent her in the marriage and make sure she receives her full rights. The verse forbids Muslims from allying with the Jews and Christians (or anyone else) conspiring to persecute Muslims. On the other hand, as long as non-Muslims are not at war with Muslims or persecuting them, the Quran (60:8) commands Muslims to be kind and gracious to them.",
  "76612": "Literally or metaphorically. See footnote for 2:65.",
  "76613": "lit., Allah’s Hand is tied up ˹with greed˺.",
  "76614": "See footnote for 2:62.",
  "76615": "i.e., they were in need of food for nourishment. According to some scholars, this implies that Jesus and his mother had to relieve themselves after the food had been digested. Almighty Allah is far above depending on food or having to go to the restroom.",
  "76616": "i.e., the pagans.",
  "76617": "See footnote for 5:3.",
  "76618": "This implies that either these minor details have been overlooked by Allah out of His mercy or that Allah has forgiven them for these unnecessary questions.",
  "76619": "These camels were allowed by pagan Arabs to pasture freely and were not to be used for labour or transportation after fathering or giving birth to a certain number of male or female camels.",
  "76620": "i.e., the pagans.",
  "76621": "After fulfilling their obligation of delivering the truth, enjoining what is good, and forbidding what is evil.",
  "76622": "If no Muslim witnesses can be found.",
  "76623": "i.e., the angel Gabriel.",
  "76624": "lit., Muslims.",
  "76625": "This refers to the ascension of Jesus Christ. See footnote for 3:54.",
  "76626": "i.e., as Your creation, they cannot escape the punishment.",
  "77400": "Or a Record preserving ˹everything˺.",
  "77401": "Meaning, they are confused about the Prophet (ﷺ): some say he is a poet, some say he is a fabricator, while others say he is insane. They also rejected the Quran as poetry, magic, or ancient fables.",
  "77402": "Ar-Rass means “well” or “water-pit”. This refers to a pagan people, along with Midian, to whom Allah sent Prophet Shu’aib (ﷺ).",
  "77403": "The people of Shu’aib (ﷺ).",
  "77404": "Tubba’ Al-Ḥimiari was an ancient righteous Yemeni king whose people persisted in disbelief and were destroyed, although they were superior to the Meccans in strength and manpower.",
  "77405": "The angel to the right records the good deeds of each person, while the one to the left records every evil deed. They always accompany the person at all times, except when one uses the toilet or is intimate with their spouse.",
  "77406": "When a denier dies, they will realize that resurrection, judgment, Paradise, and Hell are all true.",
  "77407": "This is the second blow which will cause all to come back to life for judgment.",
  "77408": "Meaning, the decree to punish wicked humans and jinn (see 11:119 and 32:13).",
  "77409": "This can also mean that they are in awe of their Lord as much in private as they are in public.",
  "77410": "i.e., looking at the Face of the Almighty (see 10:26 and 75:22-23).",
  "77411": "See footnote for 7:54.",
  "77412": "Some scholars believe this verse comes in response to Exodus 31:17, which says, “The Lord made the heavens and the earth in six days, but on the seventh day He rested and was refreshed.”",
  "77413": "This verse refers to the times of the five daily prayers.",
  "77414": "See footnote for 50:20.",
  "77415": "Or “By the universe with its fine-tuning.”",
  "77416": "See footnote for 50:5.",
  "77417": "Other possible translations: 1. “… by which the deluded are turned away.” 2. “Whoever is turned away from it is ˹truly˺ deluded.”",
  "77418": "Optional prayers before dawn are recommended, and are more likely to be accepted.",
  "77419": "Abraham (ﷺ) did not want his guests to know that he was going to prepare a meal for them so they would not ask him not to.",
  "77420": "As mentioned in 11:69-70, the angels came to Abraham in the form of men and when he offered them food, they did not eat. In ancient Middle Eastern culture, if a guest refused to eat the food provided by their host, it was a sign of ill-will.",
  "77421": "Prophet Isaac (ﷺ).",
  "77422": "Lot (ﷺ) and his two daughters.",
  "77423": "The ruins of Sodom.",
  "77424": "Because of his arrogance and disbelief.",
  "77425": "lit., ‘a barren wind,’ since the wind was not productive—it did not carry rain or fertilize trees.",
  "77426": "Meaning, you have only three days to live. See 11:65.",
  "77427": "The globe was spread out to accommodate Allah’s creation. The spherical shape of the earth is expressed in 39:5.",
  "77428": "For example, male and female, sweet and bitter, day and night, plains and mountains, heat and cold, light and darkness.",
  "77429": "Since you have already delivered the message clearly.",
  "77430": "Where Moses (ﷺ) communicated with Allah.",
  "77431": "i.e., the Quran.",
  "77432": "This is either the Sacred House in Mecca, which is frequented by pilgrims, or a sanctuary in Heaven, which is frequented by angels.",
  "77433": "The seas and oceans will be on fire on Judgment Day.",
  "77434": "One gets the reward for being patient in difficult times in this world. As for the Hereafter, those who suffer patiently in Hell will not be rewarded for their patience.",
  "77435": "Meaning, no one will carry the burden of another’s sins.",
  "77436": "It is assumed that they will ask each other about their lives in the world and what led them to Paradise.",
  "77437": "The pagan leaders claimed to be Mecca’s most intelligent minds. So this verse questions their intelligence, arguing that the Prophet (ﷺ) cannot be a madman and a poet at the same time.",
  "77438": "Arab pagans were challenged in the Quran to produce its equivalent (52:34), or ten sûrahs (11:13), or at least one sûrah (2:23), but the challenge has never been met.",
  "77439": "See footnote for 37:149.",
  "77440": "i.e., famine, droughts, or the defeat at the Battle of Badr (see 32:21). The Battle of Badr took place in the 15th year of the Prophet’s mission. The previous passage poses fifteen questions to the Meccan pagans before warning them in this passage.",
  "77441": "Muḥammad (ﷺ).",
  "77442": "The angel Gabriel.",
  "77443": "Gabriel used to come to the Prophet in a human form. But he appeared to him (ﷺ) twice in his angelic form: once at the beginning of the Prophet’s mission (when the angel manifested himself, filling the horizon, the Prophet (ﷺ) lost his consciousness), and another time during the Prophet’s Night Journey to the seventh heaven to receive the order to pray directly from Allah (see 17:1).",
  "77444": "lit., he was only two bow-draws away.",
  "77445": "The Prophet was taken to heaven to see some of Allah’s magnificent signs. He only saw what he was told to see.",
  "77446": "See footnote for 52:39.",
  "77447": "Meaning, “You call them gods while in fact they are not gods.”",
  "77448": "Arab pagans took these idols as intermediaries to intercede for them on the Day of Judgment (see 39:3)",
  "77449": "i.e., the Quran.",
  "77450": "i.e., Paradise.",
  "77451": "i.e., your father, Adam.",
  "77452": "See footnote for 31:34.",
  "77453": "lit., laughter and weeping.",
  "77454": "A star worshipped by some ancient pagans.",
  "77455": "Also known as the second ’Ȃd.",
  "77456": "The stones of baked clay that were rained upon them (see 11:82-83).",
  "77457": "The Meccan pagans challenged the Prophet (ﷺ) to have the moon split in two if he wanted them to believe in him. The moon was split, and then re-joined, as reported by several eyewitnesses, but still the pagans refused to believe, calling this miracle “sheer magic.”",
  "77458": "A miracle (usually referred to as a ‘sign’ in the Quran) can be defined as an extraordinary event manifesting divine intervention in human affairs. Every prophet was given miracles to prove he was commissioned by Allah. Moses (ﷺ) was given the miracle of the staff and many others. Jesus (ﷺ) gave life to the dead and healed the blind and the leper. And Muḥammad (ﷺ) received the Quran, a literary miracle, to challenge the masters of Arabic eloquence. The Prophet (ﷺ) performed some other miracles such as splitting the moon, multiplying food and water, and healing some of his companions.",
  "77459": "Angel Isrâfîl will blow the Trumpet, causing all to be raised from the dead for judgment.",
  "77460": "i.e., the Judgment.",
  "77461": "The Flood or the Ark.",
  "77462": "lit., a bitter and screaming wind.",
  "77463": "Who came in the form of handsome men.",
  "77464": "This was later fulfilled in the Battle of Badr.",
  "77465": "Saqar is one of the names of Hell.",
  "77466": "To bring anything into being.",
  "77467": "“Be!” And it is!",
  "77468": "Rivers of water, milk, honey, and wine. See 47:15.",
  "77469": "lit., prostrate.",
  "77470": "This question is repeated thirty-one times in this sûrah: eight times after reminders of Allah’s favours, seven times in the passage talking about the punishment of the deniers of judgment (which is the number of the gates of Hell), and eight times in each of the two following passages talking about Paradise, which has eight gates.",
  "77471": "The two points of sunrise and sunset in the summer and the winter.",
  "77472": "See footnote for 25:53.",
  "77473": "lit., your Lord’s Face.",
  "77474": "Death is listed as one of Allah’s favours since it puts an end to tyrants, ends the suffering of the oppressed, makes all people equal, ushers in judgment and the enforcement of justice, and leads the believers to eternal joy and peace in Paradise.",
  "77475": "Giving life and causing death, making some rich and others poor, elevating some and debasing others, etc.",
  "77476": "Since their sins are already known to Allah and written in perfect records, they will only be interrogated as a form of punishment.",
  "77477": "Warning of the punishment in Hell is listed as a favour just like the promise of the reward in Paradise. Think of this as a road sign: the latter is like a sign about food, gas, etc., and the former is like a cautionary sign about an accident ahead or something hazardous. Both signs benefit people.",
  "77478": "Before these righteous servants in Paradise.",
  "77479": "Unlike this world of sheer injustice, the Hereafter will put everyone in their right place. The righteous will be elevated in Paradise, while the wicked will be humiliated in Hell.",
  "77480": "Another possible translation: “only exchanging greetings of peace.”",
  "77481": "i.e., associating others with Allah in worship and denying the resurrection and judgment.",
  "77482": "See footnote for 44:43.",
  "77483": "This verse refers to two types of Arabian trees, markh and ’afâr, which produce fire when their green branches are rubbed together.",
  "77484": "See 43:4.",
  "77485": "This verse refutes the pagan claim that the Quran was sent down by devils (see 26:210-212). Based on this verse, many jurists maintain that a Muslim should perform ablutions before reading the Quran.",
  "77486": "Some pagans believed that rain was caused by some stars.",
  "77487": "lit., fragrant basil. Throughout the Quran, Paradise is described as being pleasant to the eye, the heart, and the ear. This verse emphasizes the scent as well.",
  "77488": "Another possible translation: “the Manifest ˹through His signs˺ and the Hidden ˹from His creation˺.”",
  "77489": "See footnote for 7:54.",
  "77490": "By His knowledge.",
  "77491": "See 7:172.",
  "77492": "Prior to the victory over Mecca, Muslims were outnumbered and perceived as weak. Once Mecca surrendered to the Muslims, many tribes either accepted Islam or made peace agreements with the Muslim victors. Therefore, the believers who donated and strived at the time of hardship and weakness deserve more rewards than those who did so at the time of ease and prominence.",
  "77493": "i.e., Paradise.",
  "77494": "This wall is said to be the barrier of Al-A’râf (or the heights) between Paradise and Hell. See 7:46-49.",
  "77495": "Satan.",
  "77496": "So it is easy for Him to soften your hearts as well.",
  "77497": "i.e., Paradise.",
  "77498": "A companion named Khawlah bint Tha’labah had a disagreement with her husband, Aws ibn Aṣ-Ṣâmit, who then told her that she was as unlawful for him as the ẓahr (back) of his mother. This statement had been considered to be a form of divorce (known as ẓihâr) in Arabia. Khawlah came to the Prophet (ﷺ) to ask for his opinion. He (ﷺ) told her that he had not received any revelation in this regard, and that, based on tradition, she was divorced. She argued that she and her husband had children together who would suffer if their parents were separated. Then she started to plead to Allah as the Prophet (ﷺ) repeated the same answer. Eventually, this Medinian sûrah was revealed in response to her pleas, thereby abolishing this ancient practice.",
  "77499": "By His knowledge.",
  "77500": "Some Jews used to  play with words when they addressed the Prophet (ﷺ) to ridicule him, saying for example ‘Asâmu ’alaikum’ (death be upon you) instead of ‘Asalâmu ’alaikum’ (peace be upon you)—which is the greeting of Islam, inspired by Allah.",
  "77501": "Spirit here can mean revelation, light, or help.",
  "77502": "The Prophet (ﷺ) allowed Banu An-Naḍîr to carry whatever they could on their camels, so they removed the wooden pillars of their homes, causing them to collapse.",
  "77503": "The Prophet (ﷺ) had instructed the Muslim army not to cut down trees, but some soldiers had to remove some palm trees to be able to enter the fort, to the dismay of Banu An-Naḍîr. When Muslims disagreed on that act, this verse was revealed.",
  "77504": "Meaning, Banu An-Naḍîr.",
  "77505": "This either refers to the defeat of the Meccan pagans at the Battle of Badr or the exile of Banu Qainuqâ’.",
  "77506": "See 14:22.",
  "77507": "i.e., the Hereafter.",
  "77508": "Meaning, that the hearts of the disbelievers are harder than the mountains concerning the Quran.",
  "77509": "Jabbâr comes from the root word ja-ba-ra which means to impose, support, or console. For example, Jabîrah means the cast that supports a broken bone. Hence, Allah is the One Whose Will cannot be resisted, and Who comforts those who are broken or oppressed.",
  "76627": "“Light” is always used in the Quran in the singular (nûr), whereas “darkness” is used in the plural (ẓulumât). Nûr is usually used in a metaphorical sense to refer to true guidance, whereas ẓulumât refers to different forms of misguidance.",
  "76628": "i.e., created your father, Adam, from clay. Some scholars suggest that if we examine all the minerals found in the earth (potassium, nitrogen, and carbon), we find that these are the same minerals that make up our body. Furthermore when we die, our bodies are absorbed back into the ground. And when we are resurrected, we will be resurrected from the ground (see 20:55).",
  "76629": "i.e., they would have been destroyed immediately upon denying the angel.",
  "76630": "Allah has created living beings (like animals, birds, and fish) just like He created human beings. He provides for all and is merciful to all. They all belong to communities and have their own systems of living.",
  "76631": "The Record refers to the Preserved Tablet (Al-Lawḥ Al-Maḥfûẓ) in which Allah has written the destiny of His entire creation.",
  "76632": "lit., seeking His Face.",
  "76633": "The five keys of the unseen are mentioned in 31:34.",
  "76634": "See footnote for 6:38.",
  "76635": "lit., their faith (which they are supposed to follow).",
  "76636": "Allah grants authority to some of His servants in this world, but none will have authority on Judgment Day except Him. See 3:26.",
  "76637": "On the Day of Judgment, the Trumpet will be blown by an angel—causing all to die. When it is blown a second time, everyone will be raised from the dead for judgment (see 39:68).",
  "76638": "i.e., associating false gods in worship with the Almighty.",
  "76639": "i.e., the companions of the Prophet (ﷺ).",
  "76640": "Some Jews.",
  "76641": "“The Mother of Cities” is an honorary title given to the city of Mecca because of its great religious significance as the home of Allah’s first house of worship ever built on earth, and perhaps because of its central location as well.",
  "76642": "i.e., Adam (ﷺ).",
  "76643": "Jinn are another creation of Allah, made of “smokeless fire,” and inhabit a realm parallel to our own. Like us, they have free will and can choose guidance or disobedience.",
  "76644": "i.e., “Jesus” in Christian belief.",
  "76645": "i.e., “the angels” in pre-Islamic Arab tradition.",
  "76646": "No one is able to see Allah in this world, but there is extensive evidence in the Quran and the teachings of the Prophet (ﷺ) that the believers will be able to see their Lord on the Day of Judgment.",
  "76647": "Allegations have always been made that the Prophet (ﷺ) copied the Quran from the Bible, mostly because of similar narratives in both Scriptures (such as the stories of Adam, Joseph, Moses, and others). Historically, the Bible was not translated into Arabic until centuries after the Prophet (ﷺ). Even if an Arabic translation of the Bible existed at his time, he (ﷺ) could not have copied it because he could not read or write. From an Islamic point of view, similarities stem from the fact that both scriptures came originally from the same source—divine revelation. For more details, see the Introduction.",
  "76648": "Because Muslims are allowed to eat the meat of animals slaughtered properly and not carrion, the pagans of Mecca used to argue, “Why are you only allowed to eat what you yourselves kill but not what Allah causes to die?”",
  "76649": "The Quran often compares disbelief to death and blindness whereas belief is compared to life and the ability to see.",
  "76650": "Islam literally means ‘submission to the Will of Allah.’",
  "76651": "For example, the jinn helped humans with magic, while the jinn had a feeling of importance when they had a human following.",
  "76652": "i.e., disobedient Muslims. They will be punished according to the severity of their sins, but eventually no Muslim will stay in Hell forever.",
  "76653": "Or trellised and untrellised.",
  "76654": "Strong cattle like camels and oxen can be used for labour, whereas smaller ones like goats and sheep are not suitable for labour but are good for their meat, milk, hide, etc.",
  "76655": "For example, in retaliation for intentional killing through legal channels.",
  "76656": "i.e., when you testify or judge.",
  "76657": "i.e., the Quran.",
  "76658": "This refers to disobedient believers who neither did any good nor repented before the time of their death or the arrival of the Day of Judgment. This is supported by authentic narrations from the Prophet (ﷺ).",
  "77510": "lit., come out ˹of Mecca˺.",
  "77511": "According to the Treaty of Ḥudaibiyah (see footnote for 48:1-3), Muslims who chose to move to Mecca would not be returned to Muslims in Medina, and Meccan pagans who accepted Islam and chose to move to Medina would be returned to Mecca (except for women).",
  "77512": "Those who moved to Mecca to marry pagans.",
  "77513": "lit., nor come up with a falsehood they have forged between their own hands and legs.",
  "77514": "Aḥmad is another name for Prophet Muḥammad (ﷺ). Both are derived from ḥa-ma-da which means ‘praise.’ Some Muslim scholars believe this verse refers to John 14:16, where Jesus says: “And I will ask the Father, and he will give you another periklytos, to be with you forever.” Periklytos is a Greek word that means ‘the praised one.’ The name of Prophet Muḥammad (ﷺ) appears several times in the Gospel of Barnabas, which is deemed apocryphal by Christian authorities.",
  "77515": "Submission to Allah means ‘Islam’ in Arabic.",
  "77516": "Meaning, they can carry the physical burden of the books, but not understand a word of them.",
  "77517": "i.e., disobeying Allah, killing some of the prophets (including Zachariah and John the Baptist), claiming to have killed Jesus, accusing Mary of adultery, and dealing with usury. See 4:153-158.",
  "77518": "i.e., the Quran.",
  "77519": "This verse was revealed when some early Muslims were prevented from emigrating to Medina by their own spouses and children, so they could not join the Prophet (ﷺ) and the rest of the believers to practice their faith freely.",
  "77520": "Meaning, when a husband intends to divorce his wife—after the consummation of marriage—he should divorce her outside her monthly cycle, provided that he has not touched her after her period. This makes it easy for the wife to observe her ’iddah (waiting period for around three months, see 65:4). Otherwise, things will be complicated for her. For example, if divorce happens after sexual intercourse, she might get pregnant, which delays the end of ’iddah until the end of her pregnancy. If divorce happens during a monthly cycle, scholars are in disagreement as to whether the divorce counts or not. If it does not, she has to wait until her menstruation is over to see if her husband still wants to divorce her.",
  "77521": "Perhaps the husband who has divorced his wife may change his mind and restore the marriage before the end of her waiting period (after the first or second count of revocable divorce).",
  "77522": "A husband may separate from his wife after each of the first two counts of divorce or at the end of her waiting period with dignity. If he chooses to stay with her after the first two counts of divorce then divorces her a third time, the marriage is terminated at the end of her third waiting period. The wife will have to marry and divorce another man before she can be remarried to her ex-husband (see 2:230). However, a woman marrying someone with the intention of getting divorced, in order to return to her first husband, is forbidden.",
  "77523": "This applies to pregnant women who are divorced or widowed.",
  "77524": "After the divorce is finalized.",
  "77525": "This is one of the names of the Quran.",
  "77526": "See 5:89.",
  "77527": "Both wives were disbelievers. Noah’s wife used to give away the identity of the new believers so the disbelievers could persecute them. And Lot’s wife used to tell the men about her husband’s handsome male visitors so they could approach them.",
  "77528": "Gabriel breathed into the sleeves of Mary’s garment so she conceived Jesus (ﷺ).",
  "77529": "Some may point to birth defects, genetic mutations, etc. and say these are flaws. This verse means that, in the grand scheme of creation, everything created has its place, form, and purpose, and that it does exactly what Allah ordained for it.",
  "77530": "See 72:8-10.",
  "77531": "This can also mean that they are in awe of their Lord as much in private as they are in public.",
  "77532": "Another possible translation: “This is what you were calling for.”",
  "77533": "Meaning, whether Allah takes our lives (as you wish) or grants us a long life, it is all good for us. But who will protect you from Allah if you disbelieve in Him.",
  "77534": "Like 53:33-35 and 74:11-26, these verses refer to Al-Walîd ibn Al-Mughîrah, a leader of the Meccan opposition against Islam. He rejected the Prophet (ﷺ) as a madman, so the Quran responded by listing ten of his qualities—two of which were unknown to him: the fact that he was born out of wedlock and that his nose would be chopped off several years later at the Battle of Badr. At least three of his ten sons accepted Islam—including Khâlid ibn Al-Walîd.",
  "77535": "Another possible translation: “… without leaving some for the poor.”",
  "77536": "It is believed that Allah accepted their repentance and replaced their garden with a better one.",
  "77537": "i.e., if only the Meccan pagans knew.",
  "77538": "Like the Face and the Hands, the Shin is believed by many to be one of the qualities of Allah, in a way befitting His Majesty and Greatness. Since baring the shin in the Arab culture is associated with the heat of battle, some interpret the verse metaphorically, so the meaning would be: “˹Beware of˺ the Day when horror sets in.”",
  "77539": "While inside the whale. See 21:87 and 37:139-148.",
  "77540": "This is one of the names of the Quran.",
  "77541": "The Striking Disaster is another name for the Day of Judgment.",
  "77542": "i.e., your ancestors.",
  "76659": "i.e., your father, Adam (ﷺ).",
  "76660": "See footnote for 2:34.",
  "76661": "Satan asked to be allowed to live until humans are resurrected in order to escape death at the end of time. He was told he was going to live only until the time appointed by Allah Almighty.",
  "76662": "There will be enmity between humans and Satan.",
  "76663": "It was customary for the pagans of Mecca to circle the Ka’bah while naked. So verses 26-31 of this sûrah were revealed commanding the believers to cover themselves properly when praying to their Lord.",
  "76664": "The pleasures of this worldly life are shared by believers and disbelievers, whereas the pleasures of the Hereafter will be enjoyed exclusively by the believers.",
  "76665": "i.e., they will receive all provisions and bounties destined for them by their Lord.",
  "76666": "i.e., the bitterness they had in their hearts towards other believers who wronged them in the worldly life.",
  "76667": "Although the word “rijâl” generally means “men,” some Quran commentators believe that the word “rijâl” here can also mean “people,” but they are called men since men make up the majority in the group. In some Arabic dialects, “rijâl” is the plural of “rajul” (man) and “rajulah” (woman).",
  "76668": "The faces of the residents of Paradise will be bright, whereas those of the residents of Hell will be gloomy.",
  "76669": "lit., their faith (which they are supposed to follow).",
  "76670": "The word day is not always used in the Quran to mean a 24-hour period. According to 22:47, a heavenly Day is 1000 years of our time. The Day of Judgment will be 50 000 years of our time (see 70:4). Hence, the six Days of creation refer to six eons of time, known only by Allah.",
  "76671": "They argued that life has its ups and downs and, therefore, they did not perceive adversity as a punishment or prosperity as a test—arguing that the same thing happened to their ancestors.",
  "76672": "lit., as Muslims.",
  "76673": "As we did before the birth of Moses.",
  "76674": "In psychology, this is called self-serving bias and scapegoating.",
  "76675": "i.e., their drowning in the sea.",
  "76676": "Allah reminds Moses that even though his request to see Allah was denied, he has already been favoured by Allah over the people of his time through prophethood and direct communication with the Almighty.",
  "76677": "To follow the commandments that generate more rewards than others, to put grace before justice, etc.",
  "76678": "This could either mean the ruins of destroyed nations or the Hellfire which is the home of the wicked.",
  "76679": "For asking Moses to make Allah visible to them.",
  "76680": "Some Muslim scholars cite Deuteronomy 18:15-18 and 33:2, Isaiah 42, and John 14:16 as examples of the description of Prophet Muḥammad in the Bible. However, Bible scholars interpret these verses differently. The name of Prophet Muḥammad (ﷺ) appears several times in the Gospel of Barnabas, which is deemed apocryphal by Christian authorities.",
  "76681": "Manna (heavenly bread) and quails (chicken-like birds) sustained the children of Israel in the wilderness after they left Egypt.",
  "76682": "The people of Aylah, an ancient town by the Red Sea, were forbidden to catch fish on the Sabbath. However, on Saturdays fish were everywhere, whereas on weekdays no fish were seen. To get around the prohibition, some decided to lay their nets on Fridays and collect the fish caught in their nets on Sundays. Those opposed to this practice were divided into two groups: one group tried to convince the offenders to honour the Sabbath, but soon gave up when their advice was not taken seriously. The second group was persistent in giving advice to the Sabbath-breakers. Eventually, the Sabbath-breakers were punished whereas the other two groups were saved.",
  "76683": "Literally or metaphorically. See footnote for 2:65.",
  "76684": "The mountain was raised over their heads when Moses came to them with the teachings of the Torah and was met with defiance. So the mountain was raised as a miracle and a display of Allah’s infinite power over them.",
  "76685": "Bal’am ibn Ba’ûrâ' was a scholar who lived at the time of Moses (ﷺ) but later deviated from the truth.",
  "76686": "Regardless of whether they are warned or not, still they will not believe.",
  "76687": "Those who twist Allah’s Names then use them to call false gods. For example, Allât, a name of one of the idols was derived from Allah (the One God), Al-’Uzza was derived from Al-’Azîz (the Almighty), and Manât was derived from Al-Mannân (the Bestower).",
  "76688": "i.e., Muḥammad (ﷺ).",
  "76689": "lit., their brothers.",
  "77543": "According to 8:32, An-Naḍr ibn Al-Ḥârith challenged Allah, saying, “If this is indeed the truth from You, then rain down stones upon us from the sky or overcome us with a painful punishment.”",
  "77544": "The holy spirit is the angel Gabriel.",
  "77545": "Judgment Day will seem like 50 000 years for a disbeliever, but it will seem like a very short period for a believer. The Prophet (ﷺ) is reported in a ḥadîth collected by Imâm Aḥmed to have said that, for the believer, this long period will be like the time they took to perform a single prayer in the world.",
  "77546": "lit., private parts.",
  "77547": "See footnote for 4:3.",
  "77548": "Some Meccan pagans used to gather around the Prophet (ﷺ) to mock him and the believers, saying that if there is in fact a Hereafter, they are better entitled to Paradise than the poor believers.",
  "77549": "i.e., from a humble fluid. See 32:8.",
  "77550": "The daily points of sunrise and sunset, caused by the earth’s rotation around its own axis.",
  "77551": "Or “… as if rushing towards a target.”",
  "77552": "Meaning, it is out of Allah’s mercy that He does not hasten your punishment but allows you more time to repent.",
  "77553": "See 22:5 and 23:12-14.",
  "77554": "i.e., your father Adam, who was created from clay.",
  "77555": "These are the names of their main idols. Initially, these idols had been erected to commemorate some righteous people before the time of Noah. After many generations, however, the idols were taken as objects of worship.",
  "77556": "Meaning, evil jinn tempted some pagan Arabs to believe that the angels are Allah’s daughters through female jinn.",
  "77557": "See footnote for 6:128.",
  "77558": "Some jinn used to eavesdrop on the heaven, then pass on what they heard to fortune-tellers. But this practice came to an end once Muḥammad (ﷺ) was sent as a messenger with the Quran.",
  "77559": "Meaning, to see if they will be grateful to Allah for rain and other provisions.",
  "77560": "i.e., Muḥammad (ﷺ).",
  "77561": "This passage lightens the ruling mentioned in 73:2-4. So from now on, the believers do not have to stick to any of the portions specified at the beginning of this sûrah. Rather, they can pray whatever they can at night.",
  "77562": "i.e., giving for charity and good causes.",
  "77563": "The reward for your charity will be far better than what you left behind or what you have given in charity because it will be rewarded ten-fold, or even 700-fold, and Allah gives more to whoever He wills. See 2:261.",
  "77564": "It was a common practice to give someone a gift, hoping to receive a more valuable gift in return. This practice is disliked in Islam.",
  "77565": "This is when the Trumpet will be blown for the second time, causing everyone to rise from the dead for judgment. See 39:68.",
  "77566": "Another possible translation: “It spares none and leaves nothing.”",
  "77567": "Some pagans made fun of the Prophet (ﷺ) when they were told that the keepers of Hell are nineteen angels. One of them said mockingly to other pagans, “You take care of two angels and I will vanquish the rest all by myself.”",
  "77568": "Another possible translation: “In fact, each of them wishes to be given a scripture open ˹for all to read˺.” See 6:124.",
  "77569": "This refers to the fact that every human has a unique set of fingerprints.",
  "77570": "They both will rise from the west and lose their light.",
  "77571": "Their organs will testify against them. See 41:19-24.",
  "77572": "’Alaqah, meaning the embryo resembles a leech.",
  "77573": "This is the time before a human comes into being and as an embryo.",
  "77574": "The mixture of male and female gametes (sperm and egg) which form the zygote after fertilization.",
  "77575": "There will be no day or night, sun or moon, winter or summer in Paradise. It will always be bright and temperate.",
  "77576": "The word ṭahûr implies that once the believers take that pure drink, there will be no bad feelings in their hearts or ailments in their bodies.",
  "77577": "This verse refers to the five daily prayers: the dawn prayer, then noon and afternoon prayers, then sunset and late evening prayers, respectively.",
  "77578": "Extra prayers offered at night. See 73:20.",
  "77579": "See 23:12-14 and 22:5.",
  "77580": "lit., yellow camels. Black camels’ hair glistens yellow in sunlight.",
  "77581": "The pagans used to mock the teachings of the Quran (e.g., resurrection and judgment). They disagreed whether the Quran was magic, poetry, or fortune-telling.",
  "77582": "Just like tent pegs and icebergs, mountains go deep below the surface, slowing tectonic movement.",
  "77583": "i.e., the angel Gabriel.",
  "77584": "In the Hereafter, Allah will judge between all of His creation including animals, which will eventually become dust. The wicked will wish that they too were turned into dust so they do not have to go to the Fire, as reported in an authentic narration collected by Al-Ḥakim.",
  "77585": "The first Blast will cause everyone to die except those spared by Allah. Then the second one will cause the dead to come to life for judgment. See 39:68.",
  "77586": "The staff turning into a snake. See 20:17-23.",
  "77587": "This is from a human perspective. Otherwise, both the creation of the universe and the resurrection of humans are easy for Allah.",
  "77588": "The Arabic verb daḥa also suggests that the earth is egg-shaped. The noun form diḥya is still used in some Arab dialects to mean an egg. Based on 2:29, 41:9-12, and 79:27-33, Allah ordained both realms, then formed the earth and created its provisions, then formed the heaven into seven heavens—all in six ˹heavenly˺ Days. See footnote for 7:54.",
  "77589": "This is the second Blast which will cause the dead to come to life for judgment. See 39:68.",
  "77590": "Another possible translation: “What is this question? You ˹O Prophet˺ are one of its signs.” It is believed—based on authentic narrations from the Prophet—that he (ﷺ) is one of the signs of the Day of Judgment.",
  "76690": "After many years of persecution in Mecca, the Prophet (ﷺ) and many of his early followers decided to emigrate secretly to Medina, about 250 miles to the north, leaving behind their homes and valuables, which were soon taken over by the pagans of Mecca. To avenge  this financial loss, the Prophet (ﷺ) decided to capture an unarmed Meccan trade caravan headed by Abu Sufyân, a Meccan chief. Eventually, the caravan escaped, but the Meccans mobilized an army of over 1000 well-armed soldiers, more than three times the size of the Muslim force. Many Muslims had hoped to capture the caravan without having to meet the Meccan army in battle. Although the Muslims were vastly outnumbered and lightly-armed, they still won this decisive battle.",
  "76691": "Five thousand angels in total, as mentioned in 3:125.",
  "76692": "This happened the night before the battle.",
  "76693": "Before the battle, the Prophet (ﷺ) threw a handful of sand at the disbelievers and prayed for their defeat.",
  "76694": "This refers metaphorically to the disbelievers who fail to see and hear the truth.",
  "76695": "i.e., Mecca.",
  "76696": "The battle was not planned since the Muslim force was after the caravan. Had the two armies made plans to meet in battle at that time and place, they both probably would have missed each other.",
  "76697": "Who survived the Battle of Badr.",
  "76698": "i.e., ransom.",
  "76699": "The decree that ransoming captives will be allowed.",
  "76700": "This verse ended a previous ruling that allowed inheritance between Muslims from Mecca (Al-Muhâjirûn, the Emigrants) and Muslims from Medina (Al-Anṣâr, the Helpers). Now, only relatives can inherit from one another, whereas non-heirs can receive a share through bequest, up to one third of the estate. See 4:7, 11-13, 32-33, and 176.",
  "77591": "In a ḥadîth collected by At-Tirmiⱬi, a blind man by the name of ’Abdullâh ibn Um Maktûm, an early Muslim, came to the Prophet (ﷺ) seeking to learn more about the faith, while the Prophet (ﷺ) was in the middle of a discussion with an elite Meccan pagan, trying to convince him to abandon his idols and believe in the One True God. ’Abdullâh was so impatient that he interrupted the discussion several times. The Prophet (ﷺ) frowned and turned all his attention to the man he was already talking to. This Meccan sûrah was later revealed, telling the Prophet (ﷺ) that he should have tended to the faithful man who was eager to learn. After this sûrah was revealed, the Prophet (ﷺ) would honour ’Abdullâh, calling him ‘the man for whom my Lord rebuked me.’ He (ﷺ) even appointed him several times as his deputy over Medina.",
  "77592": "The way to true guidance or the way out of their mothers’ wombs.",
  "77593": "Burial is perceived as a way of honouring human beings after their death.",
  "77594": "This is the second Blast which will cause the dead to come to life for judgment. See 39:68.",
  "77595": "Ten-month pregnant camels were the most precious thing for nomadic Arabs. These camels were always cared for and treasured.",
  "77596": "All animals will be brought together for judgment and then they will be reduced to dust.",
  "77597": "On the Day of Judgment the oceans and seas will be on fire.",
  "77598": "Some pagan Arabs used to bury their infant daughters alive for fear of shame or poverty. This practice was condemned and abolished by Islam. See 16:58-59.",
  "77599": "Kanasa means to sweep or hide.",
  "77600": "lit., the day as it takes its first breath.",
  "77601": "i.e., Muḥammad (ﷺ).",
  "77602": "This is first time the Prophet (ﷺ) saw Gabriel in his angelic form. He saw him a second time in heaven during the Night Journey. See 53:5-15.",
  "77603": "See 26:210-212.",
  "77604": "Sijjîn is the name of a place (such as a confinement) in the depths of Hell.",
  "77605": "This is based on the commentary of Ibn Kathîr.",
  "77606": "’Illiyûn is an elevated place in Paradise.",
  "77607": "i.e., treasures and dead bodies.",
  "77608": "You will pass from life to death and from death to resurrection, from well-being to sickness and from sickness to well-being, from poverty to richness and from richness to poverty, etc.",
  "77609": "lit., they do not prostrate.",
  "77610": "The witness can be Allah, the angels, or the prophets, and the witnessed can be the people standing for judgment or the overwhelming events of Judgment Day.",
  "77611": "Testes and ovaries are formed in the abdomen of the fetus during the first weeks of pregnancy, before descending to their permanent place in the pelvis. Both are sustained by arteries originating between the backbone and the ribcage.",
  "77612": "Meaning, We will have you memorize the revelations and apply the rulings contained in them, unless one ruling is replaced by another.",
  "77613": "The Islamic way of life which brings about ease in this life and salvation in the next.",
  "77614": "Another possible translation: “Do they not ever reflect on rainclouds—how they are formed?”",
  "77615": "The Hellfire is the major punishment. The minor punishment includes disasters in this life as well as torments in the grave. See 32:21.",
  "77616": "Like many sûrahs, this one begins with an oath from Allah. He has the right to swear by any object of His creation (i.e., the sun, the moon, the stars, the dawn, or the angels). As for us, we are only allowed to swear by Allah alone.",
  "77617": "This refers to the first ten days of the month of Ⱬul-Ḥijjah, in which the rituals of pilgrimage are performed.",
  "77618": "i.e., pyramids and obelisks.",
  "77619": "lit., so your Lord poured on them a whip of punishment.",
  "77620": "They take over the inheritance of orphans and women.",
  "77621": "Another possible translation: “None has ever punished the way He will punish on that Day, nor has anyone bound the way He will bind.”",
  "76701": "This sûrah, which is perceived as a continuation of the previous sûrah, begins by openly terminating the peace treaties constantly violated by the pagans. The believers are urged to march forth with the Prophet (ﷺ) for the Battle of Tabûk in the summer of 9 A.H./631 C.E. Hypocrites are exposed and their false excuses are refuted. Muslims are reminded of how Allah turned the believers’ initial defeat into sweeping victory at the Battle of Ḥunain and how Allah saved His Messenger (ﷺ) from the pagans during his migration to Medina. Allah’s acceptance of repentance is echoed throughout the sûrah, hence its title.",
  "76702": "This is the only sûrah in the Quran that does not begin with: “In the Name of Allah—the Most Compassionate, Most Merciful.” The reason is that this sûrah is considered to be a continuation of the previous one, and that it begins with an open termination of treaties not fully respected by the polytheists. Since this constitutes a declaration of war, it would not be fitting to open with the mention of Allah’s compassion and mercy.",
  "76703": "The 10th of Ⱬul-Ḥijjah, a significant day in the greater pilgrimage (ḥajj). The lesser pilgrimage is known as ’umrah.",
  "76704": "i.e., inside or outside the sanctuary of the Sacred House in Mecca.",
  "76705": "This is known as the Treaty of Ḥudaibiyah, which was signed by the Prophet (ﷺ) and the pagans of Mecca in 6 A.H./628 C.E., diffusing the tension between Muslims and the Meccans and affirming a 10-year peace truce. The treaty was violated by the Meccans in 8 A.H/630 C.E.",
  "76706": "After the Muslims’ victory in Mecca in 8 A.H/630 C.E., almost all Arab tribes pledged allegiance to the Prophet (ﷺ) except some tribes such as Hawâzin and Thaqîf. Both tribes decided to attack the Muslims, so the Prophet (ﷺ) led an army of 12 000 soldiers to attack the two tribes. Since that was the largest Muslim army ever mobilized, some Muslims expressed their conviction that such an army could not be defeated. However, on the way to battle, the Muslim army was ambushed and most soldiers fled, except for the Prophet (ﷺ) and a few loyalists. Eventually, the Muslims were re-organized and won a decisive battle.",
  "76707": "lit., tranquility.",
  "76708": "i.e., angels.",
  "76709": "i.e., Allah will accept those who embrace Islam. Almost all of Arabia became Muslim before the death of Prophet Muḥammad (ﷺ) in 11 A.H./632 C.E.",
  "76710": "i.e., impure spiritually because of idolatry, not physically.",
  "76711": "The 9th year of the Prophet’s migration from Mecca to Medina.",
  "76712": "To fully understand this verse we need to bear in mind that Quranic verses are of two types. General verses talk about belief in Allah, good manners, and acts of worship. Specific verses, such as this verse, were revealed in regards to particular situations. This sûrah came at a time when the pagans of Arabia (and their allies) repeatedly violated treaties they had signed with the Prophet (ﷺ). Muslims had to fight for the survival of their newly established state in Medina. So this verse discusses dealing with those who violated their agreements and attacked the Muslims. Offenders were fought, unless they stopped their aggression. If they chose not to accept Islam, they were obligated to pay Jizya-tax.",
  "76713": "Taxation systems have existed since ancient times. There are several references in the Old Testament (e.g., Ezra 4:20). In the New Testament, Jesus allows paying taxes to Caesar (Luke 20:25). Under Islamic rule, all individuals had financial obligations—Muslims paid zakâh (2.5% of their savings) and non-Muslims (ⱬimmîs) were required to pay jizyah (tax for protection from foreign enemies). The jizyah was an average of one dinar (4.25 g of gold) annually. Women, children, the elderly, the clergy, the poor, and those who were unable to work were exempt. Those who opted to join the army were also exempt. Poor ⱬimmîs were supported financially by the state. Muslim rulers refunded the jizyah if they failed to protect their non-Muslim subjects.",
  "76714": "When ’Adi ibn Ḥâtim, a companion of the Prophet (ﷺ), heard this verse, he said, “But the Jews and Christians do not worship their rabbis and monks!” The Prophet (ﷺ) replied, “Do the rabbis and monks not forbid the permissible and permit the forbidden, and they obey them?” ’Adi answered, “Yes, they do.” The Prophet (ﷺ) concluded, “This is how they worship them.” Collected by At-Tirmiⱬi.",
  "76715": "i.e., religion of truth.",
  "76716": "i.e., the Preserved Tablet in which everything is written.",
  "76717": "The sacred months are the 11th, 12th, 1st, and 7th of the Islamic calendar. Since the polytheists knew that it was forbidden to fight in the sacred months, they used to transfer the sanctity to other months, say for example, the 3rd, 4th, 8th, and 10th as long as they maintained the sanctity of any four months throughout the year.",
  "76718": "The fast pace of the spread of Islam in Arabia in the 7th century was intimidating to the world’s two superpowers of that time: the Romans and Persians. The Prophet (ﷺ) received the news that a Roman army was being mobilized to launch an attack on the newly established Muslim state in Medina, so he announced that he was going to march to Tabûk, located over 700 miles to the north, to meet the Romans in the summer of 9 A.H./631 C.E. It was a time of hardship because of the scorching heat, the long distance, and the financial situation of the Muslims. Although the Prophet (ﷺ) was able to mobilize over 30 000 Muslims for battle, many others did not join the army with or without valid excuses. Eventually, the Roman forces were discouraged from fighting and fled to Damascus and other cities under Roman rule. Therefore, the Prophet (ﷺ) returned to Medina with a feeling of triumph. With a new power now emerging in Arabia, many tribes started to switch their alliances from Caesar to the Prophet (ﷺ).",
  "76719": "Abu Bakr Aṣ-Ṣiddîq, Islam’s first Caliph and a prominent figure in Islamic history. He accompanied the Prophet (ﷺ) during his emigration from Mecca to Medina after years of persecution at the hands of the Meccan pagans.",
  "76720": "For example, ’Abdullâh ibn Ubai ibn Salûl, a chief hypocrite, marched with the Prophet (ﷺ) for the Battle of Uḥud in the outskirts of Medina, then decided not to join the fight and returned to Medina with his followers who made up around one third of the Muslim army.",
  "76721": "Another hypocrite by the name of Jadd ibn Qais came to the Prophet (ﷺ) asking to be exempt from joining the army because he had a weakness for women and he was afraid that he would be tempted by Roman women.",
  "76722": "i.e., those who will repent.",
  "76723": "The overturned cities of Sodom and Gomorrah.",
  "76724": "i.e., some of them tried to assassinate the Prophet (ﷺ) on the way back from Tabûk.",
  "76725": "i.e., the early Muslims who emigrated from Mecca to Medina, known as Al-Muhâjirûn.",
  "76726": "i.e., those from Medina, known as Al-Anṣâr, who accepted Islam and sheltered Muslim emigrants from Mecca.",
  "76727": "Through disgrace in this world and bad ending of their lives.",
  "76728": "They have mixed their adherence to Islam with their disobedience to march forth with the Prophet (ﷺ) to Tabûk.",
  "76729": "This verse refers to Ka’b ibn Mâlik, Murarah ibn Rabi’, and Hilâl ibn Umaiyah, the three companions who remained in Medina with no excuse, but were honest about what they did. They were boycotted by Muslims for about fifty days until verses 118-119 of this chapter were revealed declaring the acceptance of their repentance.",
  "76730": "Abu ’Âmer Ar-Râhib was a monk who fought against Muslims at the Battle of Badr. He ordered a group of twelve hypocrites to build a mosque near the Mosque of Qubâ', the first mosque built by Muslims and also where the Prophet (ﷺ) and his companions would pray. The new mosque, commonly referred to as Masjid Aḍ-Ḍirâr (Mosque of Harm), was intended to attract other hypocrites and reduce the number of Muslims who prayed at Qubâ'. The hypocrites who built the mosque also anticipated the arrival of Abu ’Âmer with Roman forces to expel the Prophet (ﷺ) and Muslims out of Medina. Upon a request from these hypocrites, the Prophet (ﷺ) had planned to visit the new mosque once he returned from Tabûk, but verses 107-110 of this sûrah were revealed, warning the Prophet (ﷺ) against that mosque. According to some narrations, the Prophet (ﷺ) ordered this mosque to be burned down.",
  "76731": "See footnote for 7:46.",
  "76732": "Abraham promised to pray for his father’s forgiveness in 19:47 and 60:4, but when his father died as a disbeliever he discontinued praying for him.",
  "76733": "The Prophet (ﷺ) is forgiven for exempting all those who came to him with excuses regardless of their honesty, or for seeking forgiveness for the polytheists.",
  "76734": "i.e., hypocrites.",
  "76735": "Their hypocrisy is exposed over and over again.",
  "77622": "Other sûrahs describing the people of the right and the people of the left include 56 and 69.",
  "77623": "Or “… when it reflects the sun’s light.”",
  "77624": "It is true that while Qudâr ibn Sâlif was the individual who killed the camel, the rest of the people were supportive of what he did, so they were all punished collectively.",
  "77625": "And, by extension, anyone asking for help.",
  "77626": "The Prophet’s name is always mentioned in the call to prayer, along with Allah’s Name. Close to the end of each of the five daily prayers, worshippers invoke Allah’s blessings upon the Prophet (ﷺ) and his family. When someone reverts to Islam, they testify that Allah is their Lord and Muḥammad is His Messenger. Muslims, even those who are not practicing, love the Prophet (ﷺ) and many name their children after him.",
  "77627": "If a definite noun is repeated in Arabic, it means that we are referring to the same thing. For example, “I met the man and I gave the man some money.” But if an indefinite noun is repeated, it means we are referring to two different things. For example, “I met a man and I gave a man some money.” With this in mind, we realize that 94:5-6 refers to one hardship (a definite noun) and two different eases (an indefinite noun). Hence, the Arabic saying: “Two eases cannot be overcome by one hardship.”",
  "77628": "This passage refers to the land of figs and olives where Jesus (ﷺ) lived, Mount Sinai where Moses (ﷺ) communicated with Allah, and the city of Mecca where the Prophet (ﷺ) started his mission. A similar reference can be found in Deuteronomy 33:1, ˹Moses proclaimed:˺ “The Lord came from Sinai. Rising from Seir upon us, he [sic] shone forth from Mount Paran.” Seir is a mountain near Jerusalem, and Paran is a mountain near Mecca.",
  "77629": "’Alaq, meaning the embryo resembles a leech.",
  "77630": "Verses 1-5 are known to be the first ever revealed of the Quran. The Prophet (ﷺ) was retreating at a cave in the outskirts of Mecca when the angel Gabriel appeared to him, squeezing him tightly and ordering him to read. Since the Prophet (ﷺ) was unlettered, he responded, “I cannot read.” Ultimately, Gabriel taught him: “Read in the Name of your Lord …” Some scholars believe that this encounter is the fulfilment of Isaiah 29:12, which states, “Then the book will be given to the one who is illiterate, saying, ‘Read this.’ And he will say, ‘I cannot read.’”",
  "77631": "Abu Jahl was a staunch leader of the Meccan opposition to Islam. There are many authentic stories of his abuse of the Prophet (ﷺ).",
  "77632": "This refers to the frontal lobe of the brain, where reasoning is processed.",
  "77633": "It is also believed that the angels descend with all decreed matters for the whole year during that night (al-qadr also means ordainment or destiny).",
  "77634": "i.e., the angel Gabriel.",
  "77635": "lit., burdens (i.e., treasures and dead bodies).",
  "77636": "The believers will head to Paradise and the disbelievers will head to Hell.",
  "77239": "i.e., the angels, the sun, the moon, the stars, and the mountains.",
  "77240": "Their father Adam (ﷺ).",
  "77241": "This is when the Trumpet will be blown the second time.",
  "77242": "Other possible translations: 1. “It was you who used to pressure us.” 2. “It was you who tricked us in the name of the truth.” 3. “It was you who dissuaded us from doing good.” 4. “It was you who deceived us with false oaths.”",
  "77243": "This implies all sorts of delicacies, not just fruits.",
  "77244": "Facing each other implies that no one will have anything in their hearts against others.",
  "77245": "‘Baiḍun maknûn’ can also mean spotless eggs.",
  "77246": "It is assumed that they will ask each other about their lives in the world and what led them to Paradise.",
  "77247": "The pagans of Mecca used to make fun of the Prophet (ﷺ) when he warned them of this tree. They asked, “How can a tree grow in Hell?” So Allah revealed this verse in response.",
  "77248": "i.e., the believers in his family.",
  "77249": "Noah’s sons: Shem, Ham, and Japheth.",
  "77250": "His people reportedly made decisions based on constellations, so Abraham (ﷺ) pretended to do the same to convince them he was not able to join them at their pagan feast.",
  "77251": "See footnote for 26:82.",
  "77252": "Allah sent a ram to be sacrificed in place of Ishmael.",
  "77253": "The birth of Isaac is announced after the story of sacrifice. So this is a proof that the son who was going to be sacrificed was Ishmael, not Isaac. This is also supported by 11:71, where Sarah is told that she would give birth to Isaac, who would (reach adulthood and) have a son by the name of Jacob.",
  "77254": "Abraham or Ishmael.",
  "77255": "Lot’s wife.",
  "77256": "For abandoning his city without Allah’s permission.",
  "77257": "Before being swallowed and while inside the whale (see 21:87). The lesson is: good deeds are of great help during difficult times.",
  "77258": "The belly of the whale would have become his grave.",
  "77259": "The squash plant provided Jonah with shade and repelled harmful insects.",
  "77260": "Some pagan Arabs believed that the angels were Allah’s daughters. Some of them were ashamed to have daughters and took pride in their own sons.",
  "77261": "Both sexes are equal before Allah, so the verse questions pagan chauvinism.",
  "77262": "Or “Yet the jinn know well that they themselves will be brought ˹for judgment˺.” This is based on the claim of some pagan Arabs that the angels are Allah’s daughters through female jinn.",
  "77263": "The “Reminder” mentioned here refers to Scriptures such as the Torah and the Gospel. It is commonly used in the Quran as another name for Islam’s holy book.",
  "77264": "lit., when it lands in their courtyards.",
  "77364": "Another possible interpretation: “And those who fight in the cause of Allah.”",
  "77365": "Once in Paradise, the believers will recognize their mansions just like they recognized their homes in the world.",
  "77366": "Meaning, the disbelievers enjoy their life to the fullest while they are heedless of what will happen to them in the Hereafter, just like the cattle that graze in the pasture are unaware that they will probably end up in the slaughter house.",
  "77367": "The coming of Muḥammad (ﷺ) is one of the signs of the Hour.",
  "77368": "Like other prophets, Muḥammad (ﷺ) was infallible of sin. The verse here refers to misjudgments, such as the example given in 80:1-10. If the Prophet (ﷺ) himself is urged to seek forgiveness, then the believers are even more in need of praying for Allah’s forgiveness.",
  "77369": "As you did before Islam.",
  "77370": "i.e., your opposition to the Prophet (ﷺ)."
}